{
  "description": "'''Acid trance''' is a genre of [[trance music]] that emerged in the late 1980s, focusing on using the acid sound. The trademark sound of \"acid\" is produced with a Roland [[TB-303]] by playing a sequenced melody while altering the instrument's filter cutoff frequency, resonance, envelope modulation, and accent controls. This real-time tone adjustment was not part of the instrument's original intended operation. Acid trance is the best known form of trance music in [[Belgium]]. The form was first showcased at the popular [[Antwerp]] Rave 24 in Belgium, and has created four national number one singles in the country since.{{citation needed|date=September 2015}}\n\nAcid trance may be considered a descendant of [[acid house]], since the genre of trance had not yet been invented during the advent of acid house (or acidhouse).{{citation needed|date=June 2017}}\n\nAcid trance is typically a faster tempo than acid house music, which is a genre that came before the birth of trance. This specific subgenre has a more simplistic approach to arrangement than the trance music commonly associated with the late 1990s.\n\nThe first volumes of [[Trancemaster]] compilations contains a few tracks in acid trance style, just as [[classic trance]] tracks. The difference is, while acid trance tracks focus more on the changing TB-303 lines, classic trance (e.g. [[Dance 2 Trance]], [[Cosmic Baby]], [[The Age of Love (Age of Love single)|Age of Love]], and [[Jam & Spoon]]) tracks are more atmospheric, they use \"softer\" synth-lines, often strings and other [[ambient music]] elements. The line between these two styles is quite blurred; they also emerged about the same time.{{citation needed|date=September 2015}}\n\nAcid trance is often associated with the rise of Goa Trance, another trance subgenre that focuses on spirituality and uses imagery that is very complex and existential in nature. Goa Trance was created in the Indian state of [[Goa]]. Goa Gil is thought to be the father of this genre.\n\nThe term \"psytrance\" is often associated with acid trance, and these terms are used interchangeably (even though the genres are not exactly the same). However, typical \"acid\" sounds and effects are found in both genres. Typically samples are used that reference psychedelic drugs and religious topics. The umbrella genre of acid tends to reference psychedelic drugs as a variable of [[electronic dance music]] that is inseparable from the genre.\n\nDrug use appears to be ingrained in the culture of Acid Trance and other genres that derive from acid. Percussion in the genre seems to be manufactured to allow listeners on perspective altering substances to have a psychological response. The steady beating of the drum samples in the genre provides a solid intense base for the overlapping lead melodies typically found in acid trance.\n\nAcid trance artists are often grouped with their classical and Goa counterparts. It is not uncommon to see many of the first acid trance artists featured on [[Goa trance]] compilation albums. However, some of these artists{{who|date=September 2015}} never considered themselves part of the Goa or [[Psychedelic trance|psychedelic]] scene and these compilation albums were often done by their record labels who published acid trance alongside Goa artists.{{citation needed|date=September 2015}}",
  "top_artists": [
    "B.B.E.",
    "Hardfloor",
    "Kai Tracid",
    "Gary D."
  ]
}