{
  "description": "[[Hip-hop]] music has been popular in Africa since the early 1980s due to widespread [[African Americans|African American]] influence. In 1985, hip-hop reached [[Senegal]], a French-speaking country in West Africa. Some of the first Senegalese rappers were Munyaradzi Nhidza Lida, [[M.C. Solaar]], and [[Positive Black Soul]].\n\nThere also have been groups in [[Tanzania]] and other countries that emceed before 1989, that knows as Kwanza Unit although it is not very well known. During the late 1980s to mid 1990s, Stevano UGO, Lagos, Nigeria hit \"Earthquaking African MC\" became the first Afrobeat rap Artist playing on radio Ray Power FM released via Kennis Music founder, Kenny Ogungbe \"African Diddy, this sparked more awareness of bilingual rappers started to escalate all over Africa. Each region had a new type of style of hip hop. Rap elements are also found in [[kwaito]], a  subgenre of [[house music]] which was  developed in [[South Africa]] in the 1980s. Hip-Hop the genre itself was created by African Americans during the early 1970s in [[The Bronx]], New York. African Hip-hop and Rap has also women or girls like rapper. They began Rap in 1980 in south Africa and west Africa.{{page needed|date=January 2024}}\n\nWhile the consensus is that hip-hop originated in the Bronx, many scholars and enthusiasts argue that the genre's artistic roots can be traced back to Africa. Dating back to the 13th century, [[griot]]s were prominent figures in West African kingdoms and empires. These highly skilled orators, poets, musicians, praise singers and satirists traveled extensively, recounting the history of their empires through rhythmic and repetitive delivery. This well-established oral tradition is often cited as a precursor to rap, suggesting it may have laid the foundational groundwork for the emergence of hip-hop. [[Call and response (music)|Call-and-response]], popularized by artists like [[James Brown]], and featured in 1980s songs like [[Kurtis Blow]]'s \"[[The Breaks (song)|The Breaks]]\". Call-and-response has deep historical roots in African traditions, evident in the Igbo musical style of [[Ogene#Ogene as a musical genre|ogene music]], the foundational elements of [[fuji music]] and [[oríkì]] [[panegyric]]s performed by Yoruba priests.  African-American poetry groups, collectively called [[The Last Poets]] offered the earliest glimpse of Africa’s influence on Western hip-hop culture, during the [[Civil rights movement|Civil Rights movement]]. The group's vocal style incorporated elements of call-and-response and rhythmic chanting rooted in African cultural traditions. Moreover, the name \"The Last Poets\" was inspired by a poem titled \"Towards a Walk in the Sun\" by South African poet [[Keorapetse Kgositsile]].",
  "last_revision_date": "2025-12-10T09:26:26Z",
  "mixes": [
    {
      "playlist": "PLlYKDqBVDxX0PimTWhdm8hAX5bwStKwWH"
    }
  ],
  "top_artists": [
    "Rema (musician)",
    "Naeto C",
    "Pheelz",
    "Lil Kesh",
    "ELDee",
    "Daara J",
    "Ruggedman",
    "Didier Awadi",
    "Harrysong",
    "Dice Ailes"
  ]
}