{
  "description": "'''Afrobeats''', not to be confused with [[Afrobeat]] or [[Afroswing]], is an umbrella term to describe popular music from [[West Africa]] and the diaspora that initially developed in [[Ghana]], [[Nigeria]], and the [[United Kingdom|UK]] in the 2000s and 2010s. Afrobeats is less of a style per se, and more of a descriptor for the fusion of sounds flowing out of Ghana and Nigeria. Genres such as [[hiplife]], [[jùjú music]], [[highlife]], azonto music, and naija beats, among others, were amalgamated under the \"Afrobeats\" umbrella.\n\nAfrobeats is primarily produced in [[Accra]], [[Lagos]], and [[London]]. Historian and cultural critic [[Paul Gilroy]] reflects on the changing London music scene as a result of shifting demographics:\n\n<blockquote>We are moving towards an African majority which is diverse both in its cultural habits and in its relationship to colonial and postcolonial governance, so the shift away from Caribbean dominance needs to be placed in that setting. Most of the [[Grime (music genre)|grime]] folks are African kids, either the children of migrants or migrants themselves. It's not clear what Africa might mean to them.</blockquote>\n\n\n\nIn his earlier book, ''[[The Black Atlantic]]'', Gilroy rejects the notion that Black culture and music can be bound to one geographical region. Afrobeats exemplifies this syncretism as a transnational genre that since 2019 has received international attention. David Drake writes about popular Nigerian music noting it is \"Picking up on trends from the U.S., Jamaica, and Trinidad, they reimagine diasporic influences and—more often than not—completely reinvent them.\"\n\nAfrobeats began to experience widespread global mainstream acclaim in the late 2010s, with artists achieving success across Africa, Europe, and North America. Between 2017 and 2022, Afrobeats experienced a 550% growth in streams on [[Spotify]]. In response, it has been referred to as one of Africa's 'biggest cultural' or 'musical' exports.",
  "top_artists": [
    "Davido",
    "Wizkid",
    "Burna Boy",
    "Rema (musician)",
    "Tems",
    "Tiwa Savage",
    "Olamide",
    "Diamond Platnumz",
    "D'banj",
    "Ayra Starr"
  ]
}