{
  "description": "'''Afro-Caribbean music''' is a broad term for music styles originating in the [[Caribbean]] from the [[African diaspora]]. These types of music usually have [[West African]]/Central African influence because of the presence and history of [[Ethnic groups of Africa|African people]] and their [[Lineal descendant|descendant]]s living in the Caribbean, as a result of the [[trans-Atlantic slave trade]]. These distinctive musical art forms came about from the cultural mingling of African, Indigenous, and European inhabitants. Characteristically, Afro-Caribbean music incorporates components, instruments and influences from a variety of African cultures, as well as Indigenous and European cultures. \n\nAfro-Caribbean music has been influenced by historical and stylistic influences. Historically, Afro-Caribbean music was influenced by the transatlantic slave trade and later, by the resistance and emancipation of slaves. Stylistically, afro-Caribbean music has been influenced by various African, European and Indigenous Latin American influences. African influences are reflected by many of the [[Rhythm]]s, vocal characteristics and instruments that are used in afro-Caribbean music. Afro-Caribbean music shares many commonalities with traditional European style music, using many European instruments, harmonies and melodies in music of the genre. Indigenous Latin American influence can be seen through the use of percussive instruments and certain vocal techniques. Afro-Caribbean music has many common musical characteristics, including the use of [[Polyrhythm]]s, [[Call and response (music)|call-and-response]] invocations and a variety of instruments. Instruments commonly used in afro-Caribbean music include drums, other percussion instruments, and guitars. \n\nAlthough the roots of afro-Caribbean music go back to the 15th century, the official local industry only began in the 1920s. Following this, afro-Caribbean music gained global popularity throughout the 20th century. As afro-Caribbean music gained popularity, many sub-genres began to emerge. These sub-genres include: [[son cubano]], [[Salsa music|salsa]], [[Calypso music|calypso]], [[Soca music|soca]], [[mento]], [[ska]], [[reggae]] and [[Merengue music|merengue]].",
  "top_artists": [
    "Taina Asili",
    "Grand Baton (band)",
    "Rebeca Mauleon",
    "Candita Batista",
    "Grupo Illiniza",
    "Aurelio Martínez",
    "Papo Vázquez"
  ]
}