{
  "description": "'''Ambasse bey''' or '''ambas-i-bay''' is a style of [[folk music|folk]] [[music of Cameroon|music]] and [[dance in Cameroon|dance]] from [[Cameroon]]. The music is based on commonly available instruments, especially [[guitar]], with [[percussion]] provided by sticks and bottles. The music is faster-paced than [[assiko]].\n\nJohn Hall described its rhythm as the one of a moving broom. Where dancers swing their shoulders like the wings of birds, the dance is composed of sequences of fluid steps and jerky body movements performed in accordance with the music, which is generally the [[makossa]]. In order to perform this dance, the dancers must wear traditional [[sawa people|sawa]] outfits.\n\nAmbasse bey originated among the [[Yabassi (people)|Yabassi]] ethnic group and grew popular in [[Douala]] after [[World War II]]. Through the 1950s and 1960s, the style evolved in the Cameroonian [[Littoral Province (Cameroon)|Littoral]]. In the mid-1960s, [[Eboa Lotin]] performed a style of ambasse bey on harmonica and guitar that was the earliest form of [[makossa]], a style that quickly came to overshadow its predecessor and become Cameroon's most popular form of indigenous music. Ambasse bey was revived to an extent by Cameroonian singer [[Sallé John]]. \n\n\"Given the cultural diversity that Sallè John's country boasts, every Cameroonian citizen must be proud and jealous of the enormous cultural and artistic potential that our dear and beautiful country abounds in. In terms of performing arts, pride is even more enticing with heritage dances in unique styles. This is the case, for example, of the Ambass Bey, this heritage rhythm that leaves no one indifferent and without any emotion.\"\n\nThese are the words of the author Olivier Charly. \n\nThe Ambass Bey is the most stylish traditional dance after the Makonè among the Bassa people. Of Sawa origin, the Ambass Bey is one of the most widespread dance expressions in the Littoral region. It was inspired and modeled on German dances during the colonial period. But this style spread very quickly among the Doualas, the Pongos, and the Bankons since the 1920s and 1930s. The Ambass Bey is therefore used to enliven festive or funeral ceremonies.\n\nA very acoustic music, the Ambass Bey is played mainly with the guitar and the Conga (Njembe) for some. It is danced in couples or solo. Here in a very choreographed style, as if suffering from bird flu, the dancers move their shoulders with feeling, elegance and synchronization like sparrowhawks. The dance begins with the execution of the steps of the \"Mudun'a Sombo\" (the old monkey). It is a way to enter into communion with the ancestors and gather positive forces that will allow them to ward off the negative ones present. After the steps of the \"Mudun' a Sombe\" follows a lively animation with a sequence of very fast and fluid steps. The bodies move very skillfully, all in accordance with the music. Also, a singer holding the microphone mimes melodies to the rhythm of his. It is a truly incredible show.\n\nThe appropriate clothing for the \"Ambass Bey\" is the loincloth (Sanja) for men) and the Kaba for women. To perform it, couples (men and women) must be formed. They hold each other's hands and twirl according to the instructions of the maestro who is generally in the middle or in front. He gives the instructions in German using expressions such as \"Seis Taché\", \"Drempa\", \"Cona drempa\", \"Rouillé\" or \"Lalala lai sobèlè\" to name but a few.\n\nAccording to several contemporaries, the Ambass Bey was first taught in Douala by the Dayas family, notably Joseph Dayas and Engom'a Dayas at Bonadouma Home. For some, the popularization and popularization of the Ambass Bey movement are unequivocally attributed to Tchako around 1952. And for others, it is the work of the legend Sallè John around the 1960s. He was therefore nicknamed the \"King of Ambass Bey.\" A tribute was paid to him in 2019 during the celebration of the traditional Sawa festival (Ngondo). Several other figures have contributed greatly to this movement, such as Lobè Ramaud and Belmond M'Packo. As for his music, the genius Manulo is likely one of the first people who succeeded in placing the guitar on this heritage rhythm.",
  "last_revision_date": "2025-11-30T17:16:39Z",
  "mixes": [
    {
      "playlist": "PL6A4E6EAE5844CEF5"
    }
  ],
  "top_artists": []
}