{
  "description": "'''Balkan brass''', popularly known by the [[Serbian language|Serbian]] name ''Truba'' ({{lang-sr-Cyrl|Труба}}, \"Trumpet\"), is a distinctive style of music originating in the Balkan region as a fusion between military music and [[folk music]]. In recent years{{when|date=October 2020}}, it has become popular in a techno-synth fusion throughout Europe, and in pop music in the Anglo-American sphere and throughout the world.  Songs like [[Worth It (Fifth Harmony song)|Worth It]] by [[Fifth Harmony]] and [[Talk Dirty (Jason Derulo song)|Talk Dirty]] by [[Jason Derulo]] have brought the style to a new audience. In traditional form, it is popular throughout the [[Balkans]], especially in [[Serbia]], [[North Macedonia]], [[Bulgaria]], [[Moldova]], and [[Romania]], although the turbo-folk variety attracts larger audiences. The energetic and fast [[Beat (music)|beats]] encourage dance and are egalitarian, often resulting in participation by the entire audience; this unpretentious relationship with audiences, highly charged energy and loud and joyful performances by highly skilled musicians has contributed to its successes. Fans of bands inspired by Balkan bands, such as [[Gogol Bordello]], often state that it is a type of music better experienced than listened to.\n\nIt is sometimes accompanied by a ''[[kolo (dance)|kolo]]'', a traditional [[South Slavs|South Slavic]] communal dance where in its simplest forms, the two steps forward, one step backward choreography, is designed to encourage the participation of all.\n\nPerformers are called ''trubači'' (''трубачи'') in the [[Serbo-Croatian]], or less commonly, ''trubari.'' Some of the best known examples of acclaimed music in this style are the [[Goran Bregović]] Band and the [[Boban Marković|Boban Marković Orkestar]]. Roma have adopted this tradition and make up a large percentage of Balkan brass bands.\n\nThe [[Cinema of Serbia|Serbian film maker]] [[Emir Kusturica]] has, through his films (''[[Black Cat, White Cat]]''), made the style popular in the international community outside the Balkans.\n\nThe biggest [[brass band]] event in the world, the [[Guča Trumpet Festival]], is a 5-day annual festival with 300,000 visitors, in [[Guča]], [[Serbia]]."
}