{
  "description": "A key element of balls is also the music, which is typically characterized by distinct uptempo beats that are overlaid with the \"raps\" of commentators or emcees. Lyrics are just as stylized as the beats and often praise queerness and femininity through typically vulgar language and usage of words like \"cunt\" and \"pussy\". Historically, the music featured at balls has been whatever is popular within the black LGBT community at the time, ranging from disco, to club music, to house, to rap and R&B. House music, the primary sound of the balls, is always upwards of 120 beats per minute and has African roots, which is reflected in the rhythm.\n\nToday, it is common for older house classics like \"Work This Pussy\" by [[Junior Vasquez|Ellis D]], \"Cunty\" by [[Kevin Aviance]], and \"The Ha Dance\" by [[Masters at Work]] to be remixed into new hits by the current wave of DJs and producers. Ballroom Icon DJ's Vjuan Allure, [[Angel X]], and [[MikeQ]], were the first DJs considered to have developed the first remixes of ballroom sound. In order, Vjuan Allure was the first to remix \"The Ha Dance\" in 2000, followed by Angel X in 2002, and then MikeQ in 2005. Overall, ball culture has been a fertile ground for new forms of [[house music]] and other genres of [[electronic dance music]] through its [[Disc jockey|DJs]].\n\nAccording to [[PBS]] Sound Field interview with [[MikeQ]], one of ball music's pioneers, ball music started as house music that was being played at ballroom parties. Over time, distinct features of ball music emerged, for instance the \"Ha\" crash, being placed on the every fourth of [[Four to the floor|4 beats]] and the minimal repetitive vocals, provided by ball commentators. The \"Ha\" crash cymbals often signify the time for ball dancers to strike a pose or hit the floor. Modern vogue music, along with house, incorporates elements of [[disco]], [[funk]], [[hip hop music|hip hop]], [[contemporary R&B]], [[Jersey club]] and other electronic music.\n\nThe culture has also influenced a wave of [[LGBT hip hop|queer hip hop]] artists such as [[Zebra Katz]], [[House of Ladosha]], and [[Le1f]].",
  "last_revision_date": "2025-09-19T05:53:49Z",
  "top_artists": [
    "Lsdxoxo",
    "Njena Reddd Foxxx"
  ]
}