{
  "description": "'''Barbershop''' [[vocal harmony]] is a style of [[a cappella]] [[close harmony]], or unaccompanied [[vocal music]], characterized by [[consonance and dissonance|consonant]] four-part [[chord (music)|chord]]s for every melody note in a primarily [[homorhythmic]] texture.{{sfn|Committee|2020|p=2-1}} Each of the four parts has its own role: generally, the [[Lead singer|lead]] sings the melody, the [[tenor]] harmonizes above the melody, the [[Bass (vocal range)|bass]] sings the lowest harmonizing notes, and the [[baritone]] completes the chord, usually below the lead. The melody is not usually sung by the tenor or baritone, except for an infrequent note or two to avoid awkward [[voice leading]], in [[Tag (Barbershop)|tags]] or [[Coda (music)|codas]], or when some appropriate [[ornament (music)|embellishment]] can be created.  One characteristic feature of barbershop harmony is the use of what is known as \"snakes\" and \"swipes\". This is when a chord is altered by a change in one or more non-melodic voices.  Occasional passages may be sung by fewer than four voice parts.\n\nBarbershop music is generally performed by either a '''[[barbershop quartet]]''', a group of four typically male singers with one on each vocal part, or a '''barbershop chorus''', which closely resembles a [[choir]] with the notable exception of the genre of music.\n\nAccording to the [[Barbershop Harmony Society]] (BHS), \"Barbershop music features songs with understandable lyrics and easily singable melodies, whose tones clearly define a tonal center and imply major and minor chords and barbershop (dominant and secondary dominant) seventh chords that resolve primarily around the [[circle of fifths]], while making frequent use of other resolutions.\" Slower barbershop songs, especially ballads, often eschew a continuous beat, and notes are often held (or sped up) [[ad libitum]].\n\nAside from the [[Bass (voice type)|bass]], the voice parts in barbershop singing do not correspond closely to their classical music counterparts; the tenor range and [[tessitura]] are similar to those of the classical [[countertenor]] (including the fact that they sing their highest notes primarily in [[falsetto]], as a countertenor would), the baritone resembles a high [[lyric baritone]] in range and a [[tenor]] in tessitura, and the lead generally corresponds to the [[tenor]] of classical repertoire, with some singers possessing a tessitura more similar to that of a [[Baritenor|high baritone]]. Barbershop singing is performed both by men's and women's groups; the elements of the barbershop style and the names of the voice parts are the same for both.",
  "last_revision_date": "2025-10-03T10:42:50Z",
  "mixes": [
    {
      "playlist": "PLcwXdNVvSNbjfMAxEycPuQEP5zC0UwuTf"
    }
  ],
  "top_artists": [
    "The Chordettes",
    "The Four Freshmen",
    "Barbershop Harmony Society",
    "The Society of Orpheus and Bacchus",
    "Bluegrass Student Union",
    "Buffalo Bills (quartet)",
    "Max Q (quartet)",
    "Old School (quartet)",
    "Platinum (quartet)",
    "Crossroads (quartet)"
  ]
}