{
  "description": "'''Beach music''', also known as '''Carolina beach music''', and to a lesser extent, '''beach pop''', is a regional genre of music in the United States which developed from [[Rock and roll|rock]]/[[R&B]] and [[pop music]] of the 1950s and 1960s. Beach music is most closely associated with the style of dance known as the shag, or the [[Carolina shag]], which is also the official state dance of both [[North Carolina]] and [[South Carolina]]. Recordings with a 4/4 \"[[blues shuffle]]\" rhythmic structure and moderate-to-fast tempo are the most popular music for the shag, and the vast majority of the music in this genre fits that description.\n\nThough primarily confined to a small regional fan base, specifically to \"[[Grand Strand]]\" communities such as [[Myrtle Beach, South Carolina|Myrtle Beach]], [[Carolina Beach, North Carolina|Carolina Beach]], and the [[Golden Isles of Georgia]], in its early days what is now known as Carolina beach music was instrumental in bringing about wider acceptance of [[soul music]]/[[rhythm and blues|R&B]] among the white music lovers on the south-east coast.\n\nWhile the older styles of R&B have faded from popularity nationally, the Carolina shag has gained wide popularity in dance circles around the US. This has not generally led to increased appreciation for the music of the beach bands, however. Many of these new shag dance aficionados prefer the \"R&B oldies\" and/or shagging to currently popular tunes that happen to have the required beat. As more networking is being done on the Internet among shag deejays and beach music fans nationwide, however, there is a growing acceptance of the regional bands by the \"new shaggers\".",
  "last_revision_date": "2025-09-08T19:28:30Z",
  "mixes": [
    {
      "playlist": "PLa_EfAFf0GP8IljeeNJ6fcenDLO9c9xI8"
    }
  ],
  "top_artists": [
    "Bill Pinkney",
    "The Tams",
    "The Swingin' Medallions",
    "Clifford Curry",
    "Gap Dream",
    "Band of Oz",
    "The Barefoot Man"
  ]
}