{
  "description": "'''Melodic black-death''' (also known as '''blackened melodic death metal''' or '''melodic blackened death metal''') is a genre of [[extreme metal]] that describes the style created when melodic death metal bands began being inspired by [[black metal]] and European [[romanticism]]. However, unlike most other black metal, this take on the genre incorporates an increased sense of melody and narrative. Some bands who have played this style include [[Dissection (band)|Dissection]],{{sfn|Ekeroth|2008|p=267}} [[Sacramentum (band)|Sacramentum]], [[Naglfar (band)|Naglfar]], [[Dawn (Swedish band)|Dawn]], [[Unanimated]], [[Thulcandra (band)|Thulcandra]], [[Skeletonwitch]], and [[Cardinal Sin (band)|Cardinal Sin]].\n\nSweden's Dissection evolved alongside melodic death metal bands such as [[At the Gates]] and [[In Flames]], by building upon the musical foundation laid by death metal and incorporating guitar melodies and harmonies amongst the standard brutality of the genre. However, unlike the other bands, Dissection began incorporating influences from black metal into their music, which lead to their debut album ''[[The Somberlain]]'' influencing a plethora of subsequent bands and Metal Injection dubbing them \"one of the most important extreme metal bands of all time\". Sacramentum's debut and second albums ''[[Far Away from the Sun]]'' and ''The Coming of Chaos'' would then continue Dissection's style of black metal-infused melodic death metal, based around middle of the neck guitar riffing and howling vocals, while Vinterland would lean even more upon their black metal predecessors like Norway's [[Emperor (Norwegian band)|Emperor]]. [[Naglfar (band)|Naglfar]] would base their sound primarily within that of [[Gothenburg metal]] bands like In Flames and [[Dark Tranquility]], by taking a brighter and thrashier take on the style.",
  "last_revision_date": "2025-08-30T09:16:26Z",
  "top_artists": [
    "God Dethroned",
    "Naglfar (band)",
    "Sacramentum (band)",
    "Epoch of Unlight",
    "Thulcandra (band)",
    "Unanimated",
    "Dawn (Swedish band)",
    "Obscurity (band)",
    "Cardinal Sin (band)"
  ]
}