{
  "description": "'''Blues''' is a [[music genre]] and form that emerged among African Americans in the [[Deep South]] of the United States during the1860s.  It draws heavily from African American traditions such as spirituals, work songs, field hollers, shouts, chants, and simple rhymed ballads. The blues has deeply influenced genres such as  [[jazz]], [[rhythm and blues]], and [[rock and roll]], and is characterized by the [[Call and response (music)|call-and-response]] pattern, the [[blues scale]], and specific [[chord progression]]s, of which the [[twelve-bar blues]] is the most common. [[Blue note]]s (or \"worried notes\"), usually thirds, fifths or sevenths flattened in [[Pitch (music)|pitch]], are also an essential part of the sound. Blues [[shuffle note|shuffles]] or [[walking bass]] reinforce the trance-like rhythm and form a repetitive effect known as the [[groove (popular music)|groove]].\n\nBlues music is characterized by its [[lyrics]], [[Bassline|bass lines]], and [[Instrumentation (music)|instrumentation]]. Early [[traditional blues verse]]s consisted of a single line repeated four times. It was only in the first decades of the '''20th century''' that the most common current structure became standard: the [[Bar form|AAB pattern]], which are still used in jazz and R&B today, and consisting of a line sung over the four first bars, its repetition over the next four, and then a longer concluding line over the last bars. Early blues frequently took the form of a loose narrative, often relating the [[racial discrimination]] and other challenges experienced by African Americans.\n\nMany elements, such as the [[Call and response (music)|call-and-response]] format and the use of blue notes, can be traced back to [[music of Africa|music in Africa]]. The origins of the blues are also closely related to the religious music of the African-American community, the [[spiritual (music)|spirituals]]. The first appearance of the blues is often dated to after the [[Abolitionism in the United States|ending of slavery]] and the development of [[juke joint]]s occurring later. It is associated with the newly acquired freedom of the former slaves. Chroniclers began to report about blues music at the dawn of the '''20th century'''. The first publication of blues sheet music was in 1908. Blues has since evolved from unaccompanied vocal music and oral traditions of slaves into a wide variety of styles and subgenres. Blues [[List of blues genres|subgenres]] include: [[country blues]], [[Delta blues|Delta blues,]] and [[Piedmont blues]], as well as urban blues styles such as [[Chicago blues]] and [[West Coast blues]]. [[World War II]] marked the transition from acoustic to [[electric blues]] and the progressive opening of blues music to a wider audience, especially white listeners. In the 1960s and 1970s, a hybrid form called [[blues rock]] developed, which blended blues styles with [[rock music]].",
  "last_revision_date": "2025-10-20T06:02:06Z",
  "mixes": {
    "help_reason": "Blues is too varied a genre for me to find a single mix that speaks to its wholeness, and I don't want to reduce it to a single style. If you find a mix that's truly representative of blues as a whole, send it in!"
  },
  "top_artists": [
    "Bob Dylan",
    "Elvis Presley",
    "Elton John",
    "The Rolling Stones",
    "Willie Nelson",
    "Jimi Hendrix",
    "Ray Charles",
    "Adele",
    "Frank Zappa",
    "Ella Fitzgerald"
  ]
}