{
  "description": "'''Bluegrass music''' is a [[Music genre|genre]] of [[American roots music]] that developed in the 1940s in the [[Appalachia]]n region of the [[United States]]. The genre derives its name from the band [[Bill Monroe|Bill Monroe and the Blue Grass Boys]]. Bluegrass has roots in African American genres like [[blues]] and [[jazz]] and North European genres, such as [[Irish Ballads|Irish ballads]] and [[dance tune]]s. Unlike country, it is traditionally played exclusively on [[Acoustic music|acoustic]] instruments such as the fiddle, mandolin, banjo, guitar and upright bass.  It was further developed by musicians who played with Monroe, including 5-string banjo player [[Earl Scruggs]] and guitarist [[Lester Flatt]]. Bill Monroe once described bluegrass music as, \"It's a part of [[Methodism|Methodist]], [[Holiness movement|Holiness]] and [[Baptists|Baptist]] traditions. It's blues and jazz, and it has a high lonesome sound.\"\n\nBluegrass features acoustic stringed instruments and emphasizes the [[Beat (music)#On-beat and off-beat|off-beat]]. The off-beat can be \"driven\" (played close to the previous bass note) or \"swung\" (played farther from the previous bass note). Notes are anticipated, in contrast to laid-back blues where notes are behind the beat; this creates the higher energy characteristic of bluegrass. In bluegrass, as in most forms of jazz, one or more instrumentalists take a turn playing the melody and improvising around it, while the others perform [[accompaniment]]; this is especially typified in tunes called [[Breakdown (music)#Bluegrass|breakdowns]]. This is in contrast to [[old-time music]], where all instrumentalists play the melody together, or one instrument carries the lead throughout while the others provide accompaniment. Breakdowns are often characterized by rapid [[tempo]]s and unusual instrumental dexterity, and sometimes by complex [[chord change]]s.",
  "last_revision_date": "2025-07-18T02:27:49Z",
  "mixes": [
    {
      "video": "C0kKLtuCtP8"
    }
  ],
  "top_artists": [
    "Dolly Parton",
    "Steve Martin",
    "Alison Krauss",
    "David Grisman",
    "Vince Gill",
    "Alan Jackson",
    "Jerry Garcia",
    "Ricky Skaggs",
    "Bill Monroe",
    "Earl Scruggs"
  ]
}