{
  "description": "'''Bolero''' is a genre of [[song]] which originated in [[Oriente Province|eastern Cuba]] in the late 19th century as part of the [[trova]] tradition. Unrelated to the older [[Bolero (Spanish dance)|Spanish dance of the same name]], bolero is characterized by sophisticated lyrics dealing with love. It has been called the \"quintessential Latin American romantic song of the twentieth century\".\n\nUnlike the simpler, thematically diverse ''[[canción]]'', bolero did not stem directly from the European lyrical tradition, which included Italian [[opera]] and [[canzone]], popular in urban centers like Havana at the time. Instead, it was born as a form of romantic folk poetry cultivated by a new breed of [[troubadour]] from [[Santiago de Cuba]], the ''trovadores''. [[Pepe Sánchez (trova)|Pepe Sánchez]] is considered the father of this movement and the author of the first bolero, \"Tristezas\", written in 1883. Originally, boleros were sung by individual ''trovadores'' while playing [[guitar]]. Over time, it became common for trovadores to play in groups as ''dúos'', ''tríos'', ''cuartetos'', etc. Thanks to the [[Trío Matamoros]] and, later, [[Los Panchos|Trío Los Panchos]], bolero achieved widespread popularity in Latin America, the United States and Spain. At the same time, Havana had become a fertile ground where bolero composers met to create compositions and improvise new tunes; it was the so-called ''[[Filin (music)|filin]]'' movement, which derived its name from the English word \"''feeling''\". Many of the genre's most enduring pieces were written then and popularized in radio and cabaret performances by singers such as [[Olga Guillot]] and [[Elena Burke]], backed by orchestras and big bands.\n\nBoleros are generally in 4/4 time and, musically, compositions and arrangements might take a variety of forms. This flexibility has enabled boleros to feature in the repertoire of Cuban [[son cubano|son]] and [[Cuban rumba|rumba]] ensembles, as well as Spanish [[Copla (music)|copla]] and [[flamenco]] singers, since the early 20th century. Occasionally, boleros have been merged with other forms to yield new subgenres, such as the bolero-son, popular in the 1930s and 1940s, and the bolero-cha, popular in the 1950s. In the United States, the [[rhumba]] ballroom dance emerged as an adaptation of the bolero-son in the 1930s. Boleros can also be found in the [[African rumba]] repertoire of many artists from [[Kinshasa]] to [[Dakar]], due to the many bolero records that were distributed to radios there as part of the [[G.V. Series]].\n\nThe popularity of the genre has also been felt as far as Vietnam, where it became a fashionable song style in [[South Vietnam]] before the [[Fall of Saigon]] in 1975 and remains popular with the Vietnamese."
}