{
  "description": "'''Boogie-woogie''' is a [[Music genre|genre]] of [[blues]] music that became popular during the late 1920s, but already developed in African-American communities since the 1870s. It was eventually extended from piano to piano duo and trio, guitar, [[big band]], [[country music|country and western]], and [[Gospel music|gospel]]. While standard blues traditionally expresses a variety of emotions, boogie-woogie is mainly [[dance music]] (although not usually played for the competitive [[boogie-woogie (dance)|dance known as boogie-woogie]], a term of convenience in that sport). The genre had a significant influence on [[rhythm and blues]] and [[rock and roll]]. \n\nIn Texas the piano style that was used was known as \"fast western\". The basic Boogie Woogie rhythm, which was an outgrowth of [[ragtime]] and [[rural blues]], has been inspired by the rhythmic clacking of [[Steam locomotive|steam locomotives]] throughout the [[Deep South]].\n\nMusical scholars and researchers claim that African American piano players would travel up and down the turpentine camps and entertain workers after a long hard day with upbeat blues within bars. This is where boogie boogie piano music was born.\n\nBoogie-woogie waned in popularity in the 1930s, but enjoyed a resurgence and its greatest acclaim in the 1940s, reaching audiences around the world. Among its most famous acts was the \"Boogie Woogie Trio\" of [[Pete Johnson (musician)|Pete Johnson]], [[Albert Ammons]], and [[Meade \"Lux\" Lewis]]. Other famous boogie woogie pianists of this peak era were [[Maurice Rocco]] and [[Freddie Slack]]. There were also many very notable women boogie woogie pianists during this time, including [[Hadda Brooks]], [[Winifred Atwell]], [[Martha Davis (singer)|Martha Davis]], and [[Hazel Scott]], as well as in later years, such as [[Katie Webster]]. \n\nhttps://timeline.carnegiehall.org/performers/charles-cow-cow-davenport",
  "last_revision_date": "2025-11-05T08:29:49Z",
  "mixes": [
    {
      "video": "_ahh9x3SySU"
    }
  ],
  "top_artists": [
    "Jerry Lee Lewis",
    "Fats Domino",
    "Jools Holland",
    "Nicky Hopkins",
    "Liberace",
    "Sam Phillips",
    "The Andrews Sisters",
    "Pinetop Perkins",
    "Brent Mydland",
    "Keith Godchaux"
  ]
}