{
  "description": "'''Bossa nova''' ({{IPA|pt|ˈbɔsɐ ˈnɔvɐ|-|Br-BossaNova.ogg}}) is a relaxed style of [[samba]]{{refn|\"The center of bossa nova remains, as for samba and subgenre of jazz, the song. Its intuition is lyrical and, even in the most sophisticated products, demands that one believes in a kind of spontaneity. Jazz, whose fundamental intuition is of a technical nature, privileges the chord\".{{sfn|Mammi|1992|pp=63-64}}|group=nb}} developed in the late 1950s and early 1960s in [[Rio de Janeiro]], [[Brazil]].{{sfn|EBC|2018}} It is mainly characterized by a calm [[syncopation|syncopated]] rhythm with chords and fingerstyle mimicking the beat of a samba groove, as if it was a simplification and stylization on the guitar of the rhythm produced by a [[samba school]] band. Another defining characteristic of the style is the use of unconventional chords in some cases with complex progressions and \"ambiguous\" harmonies.{{sfn|Ratliff|2019}}{{sfn|Lopes|Simas|2015|p=46}} A common misconception is that these complex chords and harmonies were derived from [[jazz]], but samba guitar players have been using similar [[arrangement]] structures since the early 1920s, indicating a case of [[parallel evolution]] of styles rather than a simple transference from jazz to bossa nova.{{sfn|Lopes|Simas|2015|p=48}}{{sfn|Garcia|2019}} Nevertheless, bossa nova was influenced by jazz, both in the harmonies used and also by the instrumentation of songs, and today many bossa nova songs are considered [[jazz standard]]s. The popularity of bossa nova has helped to renew samba and contributed to the modernization of [[Music of Brazil|Brazilian music]] in general.\n\nOne of the major innovations of bossa nova was the way to synthesize the rhythm of samba on the [[classical guitar]].{{sfn|EBC|2018}}{{sfn|Garcia|2019}} According to musicologist [[Gilberto Mendes]], the bossa nova was one of the \"three rhythmic phases of samba\", in which the \"bossa beat\" had been extracted by [[João Gilberto]] from the traditional samba.{{sfn|Lopes|Simas|2015|p=48}} The synthesis performed by [[João Gilberto|Gilberto]]'s guitar was a reduction of the \"[[batucada]]\" of samba, a stylization produced from one of the percussion instruments: the thumb stylized a [[surdo]]; the index, middle and ring fingers phrased like a tamborim.{{sfn|Garcia|2019}} In line with this thesis, musicians such as [[Baden Powell (guitarist)|Baden Powell]], [[Roberto Menescal]], and [[Ronaldo Bôscoli]] also understand the bossa nova beat as being extracted from the [[tamborim]] play in the [[bateria]].{{sfn|Garcia|1999|p=21}}"
}