{
  "description": "'''Brega''' is a Brazilian musical style and genre that encompasses a variety of rhythms, making it difficult to define a single musical aesthetic. The term emerged pejoratively, used to characterize the romantic and dramatic music of the 1940s and 1950s, considered low-quality or \"tacky.\" Its musical origins are linked to [[samba-canção]], [[bolero]], and [[Jovem Guarda]], and its evolution has been marked by the assimilation of influences and resistance to the hegemonic standards of the recording industry.\n\nRegarding its etymology, the word ''brega'' has multiple interpretations. One hypothesis traces it back to terms like ''esbregue'', used in [[Rio de Janeiro]] to describe something poorly made, and ''xumbrega'', associated with drunkenness and later with brothels. This semantic load contributed to the term being used in a stigmatizing manner, especially to refer to cultural productions linked to working-class and peripheral regions. However, from the 1980s onward, the label gradually began to be reclaimed as a distinct musical category, particularly in the [[North Region, Brazil|North]] and [[Northeast Region, Brazil|Northeast]] regions of Brazil, where it consolidated as a relevant cultural expression.\n\nIn recent decades, brega has branched out into various subgenres, such as [[brega pop]], [[Tecno brega|tecnobrega]], and brega funk, demonstrating its ability to adapt to new contexts and influences. Recognized as intangible cultural heritage in [[Recife]] and [[Pará]], the genre maintains a strong presence in the regional and national music scene. Its trajectory reflects dynamics of aesthetic and cultural transformation, as well as tensions related to artistic valuation criteria and class-based prejudices, establishing itself as a significant manifestation of [[Música popular brasileira|Brazilian popular music]].",
  "last_revision_date": "2026-01-26T02:41:46Z",
  "top_artists": [
    "Tony Christie",
    "Banda Calypso",
    "Joelma (singer)",
    "Sidney Magal",
    "Reginaldo Rossi",
    "Waldick Soriano",
    "Manoel Gomes",
    "Wando (singer)",
    "Amado Batista",
    "MC Loma"
  ]
}