{
  "description": "'''Britpop''' was a [[United Kingdom|British]] music and cultural movement that emerged in the 1990s. Musically, it produced bright, catchy [[alternative rock]] that drew heavily on the traditions of 1960s guitar-based British [[pop music|pop]], with lyrics that emphasised [[British national identity|national identity]] and offered commentary on [[Culture of the United Kingdom|British culture]] and society. The movement was seen as a reaction against the darker lyrical themes and soundscapes of the American-led [[grunge]] and the more introspective [[shoegaze]] scene in Britain. It helped bring British alternative rock into the mainstream and became a key part of the broader [[Cool Britannia]] phenomenon, which echoed the spirit of the [[Swinging Sixties]].\n\nBritpop also marked the rise of bands emerging from the [[independent music]] scene of the early 1990s. Although often described as a cultural moment rather than a strictly defined musical genre, its leading bands shared influences from 1960s British pop, 1970s [[glam rock|glam]] and [[punk rock]], and 1980s [[indie pop]]. [[Manchester]]'s indie scene — including groups such as [[the Smiths]], [[the Stone Roses]], and [[Happy Mondays]] — is often cited as an important precursor to Britpop's musical development.\n\nThe acts most frequently labelled by the UK music press as Britpop's \"big four\" were {{ill|Oasis (band)|lt=Oasis}}, {{ill|Blur (band)|lt=Blur}}, {{ill|Suede (band)|lt=Suede}}, and {{ill|Pulp (band)|lt=Pulp}}. The period of Britpop's popularity is generally considered to have lasted from 1993 to 1997, with its peak years between 1995 and 1996. A chart rivalry between Blur and Oasis, dubbed \"The Battle of Britpop\", brought the movement to the forefront of the British press in 1995. Oasis's ''[[(What's the Story) Morning Glory?]]'' is among the UK's all-time best-selling albums, illustrating the movement’s mainstream reach. While primarily a music-based phenomenon, Britpop also influenced fashion, art, and politics, with Prime Minister [[Tony Blair]] and [[New Labour]] aligning themselves with the movement.\n\nDuring the late 1990s, many Britpop acts began to decline commercially, disband, or shift towards new musical styles. As a commercial force, Britpop was soon eclipsed by the rise of [[teen pop]], while artistically it evolved into the [[post-Britpop]] [[Indie rock|indie]] movement, associated with bands such as [[Travis (band)|Travis]] and [[Coldplay]].",
  "last_revision_date": "2026-01-12T20:56:24Z",
  "mixes": [
    {
      "playlist": "PL4BrNFx1j7E5DYo6tyYai3n7biYnc_-5t"
    }
  ],
  "top_artists": [
    "Blur (band)",
    "Oasis (band)",
    "Pulp (band)",
    "Liam Gallagher",
    "Stereophonics",
    "Noel Gallagher",
    "Suede (band)",
    "Supergrass",
    "Damon Albarn",
    "Feeder (band)"
  ]
}