{
  "description": "'''Bronx drill''' is a subgenre of Brooklyn drill music, which uses [[Sample clearance|uncleared samples]] of older records instead of [[synthesizer]]s like in Brooklyn drill.\n\nBronx drill originated during the early 2020s in New York (most prominently, in The Bronx), where producers such as [[Cash Cobain]], EPondabeat, WAR, Elvis Beatz, Yozora and others, started re-using older [[funk]] and [[soul music|soul]], and [[pop music]] songs to create a modern yet nostalgic sound. A number of rappers subsequently joined the scene, most prominently, [[Kay Flock]], [[B-Lovee]], [[Ron Suno]], DThang Gz, Jay5ive and others.\n\nThe easily recognizable samples in Bronx drill are also said to increase its viral potential. Songs, such as B-Lovee's \"My Everything\" (sampling \"Everything\" by [[Mary J. Blige]]) gained over 400,000 uses on [[TikTok]] and produced two remixes, featuring [[A Boogie wit da Hoodie]] and [[G Herbo]]. Another early [[TikTok]] viral Bronx drill hit was \"Deep End Freestyle\" (sampling Fousheé's \"Deep End\") by Brooklyn native [[Sleepy Hallow]]. Despite playing a huge role in genre's spread, Cash Cobain refused to acknowledge that Bronx drill musicians mostly do songs for TikTok. EPondabeat, another producer involved in the scene, claimed that sampling in used for marketing purpose to invoke listener's relatability.\n\nBronx drill rappers employ a variety of lyrical delivery styles, with those in the Bronx drill scene using a particularly aggressive style. \"These little kids from the Bronx are wild. They on demon time. They're angrier with their shit,\" one producer said.\n\nSamples for Bronx drill come from a variety of sources and these sources may differ depending on producer. Bronx-based Cash Cobain mainly uses round-the-century [[contemporary R&B]] and [[hip hop music]] sources; meanwhile, EPondabeat, EvilGiane prefer to use [[soul music]] and [[funk]] recordings for sampling; other producers, such as WAR, do not limit themselves among sampling sources.\n\nMost Bronx drill songs are not granted clearance to sample other works until they've already gained popularity, with some artists saying they don't care to clear their samples at all.\n\nBronx drill, since its inception around 2020, already had a mainstream crossover, when [[Cardi B]] performed on \"[[Shake It (Kay Flock song)|Shake It]]\" by [[Kay Flock]]. Bronx drill has also influenced [[Jersey club#Jersey club rap|Jersey drill]] sound and more commercial drill sound, most particularly the influence can be heard on ''[[B.I.B.L.E.]]'' by [[Fivio Foreign]], where he sampled \"[[Say My Name]]\" by [[Destiny's Child]].\n\nThe Bronx producer Cash Cobain has been described by [[Complex Networks|''Complex Music'']] as inventing sexy drill which tones down the violent nature of drill, while still drawing on the sampling techniques. Cobain said, \"I think everybody wants to feel good, party, and just feel sexy\". Complex wrote that Cobain is \"changing the sound of New York\".\n\n[[Ice Spice]] and [[Kenzo B]] emerged from the Bronx drill scene.",
  "last_revision_date": "2025-06-29T21:48:55Z",
  "top_artists": [
    "Ice Spice",
    "RiotUSA",
    "Sha EK",
    "Kenzo B"
  ]
}