{
  "description": "'''Brostep''' is a harder form of [[dubstep]] that emerged during the late 2000s and early 2010s and pioneered by artists like [[Skrillex]] and [[Rusko (musician)|Rusko]].\n\n\nIn 2011, dubstep gained significant traction in the US market, by way of a [[post-dubstep]] style known as Brostep, with the American producer Skrillex becoming something of a \"[[poster boy]]\" for the Dubstep scene. In September 2011, a ''[[Spin Magazine]]'' EDM special referred to brostep as a \"lurching and aggressive\" variant of dubstep that has proven commercially successful in the United States. Unlike traditional dubstep production styles, which emphasise sub-bass content, brostep accentuates the middle [[Register (music)|register]] and features \"robotic fluctuations and metal-esque aggression\". According to [[Simon Reynolds]], as dubstep gained larger audiences and moved from smaller club-based venues to larger outdoor events, sub-sonic content was gradually replaced by distorted bass [[Riff#Riff|riffs]] that function roughly in the same register as the electric guitar in [[Heavy metal music|heavy metal]].\n\nThe term ''brostep'', sarcastically coined in 2009, has been used by some as a pejorative descriptor for a style of popular [[Americanization|Americanised]] dubstep.\n\n\nThe producer known as Rusko himself claimed in an interview on [[BBC Radio 1Xtra]] that \"brostep is sort of my fault, but now I've started to hate it in a way&nbsp;... It's like someone screaming in your face&nbsp;... you don't want that.\" According to a BBC review of his 2012 album [[Songs (Rusko album)|''Songs'']], the record was a muddled attempt by Rusko to realign his music with a \"Jamaican inheritance\" and distance it from the \"belching, aggressive, resolutely macho\" dubstep produced by his contemporaries.\n\nCommenting on the success of American producers such as Skrillex, Skream stated: \"I think it hurts a lot of people over here because it's a UK sound, but it's been someone with influences outside the original sound that has made it a lot bigger. The bad side of that is that a lot of people will just say 'dubstep equals Skrillex'. But in all honesty it genuinely doesn't bother me. I like the music he makes.\" Other North American artists that were initially associated with the brostep sound were Canadian producers [[Datsik (musician)|Datsik]] and [[Excision (musician)|Excision]]. Their production style has been described by ''[[Mixmag]]'' as \"a viciously harsh, yet brilliantly produced sound that appealed more to [[Marilyn Manson]] and [[Nine Inch Nails]] fans than it did to lovers of UK garage\". The brostep sound also attracted the attention of metal bands. [[Nu metal]] band [[Korn]]'s 2011 album ''[[The Path of Totality]]'' features several collaborations with electronic music producers, including Skrillex and Excision. This style of dubstep is sometimes known as metalstep.\n{{clear}}"
}