{
  "description": "'''Slam death metal''' (also referred to simply as '''slam''') is a subgenre of brutal death metal which focuses on slam riffs. The genre originated from the 1990s [[New York City|New York]] death metal scene, incorporating elements of [[New York hardcore (genre)|New York hardcore]] and [[hip hop music]]. In contrast to other death metal styles, it is not generally focused on guitar solos and blast beats; instead, it employs mid-tempo rhythms, breakdowns and palm-muted riffing, as well as hip hop-inspired vocal and drum beat rhythms. When blast beats are used, it is often traditional blasts and gravity blasts used only as accents. [[Syncopation]] between guitar and drums is also a focal point.\n\nIn addition to slower riffing, slam death metal is also said to be characterized by guttural vocals and a \"high pitched, ringy\" [[snare drum]] sound. The subgenre \"shares some of the bounce and groove from [[nu metal]],\" and tends to avoid the experimental elements common in early death metal.\n\nThe [[Breakdown (music)#Heavy metal and punk rock|breakdown]] riff of Suffocation's \"Liege of Inveracity\" (1991) has been credited by ''[[Rolling Stone]]'' as the first slam riff in death metal.  The first wave of bands in the genre were New York bands like [[Internal Bleeding (band)|Internal Bleeding]], Pyrexia and Afterbirth, with notable groups from outside of this state from this time including [[Devourment]] and [[Cephalotripsy (band)|Cephalotripsy]].\n\nThe name \"slam\" in reference to death metal was coined by the members of Internal Bleeding. In a 2024 interview, Internal Bleeding guitarist Chris Pervelis explained that because the band's emphasis on groove was to encourage [[moshing]], they originally called their music \"mosh\" metal, \"barbaric mosh\" or \"death mosh\". However, drummer Bill Tolley associated the word \"mosh\" with the jovial tone of [[Anthrax (American band)|Anthrax]]. To avoid this association Tolley pushed for the word \"slam\" due to its early hardcore origins.\n\n\nThe popularity of [[deathcore]] and its shared interest in breakdowns led to a revived interest in slam beginning in the mid–2000s, seen through the popularity of groups including Infected Malignity and Abominable Putridity and the reformation of Devourment. This wave saw an increase in production quality in the genre, a contrast from the raw production of earlier bands. This wave was largely based online, particularly on social media sites, with the [[Facebook]] group Slam Worldwide playing a major role in promotion. This led to many groups forming outside of the genre's native United States, such as [[Extermination Dismemberment]] from Belarus, Coprocephalic from Taiwan, Acranius from Germany and a number of groups from the Philippines: Human Mastication, Nekroholocaust, Cranial Torture, Pus Vomit, Projectile Vomit and Impulsive Emesis. Furthermore, northern England, particularly [[Manchester]] and [[Liverpool]], developed a scene during this wave, with groups including [[Ingested (band)|Ingested]] and Exhumation, as well as UK Slam Festival. To the extent that ''Distorted Sound'' magazine called Manchester \"''Slam''chester\". In a 2009 article by ''[[MetalSucks]]'' stated \"slam is THE big thing in death metal right now, divisive as it is\".\n\nSlam was integral to the development of the genres [[beatdown hardcore]] and [[deathcore]]. Furthermore, elements of its sound, particular its distinctive riffing style, has been incorporated into merged with various genres including hardcore, black metal and general death metal.",
  "last_revision_date": "2025-08-05T22:32:02Z",
  "top_artists": [
    "Devourment",
    "Abated Mass of Flesh",
    "PeelingFlesh",
    "Internal Bleeding (band)",
    "Xavlegbmaofffassssitimiwoamndutroabcwapwaeiippohfffx",
    "Katalepsy",
    "Mental Cruelty",
    "Extermination Dismemberment"
  ]
}