{
  "description": "'''Cello rock''' is a subgenre of [[rock music]] characterized by the use of [[cello]]s (as well as other bowed string instruments such as the [[violin]] and [[viola]]) as primary instruments, alongside or in place of more traditional rock instruments such as [[electric guitar]]s, [[bass guitar|electric bass guitars]], and drum sets.\n\nCellos, often in groups of three or more, are used to create a sound, rhythm, and texture similar to that of familiar [[rock and roll|rock music]], but distinctly reshaped by the unique [[timbre]]s and more traditional genres of the cello (in particular) and other string instruments used. Cellos and other stringed instruments are often amplified and/or modified electronically, and they are often played in a manner imitative of the sound of electric guitars. They are often combined with other elements typical of rock music such as rock-style vocals and drumming.\n\nCello rock can trace its beginnings to the 1971 [[Electric Light Orchestra (album)|self-titled debut]], known in the US as ''No Answer'', by the [[Electric Light Orchestra]], which featured rock songs arranged for cellos, and the subsequent tour consisted of a standard rock band augmented by four cellos. [[Jeff Lynne]] made a return with this format using three cellos for their 2001 comeback album ''[[Zoom (Electric Light Orchestra album)|Zoom]]'' and its subsequent but cancelled [[Zoom Tour Live|tour]]. [[Apocalyptica]], which released their first album, ''[[Plays Metallica by Four Cellos]]'', in 1996, originally used only cellos but has since added drums and bass and sometimes vocals. Starting in 2011, the duo [[2Cellos]] began releasing covers of many rock standards, such as [[AC/DC]]'s \"[[Thunderstruck (song)|Thunderstruck]]\", and undertaking tours.",
  "last_revision_date": "2024-07-29T13:32:06Z",
  "mixes": [
    {
      "playlist": "PLY05tux1n8RkWoVf6mF2lxMddnxlCVQXI"
    }
  ],
  "top_artists": [
    "Rasputina (band)",
    "2Cellos",
    "Jorane",
    "Max Lilja",
    "Primitivity",
    "Break of Reality",
    "The 440 Alliance",
    "Rice (band)",
    "Coppelius",
    "Zoë Keating"
  ]
}