{
  "description": "'''Celtic metal''' is a subgenre of folk metal that emerged in [[Ireland]] during the early 1990s. It fuses the intensity of [[heavy metal music|heavy metal]] with traditional Celtic music, incorporating instruments such as the [[tin whistle]], [[bodhrán]], and [[uilleann pipes]]. The genre is characterised by its blending of metal's aggressive elements with the melodic and rhythmic structures of Celtic folk, often drawing on themes from Irish mythology and history.  \n\nThe genesis of Celtic metal is closely linked to the Irish band [[Cruachan (band)|Cruachan]], formed in 1992 by Keith Fay. Inspired by the English band [[Skyclad (band)|Skyclad]] and the Irish rock group [[Horslips]], Cruachan sought to merge black metal with Irish folk music. Their debut album, Tuatha na Gael (1995), is considered a seminal work in the genre. Around the same time, other Irish bands like [[Primordial (band)|Primordial]] and [[Waylander (band)|Waylander]] also began exploring similar musical territories, each bringing their unique interpretations to the fusion of metal and Celtic music. These bands laid the foundation for what would become a vibrant subgenre within the metal community.\n\nOver the years, Celtic metal has expanded beyond Ireland, with bands from various countries incorporating Celtic elements into their music. Swiss band [[Eluveitie]], for example, combines [[melodic death metal]] with Celtic melodies and instruments, even using lyrics in the ancient [[Gaulish]] language. Other notable bands include Spain's [[Mägo de Oz]], Germany's [[Suidakra]], and Canada's [[Leah (metal musician)|Leah]], each bringing their cultural perspectives to the genre.",
  "last_revision_date": "2025-09-27T02:08:03Z",
  "mixes": [
    {
      "playlist": "PLvanXFVt_IMhJEEChyhN41Yj8eqpJmppX"
    }
  ],
  "top_artists": [
    "Eluveitie",
    "Cruachan (band)",
    "Suidakra",
    "Skiltron",
    "Waylander (band)",
    "Anna Murphy (musician)",
    "Lyriel",
    "Leah (musician)",
    "Aes Dana (band)",
    "Pat O'May"
  ]
}