{
  "description": "'''Celtic fusion''' is an umbrella term for any modern music which incorporates influences considered \"[[Celts|Celtic]]\", or [[Celtic music]] which incorporates modern music. It is a syncretic musical tradition which borrows freely from the perceived \"Celtic\" musical traditions of all the [[Celtic nations]], as well as from all styles of popular music, it is thus sometimes associated with the [[Pan-Celticism|Pan-Celtic]] movement. Celtic fusion may or may not include authentic traditional music from any one tradition under the Celtic umbrella, but its common characteristic is the inspiration by Celtic identity.\n\nThe oldest musical tradition which fits under the label of Celtic fusion originated in the rural American south in the early colonial period and incorporated [[Scotland|Scottish]], [[Ulster Scots people|Scots-Irish]], [[Ireland|Irish]], and [[African American]] influences. Variously referred to as [[American folk music|roots music]], American folk music, or [[old-time music]], this tradition has exerted a strong influence on all forms of American music, including [[Country music|country]], [[blues]], and [[rock and roll]]. The connections between traditional Scottish and Irish music and Rock music are deep and go back to the origins of American music. As Elvis Costello put it:\n\n<blockquote>\"I started with rock n' roll and... then you start to take it apart like a child with a toy and you see there's blues and there's country... Then you go back from country into American music... and you end up in Scotland and Ireland eventually.\"</blockquote>\n\nAnother manifestation of this syncretic tendency emerged in [[New York City]] in the 1890s, as bands performing traditional Irish music for the large [[Ireland|Irish]] immigrant community there began incorporating [[big band]] influences, adding brass and reed instruments and performing [[quickstep]]s, [[Foxtrot (dance)|foxtrot]]s, and other popular contemporary dance tunes.\n\nMore recently, there has been a flowering of several distinct genres of Celtic fusion. These can be roughly broken down as follows.",
  "last_revision_date": "2025-08-26T02:45:32Z",
  "mixes": [
    {
      "playlist": "PLyA7gZlsboNNJcPBKj4CDRqiSXnKDli8W"
    }
  ],
  "top_artists": [
    "The Corrs",
    "Loreena McKennitt",
    "Ashley MacIsaac",
    "Ahez",
    "Martyn Bennett",
    "Peatbog Faeries",
    "Shooglenifty",
    "Paul Mounsey",
    "Four to the Bar",
    "Treacherous Orchestra"
  ]
}