{
  "description": "'''Algerian Chaabi''' ({{langx|ar|شعبي|lit=folk}}) is a [[traditional music]] of [[Algiers]] ([[Algeria]]), formalized by [[El Hadj M'Hamed El Anka]].\n\nOriginally from the [[Casbah of Algiers|Casbah]], the music known as chaabi belongs to a recent tradition. It emerged during the 1930s, and has remained popular to this day. Inspired by vocal traditions of [[Andalusi music]], such as [[muwashshah]], using its modes and rhythm. ''Chaabi'' means 'of the people', and it is very definitely the people's music, even in a country where [[raï]] rules.\n\nA typical song features mournful, Arabic/[[Berbers|Berber]] vocals, set against an orchestral backdrop of a dozen musicians, with violins and mandolins swelling and falling to a piano melody and the clap of percussion beats. Chaabi is part of a deeply conservative tradition and its lyrics often carrying a strong moral message.{{citation needed|date=October 2019}}\n\nAt first Chaabi remained a scandalous genre, thriving behind closed doors or in specific locations called \"Mahchachat\" (cannabis dens), where the admirer of this music would go to drink coffee, tea or smoke. By the late 1950s, however, it had become the people's music, played at weddings and religious festivals. Its main exponents included [[Oran]]-based singer {{ill|Lili Labassi|fr}}, [[El Hadj M'Hamed El Anka]], the father of Chaabi, and [[Dahmane El Harrachi]], composer of the classic tale of emigration \"[[Ya Rayah]]\".\n\nIn 2011, Safinez Bousbia directed a documentary on chaabi music. It took over seven years to make, facilitate and track the reunion of the Jewish and Muslim members of a chaabi group from colonial Algiers known as [[El Gusto]].",
  "last_revision_date": "2026-01-07T15:18:09Z",
  "mixes": [
    {
      "playlist": "PLH0SKYe9Mr3VFQ7fBKxz_rTnzFaKRBi28"
    }
  ],
  "top_artists": [
    "Rachid Taha",
    "El Hadj M'Hamed El Anka",
    "Dahmane El Harrachi",
    "Slimane Azem",
    "Hadj M'rizek",
    "Kamel Messaoudi",
    "Hsissen",
    "Hadj Bouchiba",
    "Mustapha Toumi",
    "Abdelkader Chaou"
  ]
}