{
  "description": "'''Chilean rock''' is rock music and its corresponding subgenres produced in [[Chile]] or by [[Chileans]]. Chilean rock lyrics are usually sung in Spanish so can be considered as part of [[rock en español]], although they are sometimes sung in English as well.\n\nRock music was first produced in Chile in the late 1950s by bands that imitated, and sometimes translated, international [[rock and roll]] hits from the U.S. This movement was known as the ''[[Nueva Ola]]'' (New Wave). Although original bands started to emerge as well in the early 1960s.\n\nDuring the second half of the 1960s, after the success of rock and roll music, the ''[[Nueva Canción Chilena]]'' (New Chilean Song) and  ''{{ill|Fusión latinoamericana|es|Fusión latinoamericana}}'' (Latin American fusion) genres were born in Chile, bringing to fame artists like [[Violeta Parra]] and [[Víctor Jara]] as extremely influential folk singers, or [[Los Jaivas]] and [[Congreso]] who were more instrumentally elaborated.\n\nIn the 1970s, however, there was a decline in the country's rock scene as a result of the military dictatorship imposed by the [[1973 Chilean coup d'état|1973 coup d'état]]. From 1973 to 1990, all forms of rock music were prohibited (along with an important part of the [[Military government of Chile (1973–1990)#Cultural life|cultural life]]), causing stagnation in the music industry. Nevertheless, an underground scene grew up with new genres such as [[heavy metal music|heavy metal]], [[punk rock|punk]] and [[new wave music]]. [[Los Prisioneros]] were the most outstanding band of this era.\n\nThe 1990s saw the beginning of a revival for Chilean rock music, with several Chilean bands finding international success along with the growth of many rock subgenres such as [[alternative rock]], [[pop rock]], [[funk rock]], [[reggae]], [[grunge]], [[britpop]] or [[latin rock]] becoming commercially successful. [[Los Tres]] became the most iconic rock band of this era, alongside [[La Ley (band)|La Ley]] in pop.\n\nIn the early 21st century, many more independent artists have become increasingly popular, while the previous ones have consolidated generating a cultural legacy of wide variety and trajectory. [[Synth pop]], neo-[[folk rock]], [[latin rock]], [[alternative rock]] and [[pop rock]] are among the most successful subgenres of our times, although increasingly harder to categorize due to his [[Independent music|indie]] and fusion nature.\n\nAlthough frequently omitted from mass media preferring commercial foreign music instead, Chile has an extensive and rich rock culture, a permanent underground scene with hundreds of recognized bands, many niches of varied alternative sub-genres, as well as powerful regional scenes in Concepción and Valparaíso.",
  "top_artists": [
    "Glup!"
  ]
}