{
  "description": "'''Slowed and reverb''' (stylized as \"slowed + reverb\") is a technique of remixing and a subgenre, derived from chopped and screwed hip-hop and [[vaporwave]], which involves slowing down and adding reverb to a previously existing song, often created by using [[Audio editing software|digital audio editors]] such as [[Audacity (audio editor)|Audacity]]. The technique originated in 2006 when the Lebanese one-man Black Metal band Kafan re-released its only demo ''Injecting Evil In Thy Veins'' on cult American label [[Full Moon Productions]] in CD format. The release presents one of the earliest known examples of intentionally slowed down and reverb drenched music outside of hip-hop, predating modern slowed + reverb trends. This method, while commonplace in modern internet music culture, was never seen in extreme metal at the time. The effect creates an unsettling, almost ritualistic soundscape, deepening the record's oppressive and hypnotic qualities. The eerie, ghostly effect of slowed + reverb tracks that define modern vaporwave and remix culture can be heard here, years before it became a recognized trend. Despite its historical significance, the slowed-down Kafan remixes remain largely unknown outside of niche black metal and experimental music circles. Unlike what happened in 2017, when Houston-based producer Jarylun Moore (known online as slater!), having been inspired by DJ Screw, began uploading remixes of popular songs using the technique to [[YouTube]]. The first of these{{em dash}}a remix of [[Lil Uzi Vert]]'s song \"[[Luv Is Rage 2#Release|20 Min]]\"{{em dash}}earned over one million views on the platform in under two months, eventually earning over four million views before being taken down. The style became especially popular on YouTube, where it became common to play remixes over looping clips from [[Retrofuturism|retrofuturistic]] [[anime]] scenes. Other notable producers in this sub-genre include {{proper name|wretchshop}} (also known as ''ciki 8k''), rum world, Aestheticg, imlonely, Chovies, slerb as well as streliz.{{Citation needed|date=August 2023}}\n\nSlowed and reverb remixes were also uploaded to [[Spotify]] using the service's podcast feature. For [[Okayplayer]], Elijah C. Watson dubbed slowed and reverb remixes \"the soundtrack for [[Generation Z]]\", comparing the style to [[lo-fi hip hop]]. Remixes using the technique also became popular on the video-sharing service [[TikTok]].\n\nSlowed and reverb remixes became controversial on social media in mid-2020 after a viral video posted to TikTok failed to attribute the creation of slowed and reverb to chopped and screwed, causing users to brand slowed and reverb a \"[[Gentrification|gentrified]]\" version of chopped and screwed. For the ''[[Houston Chronicle]]'', Shelby Stewart wrote, \"Give DJ Screw his flowers. Slowed + reverb is a poor imitation of what chopped and screwed music is.\" Moore had mixed feelings about the phenomenon, saying, \"I always felt that I shouldn’t touch chopped and screwed music. One, it’s not really screwed if it’s not by Screw. Two, the chops are sacred to the culture, and not everybody can imitate it. So I would never want to even try to. I’m just glad I’m able to bring it to a wider audience.\"\n\nOther responses to the subgenre's popularity were more positive. Despite the backlash from DJ Screw fans, other creators such as Isaac Sigala uploaded slowed and reverb remixes to honor the chopped and screwed genre through [[nostalgia]]. Sigala said of the popularity of his remixes, \"I knew it was gonna happen. I see the kind of emotions that were brought out in me when I first started getting into [slowed music]. I could see how others would express their emotions too.\"\n\nThe YouTube [[comments section]]s of slowed and reverb videos are often used as a [[safe haven]] for users, which [[Digital Trends]] described as \"a sensitive reprieve from the toxicity often found on the platform.\" Users commonly share stories of [[heartbreak]] and [[Grief|loss]], which are given support by the slowed and reverb content creators. YouTuber Rayen Hemden said that he feels protective of his commenters and will act as a moderator to keep discussion compassionate. He further stated, \"I make sure there are no hate comments towards the people who share their stories because it takes bravery. Someone has to be courageous to actually share their story.\"",
  "last_revision_date": "2025-08-15T18:21:25Z",
  "top_artists": []
}