{
  "description": "'''Christian death metal''' or '''life metal''' is a subgenre that blends [[death metal]] music with [[Christian metal]]. It is defined by death metal’s musical style combined with Christian-themed lyrics, performed by bands whose members identify as Christians. Musically, it remains indistinguishable from traditional death metal, characterized by heavy guitar riffs, blast beats, and guttural vocals. However, the lyrics set it apart, often focusing on Christian concepts such as demons, sin, [[self]] and [[self-denial]], [[Divine retribution|divine judgment]], and apocalypse. The imagery in Christian death metal frequently mirrors or contrasts with that found in secular death metal, which often deals with violent, gory, or anti-Christian themes. Because of this, some critics view Christian death metal as an oxymoron or a surprising juxtaposition, and it has faced resistance from both secular death metal fans and some within the Christian community.\n\nChristian death metal proper formed in the late-1980s to the mid-1990s through the outputs of [[Mortification (band)|Mortification]], [[Vomitorial Corpulence]], and [[Paramaecium]] in Australia, [[Opprobrium (band)|Opprobrium]], [[Living Sacrifice]], and [[Crimson Thorn]] in the United States, [[Sympathy (band)|Sympathy]] in Canada, and the early work of [[Antestor]] in Norway. In the same period, the Christian [[thrash metal]] bands [[Vengeance Rising]], [[Sacrament (band)|Sacrament]], and [[Believer (band)|Believer]], all from the United States, also included elements of death metal. In the late 1990s and early 2000s, Norway's [[Extol]], Finland's [[Immortal Souls]] and [[Deuteronomium (band)|Deuteronomium]], Sweden's [[Pantokrator (band)|Pantokrator]], Germany's [[Sacrificium]], Ukraine's [[Holy Blood (band)|Holy Blood]], the United States' [[Embodyment]], [[Feast Eternal]], Possession, [[Aletheian]], [[Becoming the Archetype]], and [[Tortured Conscience]], and Brazil's [[Antidemon]] emerged to further develop the genre. In the 2000s, the [[metalcore]] bands [[Underoath]], [[As I Lay Dying (band)|As I Lay Dying]], [[Norma Jean (band)|Norma Jean]], and [[Demon Hunter (band)|Demon Hunter]] all received labels of Christian death metal, and were some of the leading bands in the general hard rock market. In the latter half of the 2000s, [[Impending Doom]] (from the United States) and [[Blood Covenant (band)|Blood Covenant]] (from India) have joined the forefront of Christian death metal."
}