{
  "description": "'''Compas''' ({{IPA|fr|kɔ̃pa}}; {{langx|ht|konpa dirèk}}; {{langx|fr|compas direct}}), also known as '''konpa''' or '''kompa''', is a modern [[méringue]] [[dance music]] genre of [[Haiti]]. The genre was created by [[Nemours Jean-Baptiste]] following the creation of Ensemble Aux Callebasses in 1955, which became Ensemble Nemours Jean-Baptiste in 1957. The frequent tours of the many Haitian bands have cemented the style in all the Caribbean. Therefore, compas is the main music of several countries such as [[Dominica]] and the [[French Antilles]]. Whether it is called [[zouk]], where French Antilles artists of [[Martinique]] and [[Guadeloupe]] have taken it, or compas in places where Haitian artists have toured, this méringue style is influential in part of the [[Caribbean]], [[Portugal]], [[Cape Verde]], [[France]], part of [[Canada]], and [[South America|South]] and [[North America]].\n\nNemours Jean-Baptiste (1918–1985) was an important figure in the creation and popularization of ''konpa dirèk''. Born in Port-au-Prince, Jean-Baptiste grew up in a musically inclined family, and his early exposure to various forms of music shaped his later innovations. In the 1950s, Haiti's music scene was heavily influenced by traditional ''meringue'', but Jean-Baptiste wanted to modernize this sound by incorporating elements of Latin and jazz music, which were becoming popular across the Caribbean at the time. The Ensemble Aux Callebasses, later became the Ensemble Nemours Jean-Baptiste. His ensemble introduced a new style of ''meringue'' with more structured rhythms and harmonic arrangements, characterized by the inclusion of electric guitars, saxophones, and a strong brass section.\n\nCompas blends African, Latin and European influences, reflecting Haiti's cultural heritage resulting from their colonial past. The music's adaptable nature allowed it to break class barriers in Haiti, being embraced by both the elites and working-class communities. As ''konpa'' evolved in the 1960s and 1970s, it began to influence other Caribbean genres like Dominican merengue and zouk in the French Antilles, contributing to its international reach. Jean-Baptiste's contributions established ''konpa'' as a cornerstone of Haitian cultural identity.",
  "last_revision_date": "2025-08-12T12:44:53Z",
  "mixes": [
    {
      "video": "P8zAaZy_hmg"
    }
  ],
  "top_artists": [
    "Michel Martelly",
    "Kassav'",
    "Luck Mervil",
    "Tabou Combo",
    "Nemours Jean-Baptiste",
    "Gary Didier Perez",
    "Mikaben",
    "Francky Vincent",
    "JBeatz",
    "T-Vice"
  ]
}