{
  "description": "The term '''conga''' refers to the music groups within Cuban [[comparsa]]s and the music they play. Comparsas are large ensembles of musicians, singers and dancers with a specific costume and choreography which perform in the street carnivals of [[Santiago de Cuba]], Camaguey, and [[Havana]].\n\nThe instrumentation differs between '''''congas santiagueras''''' and '''''congas habaneras'''''. ''Congas santiagueras'' include the ''[[Trompeta china|corneta china]]'' (Chinese [[cornet]]), which is an adaptation of the Cantonese [[suona]] introduced in [[Oriente Province|Oriente]] in 1915, and its percussion section comprises bocúes (similar to African [[ashiko]] drums), the [[quinto (drum)|quinto]] (highest pitched conga drum), galletas and the pilón, as well as [[brake]]s which are struck with metal sticks. ''Congas habaneras'' lack the ''corneta china'' but include trumpets, trombones and saxophones, and they have a different set of percussion instruments: redoblantes ([[side drum]]s), [[bombo criollo|bombo]]s ([[bass drums]]), quinto, tumbadora (the lowest pitched conga drum), and metallic [[idiophone]]s such as [[cowbell (instrument)|cowbell]]s, [[Spoon (musical instrument)|spoon]]s, [[frying pan]]s and [[Rim (wheel)|rims]].\n\nCongas and comparsas have a long history which dates back to the 19th century, with musical traditions being passed down from one generation to the next. The older comparsas are derived from ''cabildos de nación'' or other social groups, whereas the later ones, called ''paseos'', are derived from ''barrios'' (neighbourhoods). The music of the congas has become a genre itself, being introduced into Cuban popular music in the early 20th century by artists such as [[Eliseo Grenet]] and [[Armando Oréfiche|Armando Oréfiche and his Havana Cuban Boys]]. They have been present for decades in the repertoire of many [[Conjunto#Cuban conjunto|conjunto]]s, Cuban [[big band]]s and [[descarga]] ensembles, also having an influence on modern genres such as [[Salsa music|salsa]] and [[songo music|songo]]. The [[conga drum]], also known in Cuba as tumbadora, took its name from the ''congas de comparsa''."
}