{
  "description": "'''Country folk''' as a genre label is a rather nebulous one, but one that has been employed often at least since the mid-1970s. For dedicated enthusiasts, the category largely includes the works of contemplative post-[[Bob Dylan|Dylan]] singer-songwriters, who were influenced by his and other late 1960s' and 1970s' artists' country rock sounds, but who, recording slightly later, preferred a gentler, more acoustic-dominant sound that allowed focus on the lyrics. The significant element that distinguishes \"country folk\" from the \"folk\" music on Dylan's contemporaries' recordings in the 1960s was the re-admission of country and bluegrass music instrumentation—mandolin, banjo, fiddle, and resophonic and electric steel guitars—into the mix; country rock's success with urban audiences had paved the way for this hybrid. For aficionados, viewing country folk as a subgenre of country is inaccurate, as it is not aimed at a country music audience, in the main.\n\nSome of the definitive country folk artists from the early years include [[Harry McClintock]], [[John Prine]], [[Kate Wolf]], and [[Nanci Griffith]]—all singer-songwriters with thoughtful lyrics whose arrangements are backed by the aforementioned instruments. By the 1980s, record labels such as Rounder and Sugar Hill specialized in recording country folk artists\n\nThe category does overlap with the post-country rock trajectories of other artists who moved away from the mainstream market as country rock's own fortunes waned at the close of the 1970s. [[Emmylou Harris]] moved into neo-traditionalist country, [[Chris Hillman]] into progressive bluegrass, brother harmony duo (with [[Herb Pedersen]]), and Bakersfield revival. By the start of the 1990s, these sounds, as well as others, would inspire musical amalgams categorized as [[alternative country]] music and [[Americana (music)|americana]], yet \"country folk\" continues to be used for the gentler sounds of singers such as [[Iris DeMent]], [[Kate & Anna McGarrigle]], and [[Gillian Welch]].\n\nEven during the 1970s, as the acoustic, early country music-inflected sounds of country folk were making it distinct from other styles of post-1960s singer-songwriter music, it had varying degrees of overlaps with the sounds of progressive country music (such as [[Kris Kristofferson]], [[Townes Van Zandt]], [[Guy Clark]]), outlaw country ([[Billy Joe Shaver]], [[Waylon Jennings]], [[Willie Nelson]], [[Johnny Cash]]), progressive bluegrass ([[Tony Rice]] albums Cold on the Shoulder and Native American), and other country rock inflected recordings ([[Tom Rush]]'s ''Tom Rush'' and ''Merrimack County'' and [[Gordon Lightfoot]] and [[Jimmy Buffett]]'s 1970s catalog). None of these were specifically marketed or received as \"country folk\", however. Still, later low-key, acoustic-dominant country-inflected recordings by these and many other earlier artists have at times loosely, but not inaccurately, been defined as country folk by some sources.\n\nMore recently, the majority of artists whose music could be classified as country folk find their home in the americana genre, including [[Brandi Carlile]], [[Jason Isbell]], [[Parker Millsap]], [[Patty Griffin]] and [[Amanda Shires]], with several artists being interchangeably described as both folk and americana artists, such as [[Sarah Jarosz]] who has received [[Grammy Awards]] in both genre categories.",
  "last_revision_date": "2025-05-05T18:56:40Z",
  "top_artists": [
    "Joan Baez",
    "John Prine",
    "Trixie Mattel",
    "Buffy Sainte-Marie",
    "June Carter Cash",
    "Billy Bragg",
    "Rosanne Cash",
    "Maybelle Carter",
    "Shawn Colvin",
    "The Proclaimers"
  ]
}