{
  "description": "'''Coupé-décalé''' ({{IPA|fr|kupe dekale}}) is a type of popular dance music originating in [[Côte d'Ivoire]]. Drawing heavily from [[zouglou]] and [[ndombolo]] with African influences, coupé-décalé is a very percussive style, featuring African samples, deep bass, and repetitive minimalist arrangements.\n\nThe genre was developed around 2001 by a group of young Ivorian [[Promoter (entertainment)|club promoters]] and performers known as the Jet Set, led by [[Douk Saga]]. These performers, referred to as [[Atalaku|atalakus]] (hype men), gained recognition for their flamboyant performances, ostentatious fashion, and theatrical displays of wealth. The movement popularized [[Nouchi]] slang terms such as ''farot farot'' (to flaunt wealth) and ''travaillement'' (lavish distribution of cash), drawing inspiration from [[La Sape|Congolese ''sapeur'']] subculture. The terms \"''coupé''\" (\"to cheat\") and \"''décalé''\" (\"to run away\") were introduced by DJ Jacob in reference to the music and the accompanying dance styles, although Douk Saga is credited with creating and globalizing the concept, particularly with the 2003 hit \"Sagacité\".\n\nCoupé-décalé emerged as a dominant cultural force during the political and social unrest that followed the 2002 outbreak of the [[First Ivorian Civil War]]. Amid [[Curfew|curfews]] and national division, the genre provided a form of [[escapism]] and expression for Ivorian youth, who gathered in ''maquis'' (local bars) and nightclubs to dance and celebrate resilience. The [[Yopougon]] district, particularly Princess Street, became a hub for the movement, where DJs evolved from background figures into leading artists. Each song often introduced a new dance move or gesture, fueling the genre's popularity. The genre's second wave was led by artists such as [[DJ Arafat]], who helped modernize and internationalize the genre with a more aggressive [[atalaku]] style and a digitally driven sound, ultimately becoming one of the genre's most influential figures. Other prominent artists include [[Serge Beynaud]], Debordo Leekunfa, Mix Premier (DJ Mix), DJ Lewis, and others.",
  "last_revision_date": "2025-08-03T00:58:00Z",
  "mixes": [
    {
      "video": "q8Ihg9hqhjQ"
    }
  ],
  "top_artists": [
    "Jessy Matador",
    "DJ Arafat",
    "Magic System",
    "Les Jumo",
    "Floby (musician)",
    "Dicko Fils",
    "Anges d'Afrik",
    "Dez Altino",
    "Agozo",
    "Hawa Boussim"
  ]
}