{
  "description": "'''[[Cumbia]]''' ({{IPA|es|ˈkumbja}}) is a [[Folklore|folkloric]] genre and dance from [[Colombia]].\n\nThe cumbia is the most representative dance of the coastal region in Colombia, and is danced in pairs with the couple not touching one another as they display the amorous conquest of a woman by a man. The couple performing cumbia dances in a circle around a group of musicians, and it involves the woman holding lit candle(s) in her right hand that she uses to push the man away while she holds her skirt in her left. During the dance, the partners do not touch each other, and the man dances while holding a ''[[sombrero vueltiao]]'' that he tries to put on the woman's head as a representation of amorous conquest. This dance is originally\nmade to depict the battle that the “black man had to fight to conquer an indigenous woman”. The story continues and the dance shows that this leads to a new generation and is depicting the history of the coast of Colombia.\n\nHowever Cumbia is much more than just a dance; it is “practica cultural” (cultural practice). Cumbia is an umbrella term, and much like vallenato there are many subcategories. The subcategories are many like music, dance, rhythm, and genre. The genre aspect can be split into two things; Cumbia is a “ complex mix of genres with a caribbean-colombian air in binaria subdivision” and “a category of music for Colombian music with a Caribbean flavor”.\n\nSince the 1940s, commercial or modern Colombian cumbia had expanded to the rest of [[Latin America]], and many countries have had their own variants of cumbia after which it became popular throughout the Latin American regions, including in [[Argentina]], [[Bolivia]], [[Chile]], [[Costa Rica]], [[Ecuador]], [[El Salvador]], [[Guatemala]], [[Honduras]], [[Mexico]], [[Nicaragua]], [[Panama]], [[Paraguay]], [[Peru]], the [[United States]], [[Uruguay]], and [[Venezuela]].\n\nMost Hispanic American countries have made their own regional version of Cumbia, some of them with their own particularity.",
  "last_revision_date": "2026-01-22T10:37:49Z",
  "mixes": [
    {
      "video": "x9uaEDIgxCc"
    }
  ],
  "top_artists": [
    "Los Bitchos",
    "Aniceto Molina",
    "Adriana Lucía",
    "Lucho Bermúdez"
  ]
}