{
  "description": "'''Glitchcore''' is a microgenre that originally developed alongside hyperpop and digicore. Although ''glitchcore'' first appeared as a term in the [[breakcore]] scene, it later came to describe a style of music associated with the digicore scene. This style was pioneered in the late 2010s by artists such as Yungster Jack and David Shawty, and is characterized by [[Plugg music|plugg]]-based instrumentation, heavy use of audio effects such as [[Auto-Tune|autotune]] and [[Pitch-shifted|pitch shifters]], as well as rapidly [[Chopping (sampling technique)|chopped vocals]] designed to resemble [[Glitch (music)|audio glitches]].\n\nAs Kyann-Sian Williams of ''[[NME]]'' stated, \"glitchcore is hyperpop on steroids\", referring to the exaggerated vocals, distortions, glitch noises, and other pop elements present within glitchcore. Artists such as 100 gecs and the collective Drain Gang played a key role in the development of the genre.\n\nGlitchcore is sometimes referred to as a subgenre of hyperpop and digicore, with writer Sheldon Pearce of ''[[NPR Music|NPR]]'' stating \"glitchcore and digicore — terms often used interchangeably, only furthering confusion about what any of these words actually mean — and split into factions that in turn have bucked media narratives about what belongs where.\"\n\nStef, a producer of the popular digicore and glitchcore collective Helix Tears stated that there certainly is a difference between hyperpop and glitchcore, saying, \"Hyperpop is more melodic and poppy whereas glitchcore is indescribable\".\n\nAdditionally, glitchcore also developed a distinct [[Internet aesthetics|internet visual aesthetic]], that drew primary influence from [[glitch art]], with videos featuring fast-paced, and cluttered edits, often colorful and occasionally marked with [[Epilepsy|flash warnings]]. This visual style frequently made use of an [[Video editing|editing technique]] known as \"[[datamoshing]].\"  Digicore artists like d0llywood1 even refer to glitchcore as \"an aesthetic, like the [[Fan edit|edits]]\", rather than an actual music genre. Alt TikTok, played a key role in popularising glitchcore, through video edits to two viral glitchcore/digicore songs \"NEVER MET!\" by CMTEN and Glitch Gum and \"Pressure\" by David Shawty and Yungster Jack.",
  "last_revision_date": "2025-11-18T01:06:46Z",
  "mixes": [
    {
      "playlist": "PLx2mlAPxrcc9zEy4GbdXhlBG_I6Jj6E4P"
    }
  ],
  "top_artists": []
}