{
  "description": "'''Glitchcore''' is a microgenre that originally developed alongside hyperpop and digicore. Although ''glitchcore'' first appeared as a term in the [[breakcore]] scene, it later came to describe a style of music associated with the digicore scene. This style was pioneered in the late 2010s by artists such as Yungster Jack and David Shawty, and is characterized by [[Plugg music|plugg]]-based instrumentation, heavy use of audio effects such as [[Auto-Tune|autotune]] and [[Pitch-shifted|pitch shifters]], as well as rapidly [[Chopping (sampling technique)|chopped vocals]] designed to resemble [[Glitch (music)|audio glitches]].\n\nIn 2022, 100 gecs would be labeled by ''The Face'' as inspiring \"a new generation of American producers to experiment with an intense genre – called either hyperpop or digicore – from their bedrooms.\" As Kyann-Sian Williams of ''[[NME]]'' stated, \"Now hyperpop has morphed into glitchcore, the latter defined by high-pitched vocals layered atop impaling 808s and wailing hi-hats that stop and start all over the place. Basically, glitchcore is hyperpop on steroids\". \n\nGlitchcore is sometimes conflated with hyperpop due to their similarities. In 2025, Sheldon Pearce of ''[[NPR Music|NPR]]'' stated, \"glitchcore and digicore — terms often used interchangeably, only furthering confusion about what any of these words actually mean — and split into factions that in turn have bucked media narratives about what belongs where.\" Stef, a producer of the popular digicore and glitchcore collective Helix Tears stated that there certainly is a difference between hyperpop and glitchcore, saying, \"Hyperpop is more melodic and poppy whereas glitchcore is indescribable\". \n\nAccording to [[Alternative Press (magazine)|''Alternative Press'']] magazine, American musician [[Glaive (musician)|glaive]] is \"Sometimes mislabeled as a glitchcore or hyperpop artist,\" further adding, \"glaive doesn’t glitch out his beats all that much or rely on PC-processing of his vocals\".",
  "last_revision_date": "2026-01-28T20:56:41Z",
  "mixes": [
    {
      "playlist": "PLx2mlAPxrcc9zEy4GbdXhlBG_I6Jj6E4P"
    }
  ],
  "top_artists": []
}