{
  "description": "'''Dominican dembow''' ({{langx|es|link=no|dembow dominicano}}), also known as simply '''dembow''',{{efn|\"Dembow\" as the short name of the Dominican dembow subgenre should not be confused with [[dembow|the percussion rhythm of the same name]].}} is a style of music originating from the [[Dominican Republic]] which has been mostly described as a subgenre or derivative form of [[reggaeton]] which evolved from [[dancehall]]. Dominican dembow is characterized by its use of a sped-up [[Dembow|dembow rhythm]] as its core percussion element (while standard reggaeton employs the same rhythm at a slower [[tempo]]). The name dembow is credited to the  [[Shabba Ranks]] song \"[[Dem Bow]]\" which was remixed by [[Wisin & Yandel]] and many others and the [[Dembow beat]] became a staple in the reggaeton community.  \n\nThe subgenre diverged from early reggaeton during the 2000s. During this time, Puerto Rican reggaeton was evolving to become more melodic, polished, and lyrically romantic, and would eventually become the basis for most reggaeton music today. However, the \"softening process\" marginalized the scene in the Dominican Republic, which retained a rawer, unembellished, and more aggressive sound. A simultaneous shift towards faster tempos may have also been influenced by the country's \"historical preference\" for the fast-paced [[Merengue music|merengue]] genre.\n\nDominican dembow ultimately spread its influence beyond the Dominican Republic to countries like [[Spain]], the [[United States]], [[Chile]], and [[Italy]]. It came to be known globally as a result of the general growing popularity of [[Hispanic|Spanish-language music]] in the 2010s. During this same decade [[trap music]] began to influence the production style of Dominican dembow.\n\nDominican dembow artists are known as ''dembowseros.'' Notable ''dembowseros'' include [[Tokischa]], [[Chimbala]], [[El Alfa]], and Rochy RD. Non-Dominican artists have also occasionally produced songs in this style, such as [[Bad Bunny]] with his hit song \"[[Tití Me Preguntó]]\".",
  "last_revision_date": "2025-12-02T19:37:49Z",
  "mixes": [
    {
      "video": "ew3Drktx8ok"
    }
  ],
  "top_artists": [
    "El Alfa",
    "Tokischa",
    "Kid Buu (rapper)",
    "RaiNao",
    "BB Trickz",
    "Yailin La Más Viral",
    "Ángel Dior"
  ]
}