{
  "description": "'''Drill music''', also known as '''drill rap''' or simply '''drill''', is a subgenre of [[trap music]] that originated in [[Chicago]] in the early 2010s. Carrying similarities to [[gangsta rap]] and [[hip-hop]] music, drill [[lyricism]] is noted for its ominous, [[confrontation]]al nature, often including references to [[Gang#Violence|gang rivalries]] and various incidents, sometimes [[murder]], although the subgenre is thematically broader. Drill artists often address authentic, real-life conflicts, at times incorporating artistic expressions such as bravado, taunting, or mockery.\n\nEarly drill artists are typically noted for their associations with [[crime in Chicago]], especially with the [[Black Disciples]] and [[Gangster Disciples]]. The genre garnered  mainstream attention in 2012 following the success of pioneering [[Chicago hip-hop|Chicago rappers]] like [[Chief Keef]], [[Lil Durk]], [[Lil Reese]], [[Fredo Santana]], [[G Herbo]], [[Lil Bibby]], [[King Louie (rapper)|King Louie]], [[FBG Duck]], and producer [[Young Chop]]. Other rappers, such as [[Murder of Joseph J. Coleman|Lil JoJo]], S. Dot, Edai, L'A Capone, RondoNumbaNine, Lil Mister, SD and producers Smylez and Leek-E-Leek also contributed to the early drill scene. Additionally, [[DJ]]'s including DJ Kenn Aon and DJ Hustlenomics were conducive to the subgenre's early growth. Female rappers such as [[Sasha Go Hard]], [[Katie Got Bandz]], and the group Pretty N Pink developed the distinctive feminine style of drill music.\n\nDrill music saw a resurgence in the mainstream during the late 2010s and early 2020s with artists such as [[King Von]], [[Polo G]], [[Calboy]] and a revamped [[Lil Durk]]. By the 2020s, drill's popularity spread globally, with the [[BBC]] in 2021 describing drill as \"the sound of the global youth\". The [[UK drill]] scene emerged in the mid-2010s, leading to the prominence of artists such as [[67 (rap group)|67]], [[Harlem Spartans]], [[CGM (rap group)|CGM]], and [[Skengdo x AM]]. UK drill subsequently influenced regional scenes in Europe and America, including [[Brooklyn drill]], which gained mainstream popularity in the early 2020s with artists like [[Pop Smoke]] and [[Fivio Foreign]]. Drill scenes have been noted in such locales as [[Irish rap#Grime/drill|Ireland]], [[Australian hip-hop#Drill music|Australia]], [[Dutch hip-hop|the Netherlands]], [[Gh hip-hop|Ghana]], [[African hip-hop#Uganda|Uganda]], [[European hip-hop#Northern Europe|Denmark]] and [[French hip-hop|France]].\n\nThe subgenre's controversial nature has stimulated discussion. Public debate about the implications drill rap has raged, while some authorities, elected officials, and commentators in the UK and America castigate the genre and its artists, claiming that drill rap catalyzes real world violence. On the other hand, it has been counterargued that drill illuminates harsh societal realities, resonating closely with the disenfranchised youth audience, and that artists are within their [[Freedom of speech|right to self-expression]]. Attempts at curtailing the subgenre, including deleting posted music videos, blockading performances, and legalizing song lyrics as criminal evidence, have been put in practice in the UK and America, generating further controversy.",
  "last_revision_date": "2025-11-25T20:20:04Z",
  "mixes": [
    {
      "playlist": "PL-LmfcLe2pkVixfUJ0yAQwuyth6Ur53Dq"
    }
  ],
  "top_artists": [
    "Lil Durk",
    "Chief Keef",
    "Polo G",
    "King Von",
    "NLE Choppa",
    "Lil Tjay",
    "6ix9ine",
    "G Herbo",
    "Lil Bibby",
    "Pooh Shiesty"
  ]
}