{
  "description": "[[Punk rock]] has been mixed with electronic music as well, creating subgenres like '''synth-punk''' (also known as '''electropunk''') and [[dance-punk]].\n\n[[Suicide (band)|Suicide]], formed in 1970, is known as one of the most influential artists in the genre. Their sound over their five studio albums mixed punk rock with various electronic-based genres such as electronic rock, [[synth-pop]], and [[disco]]. Their [[Suicide (1977 album)|first album]] is widely regarded for setting the stage for subsequent [[post-punk]], synth-pop and industrial rock acts.\n\n[[The Screamers]] were labeled \"techno-punk\" by the ''[[Los Angeles Times]]'' in 1978. Rather than the usual electric guitars, the band's instrumentation included a heavily distorted [[Fender Rhodes]] [[electric piano]] and an [[ARP Odyssey]] [[synthesizer]].\n\n[[Devo]], whilst better known for their 1980 synth-pop song \"[[Whip It (Devo song)|Whip It]]\", also had an electronic sound rooted in punk rock.\n\nThe term synth-punk (or electropunk) was coined in 1999 by Damien Ramsey.\n\nIn the early 1980s, synth-punk fused with various electronic genres to create [[electronic body music]], which would influence a number of subsequent [[industrial dance]], industrial rock and industrial metal acts. It also influenced the [[hardcore punk]] inspired [[digital hardcore]], which combines hardcore punk with electronic music, [[Noise music|noise]] and [[Heavy metal music|heavy metal]]. It typically features fast tempos and aggressive [[Sampling (music)|sound samples]].\n\nIn addition, [[pop punk]] fused itself with synth-punk to create a genre known as [[neon pop]].\n\nLater revival instances include electronic body music, dance punk, and electroclash. Other artists, like [[Chicago]]'s [[Big Black]], put guitars back in, and helped to spawn a new wave of [[math rock]], [[industrial rock]], and [[noise rock]]. In the 2010s, synth-punk influenced the development of an internet microgenre known as [[egg punk]] which drew influence from Devo.",
  "last_revision_date": "2025-10-23T20:20:16Z",
  "top_artists": [
    "The Prodigy",
    "Peaches (musician)",
    "Mindless Self Indulgence",
    "Mark Mothersbaugh",
    "Suicide (band)",
    "Death Grips",
    "Crystal Castles",
    "Gerald Casale",
    "Alan Vega",
    "Sleaford Mods"
  ]
}