{
  "description": "'''Hyper-rock''' is a [[fusion genre]] that fuses rock music and hyperpop. It is characterized by a guitar-centric foundation combined with processed vocals, glitchy textures, and [[Experimental music|experimental]] sound design, resulting in a sound that differs from [[folktronica]], [[indietronica]], or [[digital hardcore]]. The term ''hyper-rock'' was coined by ''[[Stereogum]]'' journalist James Rettig. He introduced the term in a \"tongue-in-cheek parenthetical\" while reviewing [[Feeble Little Horse]]'s album, ''[[Girl with Fish]]''.\n\nHyper-rock, as a distinct musical style, is considered to have emerged in the late 2010s and early 2020s, although its foundational elements and experimental precursors date back further. Early sonic experiments in the 2000s laid the groundwork for the genre. Known forerunners include [[Sweet Trip]]'s ''[[Velocity : Design : Comfort]]'' (2003) is considered a significant record for the genre, blending [[Intelligent dance music|IDM]], [[Glitch (music)|glitch]], and shoegaze. Tracks such as \"Fruitcake and Cookies\" and \"To All the Dancers of the World, a Round Form of Fantasy\" illustrate the progression from fragmented electronic textures to euphoric, guitar-driven soundscapes, elements later associated with hyper-rock.\n\nHyper-rock is primarily built around rock guitars, which may range from dense, [[Reverberation|reverb]]-soaked layers reminiscent of [[shoegaze]] to harsher, evolving riffs influenced by [[black metal]]. Vocals are often heavily processed, employing techniques such as [[pitch shifting]] and the use of [[Auto-Tune]]. The style also incorporates glitched-out production and electronic elements, including programmed drums, synth textures, and fragmented soundscapes. The genre reflects a fusion of influences from a wide array of musical styles. Shoegaze contributes atmospheric textures and layered guitar sounds, while hyperpop informs its high-energy, glitch-oriented approach and vocal processing. IDM, glitch, and [[digicore]] provide jittery electronic elements and fragmented sound design. Some artists integrate aspects of [[Heavy metal music|heavy metal]], [[Trance music|trance]], [[Electronic dance music|EDM]], [[vaporwave]], and [[Pop music|pop]].",
  "last_revision_date": "2025-12-05T09:34:45Z",
  "mixes": {
    "help_reason": null
  },
  "top_artists": []
}