{
  "description": "'''Experimental rock''', also called '''avant-rock''', is a subgenre of [[rock music]]{{sfn|Rosenberg|2009|p=179}} that pushes the boundaries of common composition and performance technique{{sfn|Bogdanov|2001|p=10}} or which experiments with the basic elements of the genre.{{sfn|Martin|1998|p=93}} Artists aim to liberate and innovate, with some of the genre's distinguishing characteristics being [[improvisation (music)|improvisational performances]], [[avant-garde]] influences, odd instrumentation, opaque lyrics (or instrumentals), unorthodox structures and rhythms, and an underlying rejection of commercial aspirations.\n\nFrom its inception, rock music was experimental, but it was not until the late 1960s that rock artists began creating extended and complex compositions through advancements in [[multitrack recording]]. In 1967, the genre was as commercially viable as [[Popular music|pop music]], but by 1970, most of its leading players had incapacitated themselves in some form.{{Clarify|date=December 2020}} In Germany, the [[krautrock]] subgenre merged elements of improvisation and [[psychedelic rock]] with [[electronic music]], avant-garde and [[Contemporary classical music|contemporary classical]] pieces. Later in the 1970s, significant musical crossbreeding took place in tandem with the developments of [[punk rock|punk]] and [[New wave music|new wave]], [[DIY]] experimentation, and [[electronic music]]. [[Funk]], [[jazz-rock]], and [[jazz fusion|fusion]] rhythms also became integrated into experimental rock music.\n\nEarly 1980s experimental rock groups had few direct precedents for their sound. Later in the decade, avant-rock pursued a [[psychedelic music|psychedelic]] aesthetic that differed from the self-consciousness and vigilance of earlier [[post-punk]]. During the 1990s, a loose movement known as [[post-rock]] became the dominant form of experimental rock. As of the 2010s, the term \"experimental rock\" has fallen to indiscriminate use, with many modern rock bands being categorized under prefixes such as \"post-\", \"kraut-\", \"psych-\", \"art-\", \"prog-\", \"avant-\" and \"noise-\".",
  "last_revision_date": "2025-05-26T22:14:56Z",
  "mixes": [
    {
      "playlist": "PLzfDQ2YHzbqbqpfjLVUhacuqQwdlzuv7c",
      "note": "Similarly to [[avant-garde music]], this defies categorisation to some extent, but I've picked a playlist that captures the experimental rock of the 1970s, which also overlaps with other genres like [[psychedelic rock]]."
    }
  ],
  "top_artists": [
    "Pink Floyd",
    "Radiohead",
    "Sonic Youth",
    "The Clash",
    "King Crimson",
    "John Zorn",
    "The Velvet Underground",
    "The Flaming Lips",
    "Phish",
    "Nick Cave"
  ]
}