{
  "description": "The terms ''folk music'', ''folk song'', and ''[[folk dance]]'' are comparatively recent expressions. They are extensions of the term ''[[folklore]]'', which was coined in 1846 by the English [[antiquarian]] [[William Thoms]] to describe \"the traditions, customs, and [[superstition]]s of the uncultured classes\". The term further derives from the German expression ''[[Volk]]'', in the sense of \"the people as a whole\" as applied to popular and national music by [[Johann Gottfried Herder]] and the [[German Romanticism|German Romantics]] over half a century earlier. Though it is understood that folk music is the music of the people, observers find a more precise definition to be elusive. Some do not even agree that the term folk music should be used. Folk music may tend to have certain characteristics but it cannot clearly be differentiated in purely musical terms. One meaning often given is that of \"old songs, with no known composers,\" another is that of music that has been submitted to an evolutionary \"process of [[Oral tradition|oral transmission]]... the fashioning and re-fashioning of the music by the community that give it its folk character.\"\n\nSuch definitions depend upon \"(cultural) processes rather than abstract musical types...\", upon \"''continuity'' and ''oral transmission''...seen as characterizing one side of a cultural [[dichotomy]], the other side of which is found not only in the lower layers of [[Feudalism|feudal]], [[Capitalism|capitalist]] and some oriental societies but also in 'primitive' societies and in parts of 'popular cultures'\". One widely used definition is simply \"Folk music is what the people sing.\"\n\nFor Scholes, as well as for [[Cecil Sharp]] and [[Béla Bartók]], there was a sense of the music of the country as distinct from that of the town. Folk music was already, \"...seen as the authentic expression of a way of life now past or about to disappear (or in some cases, to be preserved or somehow revived),\" particularly in \"a community uninfluenced by art music\" and by commercial and printed song. Lloyd rejected this in favor of a simple distinction of economic class yet for him, true folk music was, in [[Charles Seeger]]'s words, \"associated with a lower class\" in culturally and socially stratified societies. In these terms, folk music may be seen as part of a \"schema comprising four musical types: 'primitive' or 'tribal'; 'elite' or 'art'; 'folk'; and 'popular'.\"\n\nMusic in this genre is also often called ''traditional music.'' Although the term is usually only descriptive, in some cases people use it as the name of a genre. For example, the [[Grammy Award]] previously used the terms \"traditional music\" and \"traditional folk\" for folk music that is not contemporary folk music. Folk music may include most [[indigenous music]].",
  "last_revision_date": "2025-11-03T02:46:59Z",
  "top_artists": [
    "George Dalaras",
    "Dervish (band)",
    "Aly Bain",
    "Show of Hands",
    "Troy Donockley",
    "Battlefield Band",
    "Lost Dogs",
    "Damien Dempsey",
    "Jolie Holland",
    "The Beautiful Girls"
  ]
}