{
  "description": "'''Folkhop''', also called '''bhangra-beat''', '''urban-desi''', or '''post-bhangra''' is a genre of music that came about after the decline of [[Bhangra (music)|bhangra]] in the mid-1990s. It is diametrically opposed to bhangra music in that it is not live music but instead relies on pre-recorded musical parts with only the vocals being sung live along to a live repetitive dhol drum.  The pre-recorded music consists of primarily looped rhythm parts from both eastern and western percussion instruments and little to no melody on instruments.  It borrows heavily from hip hop, however it is more traditional than its predecessor, [[Bhangra (music)|bhangra]] which rebelled against tradition and authenticity.  Traditional folk instruments like [[dhol]] and [[tumbi]] are central to folkhop productions. Folkhop songs tend to be heavily produced by DJs on computer software.  In the beginning, all songs start out as vocal only recordings that the folk singer records in India.  This 'vocal only' recording is then sold on websites involved in the buying and selling of folkhop music.  The DJs then pay a small sum for the rights to these vocals, and then set the music using looped samples of both hip hop and traditional folk instruments.  The quintessential folkhop artist is the bedroom DJ. \nFolkhop albums typically feature no credits on musicians, instead liner notes simply feature 'big ups' to online friends of the folkhop DJ.\n\nWhereas bhangra music was centered on bands delivering live performances with focus on instrumentation (as evidenced by bhangra videos), folkhop shares with rap and hip hop \"common textual aspects, as well as similarities in their onstage and video performance practices: an obsession with materialism, or an expressed desire or boasting of \"bling\", in the form of jewelry, wealth or clothing\"\n\nIt also features an obsession with farming and rural lifestyle such as livestock, tractors traditional clothes etc.  Many folkhop videos\nshowcase rappers and folk singers in the midst of farms or riding on tractors.",
  "last_revision_date": "2026-01-12T20:58:21Z",
  "mixes": {
    "help_reason": null
  },
  "top_artists": [
    "Bathiya and Santhush",
    "Tigerstyle",
    "Lehmber Hussainpuri",
    "The Uncluded",
    "Randhir Witana",
    "Ashanthi De Alwis"
  ]
}