{
  "description": "In Europe, juke has been popular in European clubs, particularly in [[Paris]], [[Brussels]], and [[Spain]] for years. UK label [[Planet Mu]]'s compilations ''Bangs and Works Volume 1'' (2010) and ''Bangs and Works Volume 2'' (2011) have brought the work of Chicago DJs to a wider audience, drawing some media attention and becoming the first internationally recognized juke compilations. The liner notes for ''Vol. 1'' noted:\n\n{{cquote|Footwork is a hyper rhythmic, abstract dance music, pitched around 160bpm, that largely consists of a template of cut-up samples and phrases that are twisted into repetitive rhythms & shapes, to offbeat, syncopated drum machine patterns and pumping sub-bass lines.<ref name=bangsandworkslinernotes/>}}\n\nApart from ''Bangs and Works'', Planet Mu has also been releasing original albums by Chicago footwork artists, for example ''Da Trax Anthology'' by DJ Nate (2010), which are oftentimes sourced from shelved tracks from the 2000s [[Myspace]] and [[imeem|imeem.com]] era.\n\nThe [[Hyperdub]] label has been a supporter of juke music, releasing much of [[DJ Rashad]]'s material.\nDeeon has released two projects on the famous French Ghetto music label Booty Call Records in 2013\n\nThe early attempt to emulate juke sound in Europe was the infamous \"Footcrab\" by [[Addison Groove]], coming out in 2010 on [[Loefah]]'s ''SWAMP 81'' label. \"Footcrab\" took inspiration from footwork, however the sound of \"Footcrab\" was slowed down to match the tempo of [[UK bass]] genres, around 140 BPM. \"Footcrab\" drew some criticism to be parting ways from the raw nature of juke roots in Chicago and only emulating the sound of juke on a \"child-like\" surface level and the production on \"Footcrab\" was deemed \"cheap\". Notwithstanding the criticism, \"Footcrab\" put Addison Groove on forefront of the UK Bass scene in the [[United Kingdom]]. His subsequent full-length album called ''Transistor Rhythm'' released on Modeselector's ''50 Weapons'' label, while retaining the influence of footwork, shifted more to the earlier days of the genre and to the sound of its immediate predecessor, ghetto house, including [[rave]]y synths at much slower tempos that footwork, around 120–140 BPM. However, the album was also met with mixed to negative reviews.\n\n\nApart from isolated releases like those by [[Addison Groove]] and handful of others, footwork/juke did not meet wide native acceptance in the [[United Kingdom]]. [[Mike Paradinas]], the head of [[Planet Mu]] label explained this  by making two points: first, in his words, was that British party culture is markedly different – relying on [[Illegal drugs|illegal substances]] and [[Alcoholic drink|drinking]] – it would have hard time to catch on rather athletic footwork dancing, and second, in his words, is that historically British artists were generally reluctant to appropriate whole cultures, instead trying to either make their own domestic trends or to add a distinct spin to an existing culture, the thing that did not happen to footwork in Britain.\n\nSince Paradinas’ isolated comments, a thriving Chicago Footwork scene has developed across the UK — particularly in London. Today, footworkers can attend classes led by Tiger Heslop, a dance teacher and member of Creation Global, an international collective of dancers and producers focused on Chicago Footwork. After Werks  is a London-based monthly social event for Chicago Footwork dancers, DJs, producers, and enthusiasts. The London-based footwork party promoter Tropical Waste has regularly teamed up with After Werks to bring DJs such as RP Boo, DJ Earl, and Heavee — among many others — to the UK, where they are joined by UK footwork dancers.\n\nIn addition to curating events, Tropical Waste also hosts a monthly radio show called 160 Unity on Voices Radio. Chris Kanski, a 160 Unity regular and After Werks attendee, spoke to ''The Guardian'' newspaper in 2025 about the London scene, saying: “Footwork nights give that spontaneous expression and that challenge that’s so special in hardcore punk. There are eyes on you, and people are looking both at what you express and what you can do”.",
  "last_revision_date": "2025-11-16T08:47:31Z",
  "top_artists": []
}