{
  "description": "In contrast with Britain, Japan, according to [[Mike Paradinas]], did not hesitate to appropriate western subcultures in their entirety, and that was the reason why in Japan footwork/juke sprung to become, over the 2010s, one of the dominant electronic dance music genres, paired with the burgeoning footwork dancing scene, with competitions and tournaments.\n\nDJ Fulltono from [[Osaka]] is credited as a first notable pioneer of footwork/juke in [[Japan]]. He started bringing footwork/juke into his mixes around 2008, two years prior to the release of the first compilation from ''Bangs and Works'' series on [[Planet Mu]], and at the time, the dominant types of [[electronic dance music]] in Japan were [[house music|house]] and [[techno]] timing at around 120 to 130 [[Beats per minute|BPM]], and [[drum'n'bass]], at around 170–175 BPM, so at first dancing crowds in Japan were confused and deemed footwork as \"too fast\" for their palate. However, with time they have built tolerance to the DJ sounds of DJ Fulltono. It took Japanese producers and listeners almost a decade to adapt to juke, but around 2018 the footwork scene of Japan was noted to be among the most vibrant electronic dance music scenes in the country, incorporating disparate additional influences into sound, such as [[vocaloid]]s, [[Otaku|otaku culture]], [[Japanese rock]], [[reggae]], [[funk]], [[chiptune music]] and [[wonky music]], thus innovating in the genre.\n\nAnother notable influence on the formation of Japanese footwork/juke scene was Japanese [[ghettotech]] scene, movement led by DJ April and DJ Go, among others. DJ Fulltono, apart from being footwork pioneer in Japan, was (and continues to be) an important DJ in Japanese ghettotech scene as well, around the time he started popularizing footwork in Japan.\n\nThe first Japanese juke [[Music label|label]], called ''Booty Tune'' was set up by DJ Fulltono in 2008, initially to release his own tracks, but gradually became an imprint under which other domestic juke artists started to release their tracks. After that, more Japanese footwork labels appeared, namely ''Japanese Mutation Bootyism'' (which released important ''Japanese Juke and Footworks Compilation''), ''Kool Switch Works'' and ''Dubliminal Bounce'' (by Japanese footwork producer Skip Club Orchestra).\n\nThe scene in Japan received support from Chicago scene on several occasions. Many founding fathers of juke toured Japan, many of the events were as well organized by DJ Fulltono. Most Japanese footwork producers who were interviewed by [[Bandcamp]] named footwork producer Traxman from Chicago and ''Bangs and Works'' as their primary sources of inspiration. In return, Traxman released a full album of remixes of his tracks, where remixes were made exclusively by Japanese [[Music producer|producers]].\n\nIn 2018, [[Thump (Vice)|THUMP]] released a video [[documentary]] on Japanese juke and footwork scene.{{citation needed|date=February 2022}}",
  "last_revision_date": "2025-08-04T20:21:35Z",
  "top_artists": []
}