{
  "description": "Creole folk songs originated from the enslaved Black population of Louisiana. These songs dealt with secular themes and were sung in a patois that reflected their grammatical syntax, instrumentation, musical style, and African heritage. Early in the history of the colony, shortly after the founding of New Orleans in 1718, slaves were permitted to gather for Sunday recreation in a plain on the edge of the city. Eventually the latter gathering place became known as Place Congo or [[Congo Square]]. There the blacks performed their dances and sang, accompanied by instruments made from whatever was at hand. [[Lullaby|Lullabies]] also have been handed down from the Creoles. Until this century the need to collect and preserve these songs was often not understood, but in the 1920s an effort was begun to include Cajun and Creole songs in American folk music. The people whose ancestors created the music are among those making an effort to preserve it.\n\nAfro-French people also created a form of French music called [[zydeco]]. Both Cajun and zydeco music are intended for dancing, which shared background associated with bals de maison (house dances). Despite segregation, Creoles shared many songs with their Cajun neighbours, and the Cajun and Creole traditions have long borrowed from each other.\n\nMusic remains vibrant in modern French Louisiana culture and beyond. Traditional [[house dance]]s and community dance clubs are important venues for music performance. Zydeco emerged from Black Creole dance music in rural areas of Louisiana and provides a way for musicians and dancers to fully articulate the deprivations of poverty with intelligence, artistry, and style.\n\nThese musics have been influenced by other music styles, such as [[Western swing]], [[rock and roll]], and [[country music]], as well as blues and [[Rhythm and blues|R&B]], [[Swamp pop|swamp-pop]], [[reggae]], [[Rapping|rap]] and [[hip-hop]].\n\nZydeco is also a hybrid. Zydeco players merge the past and present in a sound that still attracts young dancers. For example, Corey Ledet's  album, ''Accordion Dragon'', features unique band arrangements and includes lush, urbane horn arrangements that are rarely heard on zydeco waltzes but which work quite well. [[Beau Jocque]] mixed zydeco with classic rock and hip-hop, and [[Keith Frank]] has picked up Beau Jocque’s synthesis of zydeco and hip-hop.\n\nBlack French music's listeners constitute a worldwide audience, and their distinctive sounds are part of an important ethnic music. Zydeco is heard at music clubs and festivals around the world. The visibility of zydeco increased in the 1980s when [[Queen Ida]], [[Clifton Chenier]], and [[Rockin' Sidney|Rockin’ Sidney]] each won [[Grammy Awards|Grammy awards]]. Rockin’ Sidney’s recording [[My Toot-Toot|''My Toot Toot'']] became an international novelty hit, and movies such as ''[[The Big Easy (film)|The Big Easy]]'' introduced zydeco sounds to new audiences.\n\nFestivals held in [[Ville Platte, Louisiana|Ville Platte]], [[Mamou, Louisiana|Mamou]], and New Orleans contribute to the perpetuation of this culture. Live Cajun music may be heard at local festivals like the annual [[Festivals Acadiens et Créoles]] or the Breaux Bridge Crawfish Festival. The “trail ride” culture associated with zydeco, where horseback riders take to the prairies on Sunday afternoons in a winding procession that culminates in an outdoor dance, represents a modern tradition.\n\nAlthough the fluency in southwestern Louisiana’s vernacular French continues to decline, young Cajun songwriters continue to compose in French and add original songs to the repertoire. The number of [[jazz]] musicians who have recorded folk songs and other pieces in Creole shows the continuing use of the language by recent musicians.",
  "last_revision_date": "2025-08-03T07:31:14Z",
  "top_artists": []
}