{
  "description": "'''Funk ostentação''' (from [[Portuguese language|Portuguese]]: ''Ostentation funk'', {{IPA|pt|ˈfɐ̃k(i) ostẽtaˈsɐ̃w̃|lang}}) is a Brazilian music style created in [[São Paulo]] in 2008. Strongly influenced by [[Hip-hop|American hip-hop]], the central theme addressed in the songs is [[conspicuous consumption]], and many ''funk ostentação'' artists sing about cars, motorcycles, drink, women, and ambitions to leave the [[favela]] and achieve life goals.\n\nWhile the dominant lyrical themes of the Rio de Janeiro scene at the time were [[criminality]] and lack of [[social justice]], the first ''funk ostentação'' song, \"Bonde da Juju\", recorded by MCs Backdi and Bio G3 in September 2008, established the new genre's opposing theme of [[ostentation]]. Several ''funk ostentação'' festivals were subsequently held in the state of [[São Paulo (state)|São Paulo]], and the movement began to grow. Its national debut came with the launch of the video for \"Megane\" by MC Boy do Charmes in mid-2011. As it became clear that ''funk ostentação'' would be best represented in audiovisual format, the cinematographer [[Kondzilla|KondZilla]] became the first to produce videos, which were received enthusiastically by fans. Of the ten most watched music videos in Brazil in both 2012 and 2013, three were ''funk ostentação''.\n\nIt was established as one of the most popular genres in Brazil with the death of Daniel Pellegrine also known as [[MC Daleste]], who was shot on stage in [[Campinas]] in July 2013.  He had been one of the principal proponents of the genre at the time of his death, and its extensive media coverage included widely televised tributes by other funk artists.\n\n''Funk ostentação'' became strongly associated with the emerging ''[[nova classe média]]'' (new middle class) in Brazil.",
  "last_revision_date": "2025-06-11T06:44:18Z",
  "mixes": [
    {
      "video": "LTcwM2TpUpo"
    }
  ],
  "top_artists": [
    "Nego do Borel",
    "Kevinho",
    "MC Daleste",
    "Pocah",
    "MC Pedrinho",
    "Biel (singer)",
    "Tasha & Tracie",
    "MC Binn",
    "MC Pikachu",
    "MC Gui"
  ]
}