{
  "description": "'''Gospel music''' is a traditional genre of [[Christian music]] and a cornerstone of [[Christian media]], characterized by dominant vocals (often with strong harmonies) and lyrics that reflect [[Christianity|Christian]] teachings and values. The creation, performance, significance, and even the definition of gospel music vary according to culture and social context. Gospel music is composed and performed for many purposes, including aesthetic pleasure, religious or ceremonial purposes, and as an entertainment product for the marketplace. Gospel music can be traced to the early 17th century.\n\n[[Hymn]]s and sacred songs were often performed in a [[call-and-response]] fashion, heavily influenced by ancestral African music. Most of the churches relied on hand-clapping and foot-stomping as rhythmic accompaniment. Most of the singing was done ''[[a cappella]]''. The first published use of the term \"gospel song\" appeared in 1874.\n\nThe original gospel songs were written and composed by authors such as [[George Frederick Root|George F. Root]], [[Philip Bliss]], [[Charles H. Gabriel]], [[William Howard Doane]], and [[Fanny Crosby]]. Gospel music publishing houses emerged. The advent of radio in the 1920s greatly increased the audience for gospel music. Following [[World War II]], gospel music moved into major auditoriums, and gospel music concerts became quite elaborate.\n\n[[Black Gospel music|Black]] and [[Southern gospel]] music are largely responsible for gospel's continued presence in [[contemporary Christian music]], with [[soul music]] by far the best-known [[popular music]] variant. The styles emerged from the [[African-American music]] and [[American folk music]] traditions and have evolved in various ways over the years, continuing to form the basis of [[Black church]] worship even today. It has also come to be used in churches of various other cultural traditions (especially within [[Pentecostalism]]), and by the gospel choir phenomenon spearheaded by [[Thomas A. Dorsey|Thomas Dorsey]], has become a form of musical devotion worldwide. Southern Afroamerican gospel groups used all-male, [[tenor]]–[[lead vocal|lead]]–[[baritone]]–[[bass (voice type)|bass]] quartets. [[Sensational Nightingales]], the Soul Stirrers, Swan Silvertones, and [[the Dixie Hummingbirds]] were famous gospel groups. [[Christian country music]], sometimes referred to as country gospel music, is a subgenre of gospel music with a country flair. Famous [[Christian country music]] performers were [[Grandpa Jones]], [[Webb Pierce]], [[Porter Wagoner]], and [[the Oak Ridge Boys]]. British black gospel refers to gospel music of the [[African diaspora]] produced in the United Kingdom.",
  "last_revision_date": "2025-12-18T13:04:40Z",
  "mixes": [
    {
      "video": "rOmTINlRhxM"
    }
  ],
  "top_artists": [
    "Bob Dylan",
    "Elvis Presley",
    "Kanye West",
    "Stevie Wonder",
    "Ray Charles",
    "Dolly Parton",
    "Aretha Franklin",
    "Whitney Houston",
    "Willie Nelson",
    "Hank Williams"
  ]
}