{
  "description": "'''Grime''' is a genre of [[Electronic dance music|electronic dance music (EDM)]] that emerged in [[London]] in the early 2000s. It developed out of the earlier UK dance style [[UK garage]], and draws influences from [[Jungle music|jungle]], [[dancehall]], and [[Hip hop music|hip hop]]. The style is typified by rapid, syncopated [[breakbeat]]s, generally around 140 [[Tempo#Beats per minute|beats per minute]], and often features an aggressive or jagged electronic sound. [[Rapping|Emceeing]] is a significant element of the style, and lyrics often revolve around gritty depictions of urban life.\n\nThe style initially spread among [[UK pirate radio|pirate radio]] stations and [[underground music|underground]] scenes before achieving some mainstream recognition in the UK during the mid-2000s through artists such as [[Dizzee Rascal]], [[Kano (British musician)|Kano]], [[Lethal Bizzle]], and [[Wiley (rapper)|Wiley]].  Grime's rise in the early 2000s benefited from a time before smartphones and social media dominated the music landscape, allowing the genre to develop at a slower, organic pace. Many of grime's foundational MCs, such as [[Ghetts]], Kano, and [[Skepta]], spent years refining their craft, with early career periods often lasting five to ten years. This period also produced significant archival material, from ''Run the Road'' compilations and ''Lord of the Mics'' DVDs to the ''RWD'' magazine, all of which captured grime's evolution at its peak. The genre’s emergence has often been compared to punk rock, a comparison solidified by tracks like [[Jammer (musician)|Jammer]]'s \"Dagenham Dave,\" a nod to The Stranglers' song of the same name.\n\nThe accessibility of music production technology, DIY media, and pirate radio stations contributed to grime’s grassroots nature. The genre was fueled by a \"create it if it doesn't exist\" mentality, similar to other independent music scenes. In its early days, grime was less a challenge to the music industry and more a direct parallel, with its own ecosystem of photographers, marketers, promoters, journalists, and label owners acting as both creators and gatekeepers. In the mid-2010s, grime began to receive popular attention in Canada. The genre has been described as the \"most significant musical development within the UK for decades.\"\n\nThough they are often compared, grime is generally considered distinct from hip hop due to its roots primarily being genres such as UK garage and jungle.",
  "top_artists": [
    "Tinie Tempah",
    "Dizzee Rascal",
    "Stormzy",
    "Labrinth",
    "Estelle (musician)",
    "The Streets",
    "Skepta",
    "Tinchy Stryder",
    "Professor Green",
    "Roll Deep"
  ]
}