{
  "description": "'''Gwo ka''' is an [[Antillean Creole]] term for [[big drum]].  Alongside ''Gwotanbou'', simply ''Ka'' or ''Banboula'' (archaic), it refers to both a family of hand [[drum]]s and the music played with them, which is a major part of [[music of Guadeloupe|Guadeloupean folk music]].  Moreover, the term is occasionally found in reference to the small, flat-bottomed tambourine (''tanbou d'bas'') played in [[Kwadril#Guadeloupe balakadri|kadri]] music, or even simply to drum (''tanbou'') in general.\n\nThe Gwo Ka musical practice emerged in the seventeenth century, during the transatlantic slave trade\n\n[[#Gwo_Ka:_the_rhythms|Seven simple drum patterns]] form the basis of gwo ka music, on which the drummers build rhythmic improvisations.  Different sizes of drums provide the foundation and its flourishes.  The largest, the [[Boula (music)|boula]], plays the central rhythm while the smaller ''maké'' (or markeur) embellishes upon it, inter-playing with dancers, audience, or singer.  Gwo ka singing is usually guttural, nasal, and rough, though it can also be bright and smooth, and is accompanied by uplifting and complex harmonies and melodies.{{citation needed|date=November 2017}}  There are also dances that tell folk stories that are accompanied by the gwo ka drums.\n\nIn modern, urban Guadeloupe, playing drums is not inextricably linked to dance anymore. But historically, the two practices were inseparable parts of the tradition of [[lewoz|léwôz]], events held fortnightly on Saturdays near the bigger plantations (payday), and each Saturday of the carnival season in areas of greater land parcelling. Gwoka music was–and still is–played throughout the year in various cultural manifestations such as ''léwòz'', ''kout’tanbou'', ''véyé'' and religious events, for example Advent's wake. \nToday, rural Guadeloupans still gather for léwôz experiences, but a modernized and popularized form of gwo ka exists independently, known as [[#Gwo_ka_moderne|gwo ka moderne]].",
  "last_revision_date": "2024-11-20T19:12:05Z",
  "mixes": [
    {
      "video": "YpRcemoElUw"
    }
  ],
  "top_artists": []
}