{
  "description": "'''Hardstyle''' is an [[electronic dance music|electronic dance]] genre that emerged in the late 1990s, with origins in the [[Netherlands]], [[Belgium]] and [[Italy]]. Hardstyle mixes influences from [[techno]], [[new beat]] and [[Hardcore (electronic dance music genre)|hardcore]].\n\nEarly hardstyle was typically written at 140 [[Tempo|BPM]] (''beats per minute''); however, modern hardstyle is faster, produced around 150 BPM. It consisted of overdriven and hard-sounding kick drums, often accompanied by an offbeat bass, known as a \"reverse bass\". As the genre grew, the production techniques and songwriting changed to be suited to a more commercial audience. Modern hardstyle can be recognized by its use of synthesizer melodies and distorted sounds, coupled with hardstyle's signature combination of [[percussion]] and [[bass (sound)|bass]]. The genre is particularly known for its [[harmony|harmonic]] use of kickdrums. Due to the sustained nature of a hardstyle kick, producers are able to play basslines by using only the kick itself, which becomes a distinct bass tone through a series of [[Distortion (music)|distortion]], [[Equalization (audio)|equalization]] and layering (among other methods). This technique is known as \"pitching\" a kick.\n\nThe genre gained commercial acceptance in the 2010s, with hardstyle artists performing on the biggest stages in [[Electronic dance music|EDM]] worldwide.\n\nHardstyle influenced other styles of electronic dance music such as [[big room house]], which began sharing similarities with hardstyle like structures, rhythms, and later, pitching kicks became popular in big room too. Hardstyle also played a large influence in [[frenchcore]] and [[happy hardcore]] music, which both became popular in the late 2010s with the hardstyle audience after producers started applying hardstyle production techniques and melodic styles to the genres.",
  "last_revision_date": "2025-05-24T01:31:59Z",
  "mixes": [
    {
      "video": "7djmEGIO8xk"
    }
  ],
  "top_artists": [
    "Hardwell",
    "Showtek",
    "Yellow Claw (DJs)",
    "Timmy Trumpet",
    "W&W",
    "Headhunterz",
    "Kayzo",
    "Valentino Khan",
    "Blasterjaxx",
    "Darren Styles"
  ]
}