{
  "description": "'''Hardbag''' is a [[genre]] of [[electronic dance music]] popular in the mid-1990s. Having evolved out of the [[Diva house|handbag house]] scene in 1993–1994, the genre enjoyed massive, albeit brief, popularity, with several hardbag releases achieving positions in the upper echelons of the UK chart. It was at the time sometimes confused with [[Hard NRG|nu-NRG]], yet the styles were discernibly different.\n\n\"[[Don't You Want Me (Felix song)|Don't You Want Me]]\" by [[Felix (musician)|Felix]] is largely considered to be the track that launched the hardbag explosion. Produced by [[Rollo Armstrong]] of [[Faithless]], [[Red Jerry]] and [[Felix (musician)|Felix]], \"Don't You Want Me\" was released in 1992, scoring a Top 10 placing on the UK singles chart.\n\nThe popularity of the hardbag genre reached its zenith in 1995 with releases by [[Commander Tom]], [[Candy Girls]], Rollo & [[Sister Bliss]] and [[Mrs Wood]] all crossing over into the mainstream.  Indeed, the sound began to meld with [[mákina]], evident on tracks such as \"Forever Young\" by [[Interactive (Techno Band)|Interactive]] and \"Rainbow Islands\" by Seb.\n\nThe two most influential exponents of the sound were [[Netherlands|Dutch]] producer Patrick Prins (who, recording a variety of aliases, scored several large UK club and chart hits such as \"Bits & Pieces\" – Artemesia) and the late [[Tony De Vit]], whose hardbag composition \"Hooked\" is still considered one of the definitive examples of the genre.  Another great presence in the hardbag scene was [[Red Jerry]], former head of [[Hooj Choons]]. Other influential producers include [[Rollo Armstrong]] (later of the group [[Faithless (band)|Faithless]]) and [[Paul Masterson]], the latter of whom diversified hardbag remixes to incorporate [[hi-NRG]] elements.\n\nBy early 1997 the Hardbag craze had died down, since then Hardbag created an influence on  [[UK hard house]] and [[electro house]]. Labels such as Tripoli Trax expounded this sound via releases such as \"Bells Of Revolution\" by Lemon 8 and \"Raise Your Hands\" by Knuckleheadz.\n\nSeveral hardbag producers went on to become big names within the trance scene in the late 1990s. These included [[Matt Darey]] (as Bi-Boy Action Squad, Orgasmatron and Space Baby), [[Sister Bliss]] (as a solo artist and co-producer with [[Rollo Armstrong|Rollo]] and [[Jon of the Pleased Wimmin]]), and [[John Graham (producer)|John Graham]] whose Quivver alias had a hardbag hit with \"Saxy Lady\" (1994)."
}