{
  "description": "'''Israeli hip hop''' refers to [[hip hop]] and rap music in [[Israel]]. Israeli hip hop artists enjoy wide popularity in Israel and have succeeded in appealing to international markets particularly the United States.\n\nThe genre began gaining popularity in Israel during the 1990s, influenced by global hip hop trends. However, traces of native Hebrew hip hop can be found as early as the mid-1980s. [[Yair Nitzani]], then a member of the Israeli rock group [[Tislam]], released an old-school hip hop parody album under the name \"Hashem Tamid\". This early work was influenced by New York's hip hop scene. In 1993, Nigel Haadmor and [[Yossi Fine]] produced the album \"Humus Metamtem\", further establishing the genre in Israel. Haadmor, born Yehoshua Sofer, brought a unique sound influenced by his Caribbean roots and Jewish heritage.\n\nA significant milestone in Israeli hip hop was the establishment of the radio show \"Esek Shachor\" (Black Business) in 1995 by [[Quami De La Fox]] (Eyal Freedman) and DJ Liron Teeni on [[Galgalatz]], the Israeli Army's radio station. This show played a mix of Hebrew, Arabic, and English hip hop and became highly popular, significantly influencing the Israeli hip hop scene. Teeni is credited with encouraging artists to rap in Hebrew, thus making the genre more authentic to Israeli culture and accessible to the local audience.\n\nThe first notable Israeli hip hop group, [[Shabak Samech]], began rapping in Hebrew in 1995, inspired by the [[Beastie Boys]]. Initially, their music was met with resistance, but they persevered and eventually found success. Israeli hip hop often addresses themes unique to the country's social and political landscape, including the struggles of growing up in Israel, spirituality, and politics.",
  "last_revision_date": "2025-12-14T03:45:25Z",
  "mixes": [
    {
      "playlist": "PL0FAF0A40B16B6F6B"
    }
  ],
  "top_artists": [
    "Hadag Nahash",
    "Ravid Plotnik",
    "Ron Nesher",
    "Tuna (rapper)",
    "The Shadow (rapper)",
    "Jimbo J",
    "Atar Mayner",
    "Fishi Ha-Gadol",
    "Vibe Ish"
  ]
}