{
  "description": "A '''jam band''' is a musical group whose concerts and [[live album]]s substantially feature improvisational \"[[jam session|jamming]]\". Typically, jam bands will play variations of pre-existing songs, extending them to [[musical improvisation|improvise]] over  [[vamp (music)|chord patterns]] or rhythmic [[groove (music)|groove]]s. Jam bands are known for having a very fluid structure, playing long sets of music which often cross genre boundaries, varying their nightly setlists, and [[Segue (music)|segueing]] from one song into another without a break.\n\nThe jam-band musical style, spawned from the [[psychedelic rock]] movement of the 1960s, was a feature of nationally famed groups such as the [[Grateful Dead]] and [[The Allman Brothers Band]], whose regular touring schedules continued into the 1990s. The style influenced a new wave of jam bands who toured the United States with jam band-style concerts in the late 1980s and early '90s, such as [[Phish]], [[Blues Traveler]], [[Widespread Panic]], [[Dave Matthews Band]], [[The String Cheese Incident]], [[moe.]], and [[Col. Bruce Hampton and the Aquarium Rescue Unit]]. The jam-band movement gained mainstream exposure in the US in the early 1990s with the rise of Phish and the Dave Matthews Band as major touring acts and the dissolution of the Grateful Dead following [[Jerry Garcia]]'s death in 1995.\n\nJam-band artists often perform a wide variety of genres. While the Grateful Dead is categorized as psychedelic rock, by the 1990s the term \"jam band\" was applied to acts that incorporated genres such as [[blues]], [[country music]], [[contemporary folk music]], [[funk]], [[progressive rock]], [[world music]], [[jazz fusion]], [[Southern rock]], [[alternative rock]], [[acid jazz]], [[bluegrass music|bluegrass]], [[folk rock]] and [[electronic music]] into their sound. Although the term has been used to describe cross-genre and improvisational artists, it retains an affinity to the fan cultures of the Grateful Dead or Phish.\n\nA feature of the jam-band scene is fan recording of live concerts. While the mainstream music industry often views fan taping as \"illegal [[bootleg recording|bootlegging]]\", jam bands often allow their fans to make tapes or recordings of their live shows. Fans trade recordings and collect recordings of different live shows, because improvisational jam bands play their songs differently at each performance.",
  "last_revision_date": "2025-09-05T06:02:48Z",
  "mixes": {
    "help_reason": "Not sure what a mix for this would look like. Seems like it would be pretty eclectic?"
  },
  "top_artists": [
    "Jerry Garcia",
    "Phish",
    "Cream (band)",
    "John Popper",
    "Dave Matthews Band",
    "The Allman Brothers Band",
    "Bob Weir",
    "Phil Lesh",
    "Mickey Hart",
    "Trey Anastasio"
  ]
}