{
  "description": "'''Japanese reggae''' is [[reggae]] music originating from [[Japan]]. The first reggae band to perform in Japan was [[The Pioneers (band)|The Pioneers]] who toured in 1975. However it was not until 1979, when [[Jamaica]]n singer [[Bob Marley]] visited Japan on holiday that reggae would gain momentum. Marley wanted to attend a concert by the [[Flower Travellin Band]] and when looking for information, he met famed Japanese [[percussionist]] \"Pecker\" who informed him that the group had already disbanded. The two became good friends, and Pecker suggested to Marley a collaboration between acclaimed Japanese and Jamaican artists. This suggestion resulted in the albums ''Pecker Power'', and ''Instant Rasta'' being recorded in Jamaica at \"Channel One\" and \"Tuff Gong Studio\" in 1980. The albums featured Japanese artists {{nihongo|[[Minako Yoshida]]|吉田美奈子}}, {{nihongo|[[Ryuuichi Sakamoto]]|坂本龍一}}, {{nihongo|[[Naoya Matsuoka]]|松岡直也}}, {{nihongo|[[Shigeharu Mukai]]|向井滋春}}, and {{nihongo|[[Akira Sakata]]|坂田明}}, alongside Jamaican artists [[Augustus Pablo]], [[Sly & Robbie]], [[The Wailers (1963-1974 band)|The Wailers]], [[Rico Rodriguez (musician)|Rico Rodriguez]], [[Carlton Barrett]] and [[Marcia Griffiths]]. These two albums influenced both Japanese and Jamaican artists, and are regarded as spreading reggae to [[Japan]].\n\nSome of the first reggae artists from Japan were [[Joe Yamanaka]] and [[Mute Beat]], the latter's recordings made Japan internationally renowned for [[dub music|dub]] and influenced many artists such as [[Dry & Heavy]], [[Fishmans]], [[UA (singer)|UA]]. Another pioneering artist was Nahki. He was scouted by [[Sugar Minott]] and began performing in Jamaica, and later formed Japan's first reggae festival \"Japansplash\" in 1985. The esteemed band {{nihongo|[[Jagatara]]|じゃがたら}} combined [[punk rock]], [[jazz]], and [[funk]] with reggae and influenced hybrid artists such as [[Ego-Wrappin']]. The [[dancehall]] style was brought to Japan by [[Rankin' Taxi]] in the mid 1980s, and rock group [[The Roosters]] incorporated [[ska]] into some of their songs which influenced artists such as the [[Tokyo Ska Paradise Orchestra]], and [[Kemuri]].\n\nMusical relations between Jamaican and Japanese artists remains strong, often with collaborations between artists.\n\nThe most important reggae festival is the Yokohama reggae festival or Yokohama Reggae Sai, which is usually in July to September, and has been moved to nearby Kawasaki.",
  "top_artists": [
    "Bagdad Cafe the Trench Town"
  ]
}