{
  "description": "The term \"'''jazz rock'''\" (or \"jazz/rock\") is sometimes used as a synonym for \"jazz fusion\". [[The Free Spirits]] have sometimes been cited as the earliest jazz rock band.\n\nJazz rock bands such as [[Chicago (band)|Chicago]], [[The Ides of March (band)|The Ides of March]], [[Blood Sweat & Tears|Blood, Sweat & Tears]], [[Chase (band)|Chase]], [[Lighthouse (band)|Lighthouse]], Ten Wheel Drive, The Dreams, [[Santana (band)|Santana]], [[Colosseum (band)|Colosseum]], [[Soft Machine]], [[Nucleus (band)|Nucleus]], [[Brand X]], [[the Mothers of Invention]] and [[If (band)|IF]] blended jazz and rock with electric instruments.  Miles Davis' fusion jazz was \"pure melody and tonal color\", while Frank Zappa's music was more \"complex\" and \"unpredictable\". Zappa released the solo album ''[[Hot Rats]]'' in 1969. The album contained long instrumental pieces with a jazz influence. Zappa released two albums, ''[[Waka/Jawaka]]'' and ''[[The Grand Wazoo]]'', in 1972, which were influenced by jazz. [[George Duke]] and [[Aynsley Dunbar]] played on both. 1970s band [[Steely Dan]] has been lauded by music critic [[Neil McCormick]] for their \"smooth, smart jazz-rock fusion\".\n\nThe jazz artists of the 1960s and 1970s had a large impact on many rock groups of that era such as [[Santana (band)|Santana]] and Frank Zappa. They took jazz phrasing and harmony and incorporated it into modern rock music, significantly changing music history and paving the way for artists that would follow in their footsteps. Carlos Santana in particular has given much credit to Miles Davis and the influence he had on his music. While Miles Davis combined jazz with modal and rock influences, [[Carlos Santana]] combined these along with Latin rhythms and feel, shaping a whole new genre, [[Latin rock]]. Other rock artists such as [[Gary Moore]], [[The Grateful Dead]], [[The Doors]], [[Jimi Hendrix]], [[John Scofield]], and [[The Allman Brothers Band]] have taken influences from blues, jazz, [[blues rock]], jazz rock and incorporated it into their own music.\n\nAccording to AllMusic, the term jazz rock \"may refer to the loudest, wildest, most electrified fusion bands from the jazz camp, but most often it describes performers coming from the rock side of the equation...jazz rock first emerged during the late '60s as an attempt to fuse the visceral power of rock with the musical complexity and improvisational fireworks of jazz. Since rock often emphasized directness and simplicity over virtuosity, jazz rock generally grew out of the most artistically ambitious rock subgenres of the late '60s and early '70s: [[psychedelic music|psychedelia]], [[progressive rock]], and the singer-songwriter movement.\"\n\nAccording to jazz writer Stuart Nicholson, jazz rock paralleled [[free jazz]] by being \"on the verge of creating a whole new musical language in the 1960s\". He said the albums ''[[Emergency! (album)|Emergency!]]'' (1969) by the [[Tony Williams Lifetime]] and ''[[Agharta (album)|Agharta]]'' (1975) by Miles Davis \"suggested the potential of evolving into something that might eventually define itself as a wholly independent genre quite apart from the sound and conventions of anything that had gone before\". This development was stifled by commercialism, Nicholson said, as the genre \"mutated into a peculiar species of jazz-inflected pop music that eventually took up residence on FM radio\" at the end of the 1970s.\n\nIn the 1970s, American fusion was being combined in the U.K. with progressive rock and psychedelic music. Bands who were part of this movement included Brand X (with [[Phil Collins]] of Genesis), Bruford ([[Bill Bruford]] of Yes), Nucleus (led by [[Ian Carr]]), and Soft Machine. Throughout Europe and the world this movement grew due to bands like [[Magma (band)|Magma]] in France, [[Passport (band)|Passport]] in Germany, [[Time (Yugoslav band)|Time]], [[Leb i Sol]] and [[September (band)|September]] in Yugoslavia, and guitarists [[Jan Akkerman]] (The Netherlands), [[Volker Kriegel]] (Germany), [[Terje Rypdal]] (Norway), [[Jukka Tolonen]] (Finland), [[Ryo Kawasaki]] (Japan), and [[Kazumi Watanabe]] (Japan).",
  "last_revision_date": "2025-10-13T00:20:52Z",
  "top_artists": [
    "Steely Dan",
    "Henry Mancini",
    "Chicago (band)",
    "Journey (band)",
    "Blood, Sweat & Tears",
    "The Allman Brothers Band",
    "The Mothers of Invention",
    "Dave Matthews",
    "Soft Machine",
    "Vinnie Colaiuta"
  ]
}