{
  "description": "'''Jazz fusion''' (also known as '''jazz rock''', '''jazz-rock fusion''', or simply '''fusion''') is a [[popular music]] [[Music genre|genre]] that developed in the late 1960s when musicians combined [[jazz]] harmony and [[jazz improvisation|improvisation]] with [[rock music]], [[funk]], and [[rhythm and blues]]. [[Electric guitar]]s and [[Bass guitar|basses]], [[Guitar amplifier|amplifiers]], and [[keyboard instrument]]s (including [[electric piano]]s and [[electric organ|organ]]s) that were popular in rock began to be used by jazz musicians, particularly those who had grown up listening to rock and roll.\n\nJazz fusion [[arrangements]] vary in complexity. Some employ groove-based vamps fixed to a single key or a single chord with a simple, repeated melody. Others use elaborate [[chord progression]]s, unconventional time signatures, or melodies with [[Hauptstimme|counter-melodies]], in a similar fashion to [[progressive rock]]. These arrangements, whether simple or complex, typically include improvised sections that can vary in length, much like in other forms of jazz.\n\nAs with jazz, jazz fusion can employ brass and woodwind instruments such as trumpet and saxophone, but other instruments often substitute for these. A jazz fusion band is less likely to use acoustic [[piano]] and [[double bass]], and more likely to use electric guitars, electric pianos, organs, [[synthesizer]]s, and [[bass guitar]].\n\nThe term \"jazz rock\" is sometimes used as a synonym for \"jazz fusion\" and for music performed by late 1960s- and 1970s-era rock bands that added jazz elements to their music. After a decade of popularity during the 1970s, fusion expanded its improvisatory and experimental approaches through the 1980s in parallel with the development of a radio-friendly style called [[smooth jazz]]. Experimentation continued in the 1990s and 2000s. Fusion albums, even those that are made by the same group or artist, may include a variety of musical styles. Rather than being a codified musical style, fusion can be viewed as a musical tradition or approach.",
  "last_revision_date": "2025-11-17T10:17:22Z",
  "mixes": [
    {
      "playlist": "PLmurAzSrFpoKwRDk53eSsgNAN4ShWWhCW"
    }
  ],
  "top_artists": [
    "Miles Davis",
    "Frank Zappa",
    "Herbie Hancock",
    "George Benson",
    "Chick Corea",
    "Santana (band)",
    "Donald Byrd",
    "Zakir Hussain (musician)",
    "Bobby Hutcherson",
    "L. Subramaniam"
  ]
}