{
  "description": "'''Jersey club rap''' is a fusion genre of [[hip-hop]] and [[Jersey club music]].\n\nThe years between 2018 and 2020 were pivotal to the resurgence in popularity of Jersey club music as, for the first time ever, Jersey artists (rappers and singers) began making original rap songs using Jersey club beats. [[East Orange, New Jersey|East Orange]] rapper Unicorn151 aka Killa Kherk Cobain, [[Irvington, New Jersey|Irvington]] singer [[Cookiee Kawaii]], and Newark producer/DJ/artist Uniiqu3 began to format Jersey club beats into song format using their own vocals and lyrics for verses, hooks, and bridges. Morphing Jersey Club into this sample-free, lyric infused song format now allowed radio stations like [[WQHT|Hot 97]], [[WHTZ|Z100]], [[WWPR-FM|Power 105.1]], and [[Sirius XM]] to play these records in regular rotation with Hip-Hop, R&B, [[Top 40]], etc. This allowed Jersey Club music to gain a much wider audience. Where Jersey Club music was originally pioneered, produced, and created by the producers and the DJ's, the years 2018 - 2020 saw the emergence of the first ever Jersey Club \"Artists\". Unicorn151 aka Killa Kherk Cobain, Cookiee Kawaii, Uniiqu3, Chad B and DJ Jay Hood fall into this new category of Jersey Club Artists.\n\nUnicorn151 aka Killa Kherk Cobain alongside producers Ace Mula and DJ Fade began experimenting with a new sound for Jersey Club music in 2018. While much of the Jersey Club music being created catered to dancers and children, Unicorn151, Ace Mula, and DJ Fade began producing songs that catered to their gangsta rap fans. Simultaneously in neighboring [[Brooklyn|Brooklyn, New York]], the [[Brooklyn drill]] sound of [[Pop Smoke]], [[Fivio Foreign]], and [[22Gz]] was also becoming a worldwide phenomena, which naturally trickled its influence and sound to the neighboring boroughs of NYC and nearby New Jersey. DJ Fade and Unicorn, through mutual friends at the radio stations, were able to collaborate with these Brooklyn drill rappers to produce Jersey Club remixes for many popular Brooklyn drill artists. While the DJ Fade and Unicorn duo, known as Jersey Gods, were the first to fuse both sounds, these songs were not yet considered Jersey Drill, but rather Jersey Club mixes of [[Brooklyn drill]] and [[UK drill]].\n\nIn 2019 Ace Mula was commissioned to produce Jersey Club beats for Unicorn151 aka Killa Kherk Cobain to rap over. Ace Mula's beats were specifically tailored for [[Trap music|trap]], [[Drill music|drill]], and [[Gangsta rap]], which allowed Unicorn151 to maintain his natural rap cadence, while the beats switched between trap, drill, and Jersey club beats throughout the songs. This specific usage of Brooklyn drill inspired production on top of Jersey club beat patterns gave each record a distinct sound that could easily be identified as having origins in New Jersey. These newfound Jersey club rap records inspired many rappers in Newark and the surrounding areas to embrace their homegrown sound and begin rapping on beats infused with Unicorn151 and Ace Mula's signature Jersey club sound.\n\nIn 2020, [[PBS|PBS Soundfield]] visited Newark for a documentary to interview Uniiqu3, Unicorn151 aka Killa Kherk Cobain, DJ Fade, and DJ Tameil for an in-depth segment detailing the newest evolutions of Jersey Club music and this new generation of Jersey Club Artists.\n\nIn 2021, Newark-based Jersey club rapper [[Bandmanrill]] released a [[Instagram|reel]] via [[Instagram]] and [[TikTok]] where he joked about rapping [[Drill music|drill]] lyrics over a Jersey club beat. The skit went viral as fans took an immediate liking to Bandmanrill's drill-like flow, cadence, and lyrics over the Jersey Club beat. Bandmanrill went on to turn his skit into the full length single and video titled \"HeartBroken\" produced by Newark producer [[MCVertt|McVertt]]. This sparked a widespread social media debate on platforms like TikTok, Instagram, and Facebook as to what this new sound should be called or titled. Jersey Drill or Jersey Club Drill?\n\nIn 2021, Unicorn151 aka Killa Kherk Cobain, Bandmanrill, and Ace Mula released the first official Jersey Drill song and music video titled \"Jack N Drill\". Together they solidified and jump-started the Jersey Drill movement by collaborating on the \"Jack N Drill\" single, which was followed by a [[Drill music|drill-style]] music video signifying that this sound is officially the \"Jersey Drill\" sound. The title \"Jack N Drill\" is a triple-entendre play on words. \"Jackin{{' \"}} is street slang for stealing or robbing. Newark, New Jersey, is historically notorious for \"[[Carjacking|carjackin']]{{-\"}}, so it can humorously be said that New Jersey is \"jackin{{' \"}}, or forcefully taking, the drill sound from the UK and Brooklyn. \"Jackin{{' \"}} is also street slang in NYC for \"claiming something with pride\". Many NYC drill artists tout that they are \"jackin{{' \"}} a certain gang affiliation. Thus, \"Jack N Drill\" can also be interpreted that New Jersey is pridefully claiming the drill sound as their own sub-genre. \"Jack N Drill\" also plays off of the story \"[[Jack and Jill]]\", which can be interpreted that New Jersey and Brooklyn Drill see themselves as partners overcoming the same obstacles and working towards the same goal.\n\nPopular New Jersey [[Drill music|drill]] artists include Unicorn151 aka Killa Kherk Cobain, MBM Franko, Bandmanrill, Ib Mattic, Daidough, and Baby ATM."
}