{
  "description": "'''Jit''' (also known as '''jiti''', '''jit-jive''' and the '''[[Harare]] beat''') is a style of popular [[Zimbabwean music|Zimbabwe]]an [[dance music]]. It features a swift rhythm played on [[drum]]s and accompanied by a [[guitar]]. Jit evolved out many diverse influences, including domestic [[chimurenga music|chimurenga]], Congolese [[African Rumba|rumba]] and Tanzanian guitar styles.{{cn|date=August 2023}}\n\nThe genre was popularized in the 1980s by bands like [[Chazezesa Challengers]], [[Four Brothers (band)|The Four Brothers]], and [[Bhundu Boys]]. Jit is one of Zimbabwean fast beat, but there is a confusion between the more popular \"sungura\" which is said to be Jit which was popularised by Chazezesa Challengers and many others including Alick Macheso and Orchestra Mberikwazvo.{{cn|date=August 2023}}\n\nGibbs calls his type of Jit \"Urban Jit\" due to its mellowness and soft tempo which comprises fused elements of calypso, country, and any other genre depending on the composition as a way to improve its appeal to the new generation as culture is always evolving.{{cn|date=August 2023}}\n\nJit music is originally played by people singing in a circle and playing to or singing with one or two drums called \"Mutumba\" and these drums are played in rhythm with each other and in sync with the song\" vocals\". One will be leading with the vocals and the rest will answer to the call and sometimes sing altogether in harmony, the lead vocalist may chant and the people answering will give the vocalist room to do all the adlibing before they answer.{{cn|date=August 2023}}\n\nIn the early 1970s there was a very popular group called \"Dzumbunu Choir\". This group used to play raw Jit with the basic instruments of drum or drums and \"hosho\" jingles. Dzumbunu Choir was resident at Goromonzi or Arcturus area about sixty kilometres out of Harare on the North eastern side. As people sing they may use jingles or \"hosho\" shakers as African music is generally percussive. Jit is in nowadays mostly used in its raw content by political parties as a campaign vehicle due to its flexibility in accommodating chants, singing, expressiveness and infectious tunes that are so catchy and easy to learn if a new song is introduced.{{cn|date=August 2023}}\n\nJit is a highly danceable beat that commands the listener to dance and there are so many types of dances associated with it such as hwishu, tuwisti, kongonya, borodhero, honda, chipisi and many others. Bhorodhero is the most popular one due to it being popularised by Alick Macheso and System Tazvida's Chazezesa Challengers in their repertoires. The name bhorodhero is a derivative from a race course's name in Harare called Borrowdale Race Course as the dance resembles a galloping horse.{{cn|date=August 2023}}",
  "top_artists": [
    "Bhundu Boys",
    "Paul Matavire"
  ]
}