{
  "description": "'''K-pop''' ({{Korean/auto|hangul=^케이팝|rr=yes}}; an abbreviation of \"Korean popular music\") is a form of [[popular music]] originating in South Korea. The music genre that the term is used to refer to colloquially emerged in the 1990s as a form of [[youth subculture]], with Korean musicians taking influence from Western [[Electronic dance music|dance music]], [[hip-hop]], [[Contemporary R&B|R&B]] and [[Rock music|rock]]. Today, K-pop commonly refers to the musical output of [[teen idol]] acts, chiefly [[girl group]]s and [[boy band]]s, who emphasize [[Visual communication|visual appeal]] and [[Performing arts|performance]]. As a [[Pop music|pop]] genre, K-pop is characterized by its [[Melody|melodic]] quality and cultural hybridity.\n\nK-pop can trace its origins to \"rap dance\", a fusion of hip-hop, [[techno]] and rock popularized by the group [[Seo Taiji and Boys]], whose experimentation helped to modernize South Korea's contemporary music scene in the early 1990s. Their popularity with teenagers incentivized the music industry to focus on this demographic, with [[Lee Soo-man]] of [[SM Entertainment]] developing the [[Korean idol]] system in the late 1990s and creating acts like [[H.O.T.]] and [[S.E.S. (group)|S.E.S.]], which marked the \"first generation\" of K-pop. By the early 2000s, [[TVXQ]] and [[BoA]] achieved success in Japan and gained traction for the genre overseas.\n\nAs a component of the [[Korean Wave]], the international popularity of K-pop by the 2010s can be attributed to the rise of [[social media]]. In 2019, South Korea ranked sixth among the top ten music markets worldwide, with artists [[BTS]] and [[Blackpink]] leading the growth. 2020 was a record-breaking year for South Korea when it experienced a 44.8% growth and became the fastest-growing major market of the year.\n\nDespite heavy influence from [[American popular music|American pop music]], some have argued that K-pop maintains a distinctness in mood and energy. The \"Koreanness\" of K-pop has been debated in recent years, with an increasing share of Western songwriters, non-Korean artists, songs in English and marketing for a global audience. Some authors have theorized K-pop as a new kind of \"transnational culture\" with \"global dissemination\".\n\nK-pop is known for its tight managerial control. It has been criticized for its [[commercialism]] and treatment of artists. The industry is dominated by four major companies—SM, [[YG Entertainment|YG]], [[JYP Entertainment|JYP]] and [[Hybe Corporation|Hybe]]. In the 2020s, the genre has been marked by greater artist autonomy and companies localizing their production methods overseas; groups like [[JO1]] and [[Katseye]] have resulted from this [[globalization]].{{TOC limit|3}}",
  "last_revision_date": "2025-07-26T00:07:53Z",
  "mixes": [
    {
      "video": "ylryDyExfx8"
    }
  ],
  "top_artists": [
    "BTS",
    "Girls' Generation",
    "Super Junior",
    "Blackpink",
    "Seventeen (South Korean band)",
    "Twice",
    "Shinee",
    "TVXQ",
    "BoA",
    "Psy"
  ]
}