{
  "description": "'''Kansas City jazz''' is a style of [[jazz]] that developed in [[Kansas City, Missouri]] during the 1920s and 1930s, which marked the transition from the structured [[big band]] style to the much more [[Musical improvisation|improvisational]] style of [[bebop]]. The hard-[[Swing (jazz performance style)|swinging]], bluesy transition style is bracketed by [[Count Basie]], who in 1929 signed with [[Bennie Moten]]'s Kansas City Orchestra, and Kansas City native [[Charlie Parker]], who promoted the bebop style in America.\n\nKansas City is known as one of the most popular \"cradles of jazz\". Other cities include [[New Orleans]], [[Chicago]], [[St. Louis]], [[Philadelphia]], and [[New York City]]. Kansas City was known for the organized musicians of the Local 627 A.F.M., which controlled a number of venues in the city. Almost every jazz history depicts Kansas City jazz as a fertile ground for the development of big bands, virtuosic performances, and legendary performers. In the 1920s was a [[Great Migration (African American)|Great Migration]] from the south and the search for musical work in Kansas City, Missouri, where the Black population rose from 23,500 to 42,000 between 1912 and 1940. Russell, Diggs, and Pearson have well documented how the vice district expanded within black neighborhoods of Kansas City, resulting in economic success for jazz musicians. Many musicians from the Southwest moved to Kansas City for its plentiful jobs. \"Nightclubs in Kansas City served up prostitution, gambling, and narcotics along with liquor\". \n\nThe community hosted a vibrant jazz and blues music scene, attracting musicians from across the country. The community prominently shaped the development of jazz and blues and hosted some of the era's most pivotal musicians. Edward Murrow wrote in the ''[[Omaha World-Herald]]'': \"If you want to see sin, forget about Paris and go to Kansas City\". A variety of clubs and cabarets, dance halls, and jazz venues arose in Kansas City, including the Paseo Room, Pla-Mor Ballroom, Reno Club, Amos 'n' Andy, Boulevard Lounge, Cherry Blossom, Chocolate Bar, Lone Star, Elk's Rest, Old Kentucky Bar-B-Que, Sunset, Subway, Spinning Wheel, Hawaiian Gardens, Street's Blue Room, Hell's Kitchen, The Hi Hat, and the Hey-Hay. Kansas City became known for \"small, intimate\" clubs that hosted frequent, \"long-lasting jam sessions\". Becker said that Kansas City \"drew its vitality from the political corruption which made nightlife possible\". Kansas City's concentration of outstanding jazz talent had made it a potential competitor to New York and Chicago by the middle of the 1930s."
}