{
  "description": "'''LGBTQ representation in hip-hop music''' has existed since the birth of the genre even while enduring blatant discrimination. Due to its adjacency to [[disco]], the earliest days of [[Hip-hop music|hip-hop]] had a close relation to [[LGBTQ]] subcultures, and multiple LGBTQ DJs have played a role in popularizing hip-hop. Since the early 2000s there has been a flourishing community of LGBTQ hip-hop artists, activists, and performers breaking barriers in the mainstream music industry. Despite this early involvement, hip-hop has long been portrayed as one of the least LGBTQ-friendly genres of music, with a significant body of the genre containing [[homophobic]] views and [[anti-gay]] lyrics, with mainstream artists such as [[Eminem]] and [[Tyler, the Creator]] (whose own sexuality has been repeatedly questioned throughout his career) having used casual homophobia in their lyrics, including usages of the word ''[[Faggot (slang)|faggot]]''. Attitudes towards homosexuality in [[hip-hop music|hip-hop]] culture have historically been negative, with slang that uses homosexuality as a punchline such as \"sus\", \"[[no homo]]\", and \"pause\" being heard in hip-hop lyrics from some of the industry's biggest artists.\n\nLabels such as '''homo hop''' or '''queer hip-hop''' group all artists identifying as members of the LGBTQ community into a subgenre of hip-hop based solely on their sexuality. These subgenre labels are not marked by any specific production style, as artists within it may simultaneously be associated with virtually any other subgenre of hip-hop, or may also make music that falls outside the subgenre entirely. Rather, the terms are defined by a direct engagement with [[LGBTQ culture]] in elements such as the lyrical themes or the artist's visual identity and presentation.\n\nArtists who have been labelled as part of the genre have, however, varied in their acceptance of the terminology. Some have supported the identification of a distinct phenomenon of \"LGBTQ hip-hop\" as an important tool for promoting LGBTQ visibility in popular music, while others have criticized it for trivializing their music as a \"niche\" interest that circumscribed their appeal to mainstream music fans.\n\nMany artists have contributed to the increased visibility and social acceptance of the LGBTQ community's presence in hip-hop music, most notably [[Frank Ocean]], who penned an open letter addressing his sexuality in 2012. There has also been an increased presence of LGBTQ supporters in the mainstream hip-hop community, including Eminem, [[Jay-Z]], [[Murs (rapper)|Murs]], [[Kanye West]], [[XXXTentacion]], [[Jack Harlow]], [[Kendrick Lamar]], [[Macklemore]], and [[Ryan Lewis]].",
  "top_artists": [
    "Juba Kalamka"
  ]
}