{
  "description": "'''Loft jazz''' (or the '''loft scene''' or '''loft era''') was a cultural phenomenon that occurred in [[New York City]] during the mid-1970s. [[Gary Giddins]] described it as follows: \"[A] new coterie of avant-garde musicians took much of the jazz world by surprise... [T]hey interpreted the idea of freedom as the capacity to choose between all the realms of jazz, mixing and matching them not only with each other, but with old and new pop, R&B and rock, classical music and world music... [S]eemingly overnight new venues - in many instances, apartments or lofts (hence the phrase 'loft jazz') - opened shop to present their wares.\" According to Michael Heller, \"lofts were not an organization, nor a movement, nor an ideology, nor a genre, nor a neighborhood, nor a lineage of individuals. They were, instead, a meeting point, a locus for interaction.\" Heller stated that \"loft practices came to be defined by a number of key characteristics, including (1) low admission charges or suggested donations, (2) casual atmospheres that blurred the distinction between performer and audience, (3) ownership / administration by musicians, and (4) mixed-use spaces that combined both private living areas and public presentation space.\" \nRegarding the music played in these venues, Michael J. Agovino wrote: \"This was community music. Part of the point was that, free of the strictures of clubs, the music could be anything, go anywhere, go on for as long as it wanted.\" David Such stated that \"the cutting contests, personality cults, and vices that characterized the jazz scene of the 1940s and 1950s were mostly missing.\" The scene was reviewed and documented by Giddins, Peter Occhiogrosso of the [[SoHo Weekly News]], [[Amiri Baraka|Leroi Jones]], [[Robert Palmer (author/producer)|Robert Palmer]], and [[Stanley Crouch]].\n\nCoinciding with this activity was an influx of musicians from outside New York. Newcomers from Chicago included a group associated with the [[Association for the Advancement of Creative Musicians|AACM]]; these included [[Muhal Richard Abrams]], [[Anthony Braxton]], [[Kalaparusha Maurice McIntyre]], [[Lester Bowie]], [[Amina Claudine Myers]], [[Henry Threadgill]], [[Steve McCall (drummer)|Steve McCall]], [[Fred Hopkins]], [[Chico Freeman]], [[Malachi Thompson]], and [[George E. Lewis]]. Various members of the [[Black Artists Group]] came from St. Louis, including [[Charles \"Bobo\" Shaw]], [[Baikida Carroll]], [[Oliver Lake]], [[Julius Hemphill]], [[Hamiet Bluiett]], [[J. D. Parran]], and [[Joseph Bowie]]. Members of [[Horace Tapscott]]'s [[Union of God's Musicians and Artists Ascension|UGMAA]], such as [[Arthur Blythe]], [[David Murray (saxophonist)|David Murray]], and [[Butch Morris]], arrived from California. All of these, plus many local musicians, participated in the loft scene to some degree.\n\nImmediate predecessors to the loft scene were the establishment in the late 1960s of [[Ornette Coleman]]'s ''Artist House'', where he hosted musicians and dancers, and James DuBoise's ''Studio We''. However, the scene did not begin to flourish until 1972, when, in reaction to the relocation of the [[Newport Jazz Festival]] to New York, locally based musicians established a counter-festival called the New York Musicians' Jazz Festival (NYMJF), with music presented in parks, community centers, and lofts. One of the most influential lofts during this time was ''Studio Rivbea'', run by [[Sam Rivers (jazz musician)|Sam Rivers]] and his wife Bea. Other lofts included [[Rashied Ali]]'s ''Studio 77'', which became ''Ali's Alley'', ''Studio Infinity'', run by [[Stanley Crouch]] and [[David Murray (saxophonist)|David Murray]], ''[[Environ (Loft)|Environ]]'', run by [[John Fischer (pianist)|John Fischer]], the ''Ladies' Fort'', ''Studio WIS'', ''Firehouse Theater'', and ''Sunrise Studios''.\n\nMusically, loft jazz was in many ways a continuation of the [[free jazz]] and [[avant-garde jazz]] traditions inaugurated by [[John Coltrane]], [[Ornette Coleman]], [[Albert Ayler]], [[Pharoah Sanders]], [[Archie Shepp]], and [[Sun Ra]]. However, it didn't follow any one particular style or idiom. According to Scott Deveaux and [[Gary Giddins]], \"A critical byword of the Loft Era was 'eclecticism,' used to signal an enlightened approach to all styles of music.\" Few loft jazz musicians played continuously atonal or arhythmic music in the style of Coltrane's legendary albums [[Ascension (John Coltrane album)|''Ascension'']] and [[Om (John Coltrane album)|''Om'']]. They often combined conventional melodic elements with free jazz; used instruments less familiar to jazz, such as the bass saxophone, oboe and cello; and combined instruments in nontraditional formats, like the [[World Saxophone Quartet]], whose changing members used a variety of saxophones and flutes, usually without any rhythm section. Not surprisingly, most of the musicians rejected the term \"loft jazz\" as too confining and not representative of their diversity.\n\nThe loft scene began to decline in the late 1970s and early 1980s, mainly due to a steady rise in rents.",
  "last_revision_date": "2025-11-04T23:06:01Z",
  "mixes": [
    {
      "playlist": "PLeSNHq0EYOQjf_rZNNK_422dIXsS73gTn"
    }
  ],
  "top_artists": []
}