{
  "description": "A '''megamix''' is a [[remix]] containing multiple songs in rapid succession. It often features various artists. There may be only one [[Verse (popular music)|verse]] or even just a brief [[refrain|chorus]] of each song used, sometimes in addition to [[music sampling|sample]]s of the same or other songs. It is common to use different samples to maintain and sometimes even ridicule the original. To unify the songs together smoothly, a single [[backing track|backing beat]] may be added as background throughout the megamix, although this is not a must. This backing beat is kept basic so as to simplify [[audio mixing (recorded music)|mixing]] and to not compete with the music. These mixes are usually several minutes long at minimum, going up to a half-hour or an hour, or even more sometimes.\n\nAccording to author Eduardo Navas, megamixes are constructed with the same principles as [[medley (music)|medleys]], but differ in that while medleys typically utilise single bands to play the excerpted compositions, megamixes use DJ producers to sample recognisable sections of songs and then sequence them \"to create what is essentially an extended [[sound collage|collage]]: an electronic medley consisting of samples from pre-existing sources.\" The purpose of the megamix, he argues, is \"to present a musical collage riding on a uniting groove to create a type of [[pastiche (music)|pastiche]] that allows the listener to recall a whole time period and not necessarily one single artist or composition.\"\n\n[[Ultimix]] is known for \"flashback medleys,\" producing at least one or two every year based on popular songs of the year. Each is about 15 minutes long, usually with at least that many songs if not more.\n\n\"Album megamixes\" feature all tracks from a particular [[album]] edited and compiled into one continuous medley. The \"artist megamix\" is also popular, including songs spanning a musician's career, with prolific artists such as [[Michael Jackson]] having more than one, usually from different remixers. [[Duran Duran]] created a megamix single (\"[[Burning the Ground]]\") from their own hits for the 1989 greatest hits album ''[[Decade (Duran Duran album)|Decade]]''. Subsequently, artists such as [[GHV2 Megamix|Madonna]], [[Megamix (Britney Spears song)|Britney Spears]], and [[Janet Megamix 04|Janet Jackson]] have also released megamixes as singles in order to promote their [[greatest hits]] albums or in the latter's case, [[studio album]]. Many megamixes are [[Bootleg recording|bootleg]]s.",
  "top_artists": []
}