{
  "description": "The '''Morenada''' is an Andean folk dance whose origins is from Bolivia. This dance is practiced mainly in [[Bolivia]] as well as in [[Peru]]  and in recent years with Bolivian immigration in Chile, Argentina and other countries.\n\nMorenada is one of the most representative dances of Bolivian culture. This importance stands out for the dissemination of dance and music in the patron and civic festivals in different regions of the country. The morenada was declared Cultural Heritage of Bolivia in 2011, through Law No. 135, for its recognized importance at national and national level international. In turn, this dance is performed during the [[Carnaval de Oruro]], in honor of the Virgen del Socavón, declared a Masterpiece of the Oral and Intangible Heritage of Humanity by UNESCO. It can also be performed appreciate mainly in the [[Fiesta del Gran Poder]] of the city of [[La Paz]] also declared Intangible Cultural Heritage of Humanity by the same institution and in all the folkloric entrances that are held in most of the towns, localities, and in many of the neighborhoods of each of the cities of Bolivia ( in the city of La Paz there are at least 246 annual folkloric entries, in each of which the morenada is danced) .\n\nIn Peru, la morenada is a typical dance in the Peruvian highlands, in the Puno [[region]], and is part of the Feast of the Virgin of La Candelaria, Intangible Cultural Heritage of Humanity by UNESCO. It is also practiced and disseminated in the departments of Tacna and Moquegua due to the presence of Aymara population.\n\nIn [[Chile]], the morenada is practiced mainly in the ''Carnaval Internacional con la Fuerza del Sol'' in [[Arica]] and cultural organizations, the authorities and the Chilean population recognize and affirm that the morenada is a Bolivian dance of Bolivian origin.\n\nIn [[Argentina]] the morenada is danced in [[Buenos Aires]], mostly by the Bolivian Immigrant Community. The Argentine population states that the morenada is a Bolivian dance.",
  "last_revision_date": "2025-02-21T01:04:34Z",
  "mixes": [
    {
      "video": "A-pBrlHCWbw"
    }
  ],
  "top_artists": []
}