{
  "description": "Motown specialized in a type of soul music it referred to with the [[trademark]] \"The Motown sound\". Crafted with an ear towards pop appeal, the Motown sound typically featured [[tambourine]]s to accent the [[back beat]], prominent and often melodic electric bass guitar lines, distinctive [[Melody|melodic]] and [[Chord (music)|chord]] structures, and a [[Call and response (music)|call-and-response]] singing style that originated in [[gospel music]]. In 1971, [[Jon Landau]] wrote in ''[[Rolling Stone]]'' that the sound consisted of songs with simple structures but sophisticated melodies, along with a four-beat drum pattern, regular use of horns and strings, and \"a trebly style of mixing that relied heavily on electronic limiting and equalizing (boosting the high range frequencies) to give the overall product a distinctive sound, particularly effective for broadcast over AM radio\". Pop production techniques such as the use of orchestral string sections, charted horn sections, and carefully arranged background vocals were also used. Complex arrangements and elaborate, [[melisma]]tic vocal riffs were avoided. Motown producers believed steadfastly in the \"[[KISS principle]]\" (keep it simple, stupid).\n\nThe Motown production process has been described as factory-like. The Hitsville studios remained open and active 22 hours a day, and artists would often go on tour for weeks, come back to Detroit to record as many songs as possible, and then promptly go on tour again. Berry Gordy held quality control meetings every Friday morning, and used veto power to ensure that only the very best material and performances would be released. The test was that every new release needed to fit into a sequence of the top five selling pop singles of the week. Several tracks that later became critical and commercial favorites were initially rejected by Gordy, the two most notable being the Marvin Gaye songs \"[[I Heard It Through the Grapevine]]\" and \"[[What's Going On (song)|What's Going On]]\". In several cases, producers would rework tracks in hopes of eventually getting them approved at a later Friday morning meeting, as producer [[Norman Whitfield]] did with \"I Heard It Through the Grapevine\" and the Temptations' \"[[Ain't Too Proud to Beg]]\".\n\nMany of Motown's best-known songs, including all the early hits for [[the Supremes]], were written by the songwriting trio of [[Holland–Dozier–Holland]] ([[Lamont Dozier]] and brothers [[Brian Holland|Brian]] and [[Eddie Holland]]). Other important Motown producers and songwriters included [[Norman Whitfield]], [[William \"Mickey\" Stevenson]], [[Smokey Robinson]], [[Barrett Strong]], [[Ashford & Simpson|Nickolas Ashford & Valerie Simpson]], [[Frank Wilson (musician)|Frank Wilson]], [[Pam Sawyer|Pamela Sawyer]] & [[Gloria Jones]], James Dean & [[William Weatherspoon]], [[Johnny Bristol]], [[Harvey Fuqua]], [[Gil Askey]], [[Stevie Wonder]], and Gordy himself.\n\nThe style created by the Motown musicians was a major influence on several non-Motown artists of the mid-1960s, such as [[Dusty Springfield]] and [[the Foundations]]. In the United Kingdom, the Motown sound became the basis of the [[northern soul]] movement. Smokey Robinson said the Motown sound had little to do with Detroit:\n{{blockquote|People would listen to it, and they'd say, 'Aha, they use more bass. Or they use more drums.' Bullshit. When we were first successful with it, people were coming from Germany, France, Italy, Mobile, Alabama. From New York, Chicago, California. From ''everywhere''. Just to record in Detroit. They figured it was in the air, that if they came to Detroit and recorded on the freeway, they'd get the Motown sound. Listen, the Motown sound to me is ''not'' an audible sound. It's spiritual, and it comes from the people that make it happen. What other people didn't realize is that we just had one studio there, but we recorded in [[Chicago]], [[Nashville, Tennessee|Nashville]], New York, L.A.—almost every big city. And we still got the sound.<ref>Hirshey, Gerri (1994 [1984]). ''Nowhere to Run: The Story of Soul Music''. New York: Da Capo Press. p. 187. {{ISBN|0-306-80581-2}}.</ref>}}",
  "last_revision_date": "2025-12-07T21:10:18Z",
  "top_artists": [
    "Al Cleveland",
    "The Corporation (record production team)",
    "Gerry Rosenthal",
    "Caroline Redman Lusher",
    "Max Capote",
    "Diane Shaw",
    "Holland–Dozier–Holland"
  ]
}