{
  "description": "'''Mugham''' ({{langx|az|Muğam}}) or '''Mughamat''' ({{langx|az|Muğamat}}) is one of the many [[art music|classical]] compositions from [[Azerbaijan]], contrasting with [[tasnif]] and [[ashik]].\n\nIt is an art form that weds classical poetry and musical improvisation in specific local modes. Mugham is a modal system. Unlike Western modes, \"mugham\" modes are associated not only with scales but also with an orally transmitted collection of melodies and melodic fragments that performers use in the course of improvisation. Mugham is a compound composition of many parts. The choice of a particular mugham and a style of performance fits a specific event. The dramatic unfolding in performance is typically associated with increasing intensity and rising pitches, and a form of poetic-musical communication between performers and initiated listeners.\n\nThree major schools of mugham performance existed from the late 19th and early 20th centuries in the regions of Karabakh, [[Shirvan]], and Baku. The town of [[Shusha]] of [[Karabakh]], was particularly renowned for this art.\n\nA short selection of Azerbaijani mugham, played on the wind instrument [[balaban (instrument)|balaban]], was included among many cultural achievements of humanity on the [[Voyager Golden Record]], which was attached to the [[Voyager program|Voyager]] spacecraft to represent world music.\n\nIn 2003, [[UNESCO]] proclaimed Azerbaijani Mugham a [[Masterpieces of the Oral and Intangible Heritage of Humanity|\"Masterpiece of the Oral and Intangible Heritage of Humanity\"]]. It was added to the [[UNESCO Intangible Cultural Heritage Lists]] in 2008.",
  "last_revision_date": "2025-06-23T07:54:54Z",
  "mixes": [
    {
      "playlist": "PLFFmhKTLDKpH1OdnxuovmO03LzVXzQQ-2"
    }
  ],
  "top_artists": [
    "Alim Qasimov",
    "Aygun Kazimova",
    "Kamil Jalilov",
    "Huseyngulu Sarabski",
    "Bulbuljan",
    "Sadigjan",
    "Bahram Mansurov",
    "Farghana Qasimova",
    "Aghakhan Abdullayev",
    "Shakili Alasgar"
  ]
}