{
  "description": "Under Kim Il Sung's era, only ideologically correct music was allowed. [[Jazz]] in particular was considered out of bounds. Many artists however found their way around these limitations by writing ideologically correct lyrics while taking liberties with the score. Under Kim Jong Il, previously forbidden genres, even jazz, became permissible and encouraged.\n\nMany North Korean pop songs are usually performed by young female singers with an electric ensemble, percussionist, and accompanying singers and dancers. However, there are also male singers or a chorus in community or company pop bands. Some North Korean pop songs such as \"[[Whistle (North Korean song)|Whistle]]\"—set to the lyrics of North Korean poet [[Cho Ki-chon]]—have become popular in South Korea. Common lyrical themes include military might (\"We Shall Hold Bayonets More Firmly\", \"Look At Us!\", \"One Against a Hundred\"), economic production and thrift (\"The Joy of Bumper Harvest Overflows Amidst the Song of Mechanisation\", \"Attain the Cutting Edge (The [[Numerical control|CNC]] Song)\", \"I Also Raise Chickens\", \"Potato Pride\", \"[[Chollima]] on the Wing\"), patriotism (\"My Country Is the Best\", \"We Have Nothing To Envy\", \"[[Onwards Toward the Final Victory]]\") and glorification of the party and leaders (\"[[Where Are You, Dear General?]]\", \"[[No Motherland Without You]]\", \"[[Don't Ask My Name]]\", \"[[The General Uses Warp]]\", \"[[Footsteps (Ri Jong-o song)|Footsteps]]\"). Songs like \"We Are One\" and \"Reunification Rainbow\" sing of the hopes for [[Korean reunification]]. There are also songs with more casual themes, such as \"Women Are Flowers\" and \"Ballad of Gold Mountains\".\n\nIn 2012, North Korea's first major girl band, the [[Moranbong Band]], made its world debut. It is a group of about sixteen North Korean women (eleven instrumentalists and five singers) which was hand-selected by [[Kim Jong Un]].\n\nBBC radio disc jockey [[Andy Kershaw]] noted, on a visit to North Korea with [[Koryo Tours]] in 2003, that the only recordings available were by the pop singers [[Chon Hye-yong|Jon Hye-yong]], [[Kim Kwang-suk]], [[Jo Kum-hwa]] and [[Ri Pun-hui]], and the groups [[Wangjaesan Light Music Band]], the [[Mansudae Art Troupe]] and the [[Pochonbo Electronic Ensemble]], who play in a style Kershaw refers to as \"light instrumental with popular vocal\". There is also the [[State Symphony Orchestra of the Democratic People's Republic of Korea|State Symphony Orchestra]], the [[Sea of Blood Opera Company]], two choruses, an orchestra and an ensemble dedicated to [[Isang Yun]]'s compositions, all in Pyongyang. The [[Pyongyang Film Studios]] also produces many instrumental songs for its films, and several programs on [[Korean Central Television]] have music made and performed by the Central Radio and Television Orchestra.\n\nIn 2010, a [[brutal death metal]] group purporting to be from North Korea, called Red War (붉은전쟁), released a three-track demo online. However, as of 2014 the group are believed to be disbanded. Subsequent investigations revealed that Red War never actually existed. The project was later exposed as a [[hoax]], since the tracks attributed to Red War were in fact taken from a demo released in 1995 by the death metal band ''Amniorrehexis''. \n\nNonetheless, in 2025, a [[raw black metal]] act named 구룡 (Guryong) emerged, also claiming to originate from North Korea. \n\nThe metal music archive Spirit of Metal currently lists two bands that claim to originate from North Korea, Red War and the [[pornogrind]] band Teagirl.\n\nNorth Korean [[pop music]] is available for visitors to [[Pyongyang]] at the [[Koryo Hotel]] or [[Number One Department Store]], as well as gift shops in tourist destinations. International and Western music can be enjoyed by locals and tourists at the [[Grand People's Study House]], Pyongyang's central library.",
  "last_revision_date": "2025-10-15T06:55:55Z",
  "top_artists": [
    "Moranbong Band",
    "Military-First Girls",
    "Pochonbo Electronic Ensemble",
    "Wangjaesan Light Music Band",
    "Korean People's Army State Merited Chorus and Symphony Orchestra"
  ]
}