{
  "description": "'''Music hall''' is a type of British theatrical entertainment that was most popular from the early [[Victorian era]] until around [[World War I]]. It faded away after 1918 as the halls rebranded their entertainment as [[Variety show|variety]]. Perceptions of a distinction in Britain between bold and scandalous music hall entertainment and subsequent, more respectable variety entertainment differ. Music hall involved a mixture of popular songs, comedy, speciality acts, and variety entertainment. The term is derived from a type of theatre or venue in which such entertainment took place. In North America [[vaudeville]] was in some ways analogous to British music hall, featuring rousing songs and comic acts.\n\nOriginating in saloon bars within pubs during the 1830s, music hall entertainment became increasingly popular with audiences — so much so, that during the 1850s some public houses were demolished, and specialised music hall theatres developed in their place. These theatres were designed chiefly so that people could consume food and alcohol and smoke tobacco in the auditorium while the entertainment took place, with the cheapest seats located in the gallery. This differed from the conventional type of theatre, which seats the audience in stalls with a separate bar-room. Major music halls were based around London. Early examples included: the [[Canterbury Music Hall]] in [[Lambeth]], [[Wilton's Music Hall]] in [[London Borough of Tower Hamlets|Tower Hamlets]], and The Middlesex in [[Drury Lane]], otherwise known as the Old Mo. By the mid-19th century, the halls cried out for many new and catchy songs. As a result professional songwriters were enlisted to provide the music for a plethora of star performers, such as [[Marie Lloyd]], [[Dan Leno]], [[Little Tich]], and [[George Leybourne]]. All manner of other entertainment was performed: male and female impersonators, [[Lion comique|lions comiques]], mime artists and impressionists, trampoline acts, and comic pianists (such as [[John Orlando Parry]] and [[George Grossmith]]) were just a few of the many types of entertainments the audiences could expect to find over the next forty years.\n\nThe [[Music Hall Strike of 1907]] was an important industrial conflict. It was a dispute between artists and stage hands on one hand, and theatre managers on the other. The halls had recovered by the start of the First World War and were used to stage charity events in aid of the war effort. Music hall entertainment continued after the war, but became less popular due to upcoming [[jazz]], [[Swing music|swing]], and [[big-band]] dance music acts. Licensing restrictions had also changed, and [[Prohibition|drinking was banned]] from the auditorium. A new type of music hall entertainment had arrived, in the form of variety, and many music hall performers failed to make the transition. They were deemed old-fashioned, and with the closure of many halls, music hall entertainment ceased and modern-day variety began.",
  "last_revision_date": "2025-12-15T22:43:19Z",
  "mixes": [
    {
      "playlist": "PLNmjN_Y9Jqm0aM6T4HwE477zp-NbKzSXr"
    }
  ],
  "top_artists": [
    "Josephine Baker",
    "Bonzo Dog Doo-Dah Band",
    "Davy Jones (musician)",
    "The Scaffold",
    "Bert Lee",
    "R. P. Weston",
    "Wilson, Keppel and Betty",
    "The New Vaudeville Band",
    "Peter Skellern",
    "The Real Tuesday Weld"
  ]
}