{
  "description": "'''{{Lang|pt|Música popular brasileira|italic=no}}''' ({{IPA|pt|ˈmuzikɐ popuˈlaʁ bɾaziˈlejɾɐ}}, ''Brazilian Popular Music'') or '''MPB''' is a trend in post-[[bossa nova]] urban [[popular music]] in [[Brazil]] that revisits typical Brazilian styles such as [[samba]], [[samba-canção]] and [[Baião (music)|baião]] and other Brazilian regional music, combining them with foreign influences, such as [[jazz]] and [[rock music|rock]].\n\nThis movement has produced and is represented by many Brazilian artists, such as [[Jorge Ben Jor]], [[Caetano Veloso]], [[Gal Costa]], [[Djavan]], [[Novos Baianos]], [[Antônio Carlos Jobim|Tom Jobim]], [[Chico Buarque]], [[Belchior (singer)|Belchior]] and [[Elis Regina]], whose individual styles generated their own trends within the genre. The term often also describes any kind of music with Brazilian origins and \"voice and guitar style\" that arose in the late 1960s.\n\nVariations within MPB were the short-lived but influential artistic movement known as [[tropicália]], and the music of [[samba rock]].\n\nMPB songs are in part characterized by their harmonic complexity and their elaborate lyrics, which call back to a connection between Brazil's popular music and [[Brazilian poetry|poetry]] that has been culturally relevant since the 1920s. It also draws from themes from Brazil's [[Brazilian folk music|folk]] music as a part of an effort to create a musical style that reflected true Brazilian culture. During the 1970s, these qualities gave the style an intellectual prestige that made it more popular for listening as an art form rather than being used as music for dancing, further distinguishing it from other popular music of the time. However, this was not always the case, as demonstrated by music by artists such as Jorge Ben Jor, many of whose songs fall into the category of [[Dance music|dance]] music.\n\nMany of the albums on ''Rolling Stone Brazil''{{'}}s list of the 100 greatest Brazilian albums fall under the MPB style.",
  "last_revision_date": "2025-03-17T21:36:25Z",
  "mixes": [
    {
      "video": "VBLOdiZxk2A"
    }
  ],
  "top_artists": [
    "Hebe Camargo",
    "Gilberto Gil",
    "Caetano Veloso",
    "Roberto Carlos (singer)",
    "Milton Nascimento",
    "Erasmo Carlos",
    "Chico Buarque",
    "Ney Matogrosso",
    "Marisa Monte",
    "Maria Rita"
  ]
}