{
  "description": "'''National Socialist black metal''' (also known as '''NSBM''' or '''[[Nazism|Nazi]] black metal''') is a small movement within the [[black metal]] music genre that promotes [[neo-Nazism]],  [[neo-fascism]], and [[White supremacy|white supremacist]] ideologies. [[List of National Socialist black metal artists|NSBM artists]] typically combine neo-Nazi imagery and ideology with [[Modern Paganism#Ethnicity and region|ethnic European paganism]], [[Satanism]], or [[Occultism in Nazism|Nazi occultism]], and vehemently oppose [[Christianity]], [[Islam]] and [[Judaism]] from a [[Racialism|racialist]] viewpoint. According to [[Mattias Gardell]], NSBM musicians see their ideology as \"a logical extension of the political and spiritual dissidence inherent in black metal\". NSBM artists are a small minority within black metal. While many black-metallers boycott NSBM artists, others are indifferent or say they appreciate the music without supporting the musicians.{{sfn|Olson|2008|p=99}} Like [[Nazi punk]], Nazi black metal is not seen as a distinct genre, being \"distinguished only by ideology, not musical character\". \n\nNSBM artists do not always convey their political beliefs in their music, but may express their beliefs in interviews or imagery. Artists who hold [[Far-right politics|far-right]] beliefs but do not express them in their music are not considered NSBM by many black-metallers, but they may be considered NSBM by outsiders. War and catastrophe are common themes in black metal, and some bands have made references to [[Nazi Germany]] for [[shock value]], much like some [[punk rock]] and [[heavy metal music|heavy metal]] bands. \n\nThe emergence of NSBM in the mid 1990s is linked with the prominent [[Early Norwegian black metal scene|Norwegian black metal]] musician [[Varg Vikernes]]. After his imprisonment for church burning and murder, he developed his anti-Christian beliefs into an increasingly white nationalist and neo-Nazi form of [[Heathenry (new religious movement)|Heathenry]]. The first black metal bands to have neo-Nazi lyrics and imagery were German band [[Absurd (band)|Absurd]], and Polish bands [[Infernum]] and [[Graveland]]. In the United States, [[Grand Belial's Key]] and [[Judas Iscariot (band)|Judas Iscariot]] became involved in NSBM (the latter has since distanced themselves from the movement). As NSBM grew internationally, it started to overlap with existing [[White power music]] such as [[Rock Against Communism]], [[Nazi punk|hatecore]], and the far-right faction of [[Oi!]]. The neo-Nazi record label [[Resistance Records]], associated with the [[National Alliance (United States)|National Alliance]], started releasing NSBM albums and even purchased Vikernes' label Cymophane Records. In 2012, the NSBM [[Asgardsrei festival]] was established in [[Moscow]], Russia, and then in 2014 relocated to [[Kyiv]], Ukraine.",
  "top_artists": [
    "Rob Darken"
  ]
}