{
  "description": "'''Ndombolo''', also known as '''dombolo''', is a genre of [[dance music]] originating in the [[Democratic Republic of the Congo]]. Derived from [[soukous]] in the 1990s, with fast-paced hip-swaying dance rhythms, often accompanied by [[Beat (music)|upbeat]], [[Percussion instrument|percussion]]-driven music, the style became widespread in the mid-1990s and the subsequent decade, dominating dancefloors in [[Central Africa|central]], [[East Africa|eastern]], and [[West Africa|western Africa]]. It inspired [[Afrobeats|West African popular music]], [[coupé-décalé]], [[Kuduro]], and [[Sub-Saharan African music traditions|East African dance music]].\n\nMusically, ndombolo typically features lead and backing vocalists, electric guitars, drum kits, [[Synthesizer|synthesized]] and [[Music technology (electronic and digital)|digital sounds]], along with the [[atalaku]]—a [[master of ceremonies]] whose energetic chants and exhortations are central to the performance. Thematically, the lyrics often explore themes of human relations, marriage, courtship, trickery, disappointment, and [[Politics of the Democratic Republic of the Congo|Congolese sociopolitical culture]]. The accompanying dance style is marked by vigorous hip movements, synchronized leg and arm gestures, and a sensual performance style. The [[sebene]] serves as the genre's high-energy centerpiece, often overlaid with the atalaku's improvisational vocalizations. These impassioned vocalizations, often delivered in a frenetic and semi-improvised style, serve to elevate the intensity of the performance and incite greater engagement, creativity, and movement among dancers.\n\nThough the precise origins of ndombolo remain contested, some attribute its inception to dancer and choreographer Radja Kula in 1995, while others trace its rise to the influential Congolese band [[Wenge Musica]] in the late 1990s. Prominent figures who have shaped and popularized the genre include [[Papa Wemba]], [[Dany Engobo]], [[Koffi Olomide]], [[Werrason]], [[Awilo Longomba]], [[Quartier Latin International]], [[Defao|Général Defao]], [[Aurlus Mabélé]], [[Extra Musica]], [[Wenge Musica]], and [[Wenge Musica Maison Mère]].",
  "last_revision_date": "2025-09-15T11:20:17Z",
  "mixes": [
    {
      "video": "lwg3OFTG3sQ"
    }
  ],
  "top_artists": [
    "Diamond Platnumz",
    "Jessy Matador",
    "Fally Ipupa",
    "Gims",
    "Papa Wemba",
    "Koffi Olomide",
    "Werrason",
    "Ali Kiba",
    "Barbara Kanam",
    "Innoss'B"
  ]
}