{
  "description": "'''Neo soul''' (sometimes called [[progressive soul]]) is a genre of [[popular music]]. As a term, it was coined by music industry entrepreneur [[Kedar Massenburg]] during the late 1990s to market and describe a style of music that emerged from [[Soul music|soul]] and [[contemporary R&B]]. Heavily based in soul music, neo soul is distinguished by a less conventional sound than its contemporary R&B counterpart, with incorporated elements ranging from [[funk]], [[jazz fusion]], and [[Hip hop music|hip hop]], and to [[pop music|pop]], [[rock music|rock]], and [[electronic music]]. It has been noted by music writers for its traditional R&B influences, conscious-driven lyrics, and strong female presence.\n\nNeo soul developed during the 1980s and early 1990s, by Black-Americans in the United States, as a soul revival movement. It earned mainstream success during the 1990s, with the commercial and critical breakthroughs of several artists, including [[D'Angelo]], [[Maxwell (musician)|Maxwell]], [[Erykah Badu]], and [[Lauryn Hill]]. Their music was marketed as an alternative to the producer-driven, digitally approached R&B of the time, although many of them were ambivalent about the term.\n\nSince its initial mainstream popularity and impact on the sound of contemporary R&B, neo soul has been expanded and diversified musically through the works of both American and international artists. Its mainstream presence declined during the 2000s, although newer artists emerged through more [[independent music|independent]] means of marketing their music. In his book ''The Essential Neo Soul'' (2010), music journalist and culture critic Chris Campbell writes that, while the genre has been \"woefully misunderstood and its artists mis-marketed\", there is \"a historical and social relevance that validates its designation as the current face of alternative progressive soul music (in both underground and overground circles), complete with a distinct origin and developmental evolution\". According to [[Mark Anthony Neal]], \"neo-soul and its various incarnations has helped to redefine the boundaries and contours of black pop.\"",
  "top_artists": [
    "Mary J. Blige",
    "Common (rapper)",
    "John Legend",
    "Amy Winehouse",
    "Missy Elliott",
    "Erykah Badu",
    "Gnarls Barkley",
    "Tyler, the Creator",
    "Wyclef Jean",
    "D'Angelo"
  ]
}