{
  "description": "'''New Orleans hip hop''' represents a distinct regional style, profoundly rooted in the city's unique cultural heritage, particularly its rich [[African Americans|African American]] musical traditions. It stands as a significant cultural export of [[Louisiana]]. The dominant and most recognizable [[Music subgenre|subgenre]] within New Orleans hip hop is [[bounce music]], which emerged in the early 1990s. Bounce is characterized by its intensely [[Percussion instrument|percussive]], highly rhythmic, and dance-centric nature, often featuring [[Call and response (music)|call-and-response vocals]] and localized references.\n\nA notable duality exists in the perception and recognition of New Orleans hip hop: it is simultaneously a highly lucrative cultural export and a genre that has historically faced a degree of [[Social exclusion|marginalization]] within its own city's dominant cultural narrative and academic discourse. This has resulted in limitations concerning venue bookings, performance opportunities, and scholarly attention. The significant economic and outward-facing cultural value of [[New Orleans]] rap stands in contrast to its struggle for institutional and academic legitimacy locally. This suggests a disconnect between the commercial and external consumption of New Orleans hip hop versus its internal, local institutional and academic recognition.\n\nThis situation may stem from historical biases against [[Rapping|rap]] as a genre, particularly when associated with specific urban communities and addressing challenging societal issues. This persistent marginalization, despite economic success, underscores ongoing struggles for cultural legitimacy and recognition for contemporary African American art forms within historically traditional cultural centers. It highlights that commercial success does not automatically equate to full cultural acceptance or academic validation, thereby emphasizing the critical importance of initiatives like the [[New Orleans|NOLA]] Hip Hop Archive in addressing this documentation gap and ensuring these cultural contributions are properly preserved and acknowledged.",
  "last_revision_date": "2025-07-13T14:13:17Z",
  "mixes": [
    {
      "playlist": "PLFK9SMgFPIoAcmfUOS212r6abBlXrficB"
    }
  ],
  "top_artists": []
}