{
  "description": "'''New musick''' is a loosely defined style of music and series of articles published in the late 1970s by the British magazine ''[[Sounds (magazine)|Sounds]].'' New musick was originally coined after a meeting organized by ''Sounds'' editor [[Alan Lewis (music journalist)|Alan Lewis]] involving music journalists Jane Suck, Sandy Robertson and [[Jon Savage]] in October 1977. The meeting resulted in the group deciding to use \"New Musick\" as a marketing term for issues in November and December 1977, similar to \"[[New wave music|new wave]]\", which had previously been used for a series of ''Sounds'' articles entitled \"Images of the New Wave\". The term has been described by Savage as an early label for \"[[post-punk]]\" as well as a subsection of the genre.      \n\nNew musick was used as a term to describe several [[Experimental rock|experimental]], [[Avant-garde music|avant-garde]] and progressive developments being made in [[punk rock]]. Drawing influences from [[disco]], [[Dub music|dub]], [[reggae]], [[krautrock]] and [[electronic music]], particularly the use of [[Synthesizer|synthesizers]]. In November 1977, ''Sounds'' published their first issue on new musick which included editorials by Jane Suck and Jon Savage. Writers [[Simon Reynolds]], David Buckley, David Wilkinson, Mimi Haddon and Theo Cateforis cite Savage's editorial as the starting point for \"post-punk\" as a musical genre. The editorial was followed by several new musick articles by other ''Sounds'' writers, including Suck, Robertson, [[Vivien Goldman]], Davitt Sigerson, Dave Fudger and Steven Lavers.       \n\nThe British press quickly adopted the label, sparking ideological conflicts among music critics regarding new musick undermining the [[Authenticity in art|authenticity]] of the original punk movement through its incorporation of more progressive, intellectual, and artistic influences. Much of the pushback was rooted in the strong hostility the punk scene held toward electronic music, disco, [[Art rock|art]] and [[progressive rock]]. This resulted in the scene fracturing into several distinct categories such as \"[[power pop]],\" \"[[Mod revival|mod renewal]],\" \"futurist,\" and \"[[new punk]]\" (or \"real punk\"). By the end of the decade, new musick was replaced by \"new wave\" and \"post-punk\" interchangeably in the UK.",
  "last_revision_date": "2025-11-21T07:50:52Z",
  "mixes": {
    "help_reason": null
  },
  "top_artists": []
}