{
  "description": "The '''new wave of British heavy metal''' (often abbreviated as '''NWOBHM''') was a nationwide musical movement that began in England in the mid-1970s and achieved international attention by the early 1980s. Editor [[Alan Lewis (music journalist)|Alan Lewis]] coined the term for an article by [[Geoff Barton]] in a May 1979 issue of the British music newspaper ''[[Sounds (magazine)|Sounds]]'' to describe the emergence of [[heavy metal music|heavy metal]] bands in the mid-to-late 1970s, as [[punk rock]] declined amid the dominance of [[new wave music]].\n\nAlthough encompassing diverse styles inherited from rock music, the music of the NWOBHM is best remembered for infusing earlier heavy metal with the intensity of punk rock to produce fast and aggressive songs. The [[DIY ethic|DIY]] attitude of the NWOBHM bands led to raw-sounding, self-produced recordings and a proliferation of [[independent record label]]s. Song lyrics were usually about [[escapism|escapist]] themes, such as mythology, fantasy, horror, and the rock 'n' roll lifestyle.\n\nThe NWOBHM began as an [[underground culture|underground]] phenomenon growing in parallel to punk and largely ignored by the media. Promotion by ''Sounds'' and rock DJ [[Neal Kay]] moved it into public consciousness and toward radio airplay, recognition, and success in the UK. Its musicians and fans were largely young, white, working-class men who suffered the hardships of unemployment after the [[1973–75 recession]]. As a reaction to their bleak reality, they then created a community separate from mainstream society to enjoy each other's company and their favourite loud music. The NWOBHM was criticised as being local media hype for mostly talentless musicians. Nonetheless, it generated a renewal in the genre of heavy metal music and furthered the progress of the [[heavy metal subculture]], whose updated behavioural and visual codes were quickly adopted by metal fans worldwide after the spread of the music to [[continental Europe]], North America and Japan.\n\nBy some estimates, the movement spawned as many as a thousand heavy metal bands. Only a few survived the advent of [[MTV]] and the rise of the more commercial [[glam metal]] in the second half of the 1980s. [[Iron Maiden]] and [[Def Leppard]] became superstars; [[Motörhead]] and [[Saxon (band)|Saxon]] also had considerable success. Other groups, such as [[Diamond Head (English band)|Diamond Head]], [[Venom (band)|Venom]], and [[Raven (British band)|Raven]], had more limited chart success, but influenced the successful [[extreme metal]] subgenres of the mid-to-late 1980s and 1990s. Many bands from the NWOBHM reunited in the 2000s and remained active through live performances and new studio albums.",
  "last_revision_date": "2025-12-19T16:37:33Z",
  "mixes": [
    {
      "playlist": "PLFBZT3CIdFxLSxT8AJUkbeobHxcsXDj98"
    }
  ],
  "top_artists": [
    "Tokyo Blade",
    "Tytan (band)",
    "Atomkraft",
    "Holocaust (band)",
    "Savage (band)",
    "Glasgow (band)",
    "Mournblade (band)",
    "Virtue (band)",
    "Bleak House (band)",
    "Airforce (band)"
  ]
}