{
  "description": "The '''''nueva ola''''' ([[Spanish language|Spanish]] for \"new wave\") was a [[cultural phenomenon]] that took place in several [[Hispanic America|Hispanic American]] countries between the late 1950s and the mid-to-late 1960s, linked to the spread of new musical styles aimed at young people—such as [[Pop music|pop]], [[rock and roll]] and the [[Twist (dance)|twist]]—which \"constituted the fundamental channels for the transformation of consumption, leisure, and youth fashions\" of the time.  It was a regional manifestation of a phenomenon occurring in much of the [[Western world]]: the emergence of a new [[Market segmentation|market segment]] made up of young people with their own habits and shared codes that set them apart from their parents' generation.{{sfn|Manzano|2017|p=116}} In countries such as Argentina, young people were introduced to rock and roll music through films like ''[[Blackboard Jungle]]'' (1955) and ''[[Rock Around the Clock]]'' (1956)—both featuring music by [[Bill Haley & His Comets]]—and quickly adopted it as one of the traits identifying them as an independent social group, along with the use of [[blue jeans]] (locally \"''vaqueros''\").{{sfn|Manzano|2017|p=142}} The ''nueva ola'' was not a homogeneous musical style but encompassed a wide range of genres, including rock and roll, pop, [[surf rock]], [[Romantic ballad|romantic ballads]] and even [[Latin American music]] such as [[bolero]] and [[cumbia]], constituting a musical scene in which artists, record buyers, record labels, and mass media interacted.  \n\nNoticing the growing popularity of American rock and roll and pop among young audiences and the commercial potential of adapting them into Spanish, multinational labels—mainly [[RCA Victor]] and [[Columbia Records]]—promoted the ''nueva ola'' in countries such as Argentina, Chile, Mexico and Peru, creating a new set of [[Teen idol|teen idols]] while relying on the expansion of mass media, especially radio and television. The figure of these new youth idols followed an international pattern, analogous to the [[yé-yé]] phenomenon in France, as well as the cases of [[Rita Pavone]] in Italy, [[Petula Clark]] in England, the [[Dúo Dinámico]] in Spain and [[Roberto Carlos (singer)|Roberto Carlos]] with the ''[[Jovem Guarda]]'' in Brazil, among others. In fact, much of the repertoire of ''nueva ola'' performers consisted of versions of American and European hits. Although presented as a phenomenon of cultural modernization for youth, the ''nueva ola'' promoted [[family values]] and [[traditional gender roles]], omitting the rebellious potential of rock and roll and creating a \"softened\" version, something similar to what had also occurred in the United States and Europe.{{sfn|Manzano|2017|pp=130–131}}\n\nIn Argentina—the main promoter of the ''nueva ola'' in South America and the country where the term was coined—the epitome of the phenomenon was ''El Club del Clan'' (1962–1964),{{sfn|Manzano|2017|p=141}} a successful television program that launched the country's first teen idols, including [[Violeta Rivas]], Johnny Tedesco, [[Raúl Lavié]], Jolly Land, [[Chico Novarro]], and especially [[Palito Ortega]], the most popular of the group. The ''nueva ola'' also had an important presence in Chile, with performers such as [[Buddy Richard]], Danny Chilean, Los Red Juniors, Luis Dimas, José Alfredo Fuentes, Fresia Soto and [[Cecilia Pantoja|Cecilia]], who in 1965 won the [[Viña del Mar Festival]]. In Colombia, the movement was also known as \"go-gó\" and \"ye-yé,\" promoted by producers Carlos Pinzón and [[Alfonso Lizarazo]], and reinforced through a local version of ''El Club del Clan''. In Peru, some of the best-known idols included Pepe Miranda, Gustavo \"Hit\" Moreno, Pepe Cipolla and Joe Danova, although the label ''nueva ola'' also encompassed groups that would later be considered by Peruvian rock historians as outside the phenomenon, such as [[Los Saicos]] and Los Shain's.",
  "last_revision_date": "2025-09-18T03:13:21Z",
  "mixes": [
    {
      "video": "jN9Wdm1umWM"
    }
  ],
  "top_artists": [
    "Salvatore Adamo",
    "Los Iracundos",
    "Buddy Richard",
    "Peter Rock (musician)",
    "Los Mockers",
    "Los Gatos Salvajes",
    "Los Vikings"
  ]
}