{
  "description": "'''Peking opera''', or '''Beijing opera''' ({{zh|c=京劇|p=Jīngjù}}), is the dominant form of [[Chinese opera]], which combines instrumental music, vocal performance, mime, martial arts, dance and acrobatics. It arose in [[Beijing]] in the mid-[[Qing dynasty]] (1644–1912) and became fully developed and recognized by the mid-19th century. The form was extremely popular in the Qing court and has come to be regarded as one of the cultural treasures of China. Major performance troupes are based in Beijing, [[Tianjin]] and [[Shanghai]]. The art form is also preserved in [[Taiwan]], where it is also known as {{lang|zh-Latn|Guójù}} ({{zh|t=國劇 |l=National opera}}). It has also spread to other regions such as the [[United States]] and [[Japan]].\n\nPeking opera features four main role types, ''[[Sheng role|sheng]]'' (gentlemen), ''[[dan role|dan]]'' (women), ''[[jing role|jing]]'' (rough men), and ''[[chou role|chou]]'' (clowns). Performing troupes often have several of each variety, as well as numerous secondary and tertiary performers. With their elaborate and colorful costumes, performers are the only focal points on Peking opera characteristically sparse stage. They use the skills of speech, song, dance and combat in movements that are symbolic and suggestive, rather than realistic. Above all else, the skill of performers is evaluated according to the beauty of their movements. Performers also adhere to a variety of stylistic conventions that help audiences navigate the plot of the production. The layers of meaning within each movement must be expressed in time with music. The music of Peking opera can be divided into the {{lang|zh-Latn|xīpí}} ({{lang|zh|西皮}}) and {{lang|zh-Latn|èrhuáng}} ({{lang|zh-hans|二黄}}) styles. Melodies include [[aria]]s, fixed-tune melodies and [[Percussion instrument|percussion]] patterns. The repertoire of Peking opera includes over 1,400 works, which are based on [[Chinese history]], [[Chinese folklore|folklore]] and, increasingly, contemporary life.\n\nTraditional Peking opera was denounced as \"feudalistic\" and \"bourgeois\" during the [[Cultural Revolution]] (1966–1976) and replaced mostly with the [[revolutionary opera]]s until the period's end. After the Cultural Revolution, these transformations were largely undone. In recent years, Peking opera has responded to sagging audience numbers by attempting reforms, including improving performance quality, adapting new performance elements, shortening works, and performing new and original plays.",
  "last_revision_date": "2026-01-24T16:31:40Z",
  "mixes": [
    {
      "playlist": "PLDCI2Wz2e2pJHEiQVHNP5iLARUnQWPP5Y"
    }
  ],
  "top_artists": [
    "China National Peking Opera Company",
    "Li Yugang",
    "Meng Guanglu",
    "Qi Shu Fang"
  ]
}