{
  "description": "'''Plunderphonics''' is a [[music genre]] in which tracks are constructed by [[sampling (music)|sampling]] recognizable musical works. The term was [[Neologism|coined]] by composer [[John Oswald (composer)|John Oswald]] in 1985 in his essay \"Plunderphonics, or Audio Piracy as a Compositional Prerogative\", and eventually explicitly defined in the liner notes of his ''[[Grayfolded]]'' album. Plunderphonics is a form of [[sound collage]]. Oswald has described it as a referential and self-conscious practice which interrogates notions of [[originality]] and [[identity (philosophy)|identity]].\n\nAlthough the concept of plunderphonics is broad, in practice there are many common themes used in what is normally called plunderphonic music. This includes heavy [[sampling (music)|sampling]] of [[educational film]]s of the 1950s, [[news]] reports, [[Radio programming|radio shows]], or anything with trained vocal [[announcer]]s. Oswald's contributions to this genre rarely used these materials, the exception being his [[Rapping|rap]]-like 1975 track \"Power\", which combined a [[Led Zeppelin]] instrumental with a sermon of a Southern US evangelist.\n\nThe process of [[Sampling (music)|sampling]] other sources is found in various [[genre]]s (notably [[Hip hop music|hip-hop]] and especially [[turntablism]]), but in plunderphonic works, the sampled material is often the only sound used. These samples are usually uncleared and sometimes result in legal action being taken due to [[copyright]] infringement. Some plunderphonic [[artist]]s use their work to protest what they consider to be overly restrictive copyright laws. Many plunderphonic artists claim their use of other artists' materials falls under the [[fair use]] doctrine.\n\nDevelopment of the process is when creative musicians plunder an original track and overlay new material and sounds on top until the original piece is masked and then removed, though often using scales and beats. It is a studio-based technique used by such groups as the American experimental band [[the Residents]] (who used Beatles tracks), and other noted exponents including [[DJ Shadow]], [[808 State]] and [[the Avalanches]].",
  "top_artists": [
    "Girl Talk (musician)",
    "Yegor Letov",
    "The Avalanches",
    "Oneohtrix Point Never",
    "Negativland",
    "The Go! Team",
    "The Caretaker (musician)",
    "Shitmat",
    "V/Vm",
    "Pogo (musician)"
  ]
}