{
  "description": "'''Power pop''' (also typeset as '''powerpop''') is a subgenre of [[rock music]] and form of [[pop rock]]{{sfn|Borack|2007|p=8}} based on the early music of bands such as [[the Who]], [[the Beatles]], [[the Beach Boys]], and [[the Byrds]]. It typically incorporates melodic [[hook (music)|hooks]], vocal harmonies, an energetic performance, and cheerful-sounding music underpinned by a sense of yearning, longing, despair, or self-empowerment. The sound is primarily rooted in [[pop music|pop]] and [[rock music|rock]] traditions of the early-to-mid 1960s, although some artists have occasionally drawn from later styles such as [[punk rock|punk]], [[new wave music|new wave]], [[glam rock]], [[Pub rock (United Kingdom)|pub rock]], [[college rock]], and [[neo-psychedelia]]. \n\nOriginating in the 1960s, power pop developed mainly among American musicians who [[came of age]] during the [[British Invasion]]. Many of these young musicians wished to retain the \"teenage innocence\" of pop and rebelled against newer forms of rock music that were thought to be pretentious and inaccessible. The term was coined in 1967 by the Who guitarist and songwriter [[Pete Townshend]] to describe his band's style of music. However, power pop became more widely identified with later acts of the 1970s who sought to revive [[Beatlesque|Beatles-style pop]].\n\nEarly 1970s releases by [[Badfinger]], the [[Raspberries (band)|Raspberries]], and [[Todd Rundgren]] are sometimes credited with solidifying the power pop sound into a recognizable genre. Power pop reached its commercial peak during the rise of punk and new wave in the late 1970s, with [[Cheap Trick]], [[the Knack]], [[the Romantics]], [[Nick Lowe]], [[Dave Edmunds]], and [[Dwight Twilley]] among those enjoying the most success. After a popular and critical backlash to the genre's biggest hit, \"[[My Sharona]]\" (the Knack, 1979), record companies generally stopped signing power pop groups, and most of the 1970s bands broke up in the early 1980s.\n\nOver subsequent decades, power pop continued with modest commercial success while also remaining a frequent object of derision among some critics and musicians. The 1990s saw a new wave of [[alternative rock|alternative]] bands that were drawn to 1960s artists because of the 1980s music they had influenced. Although not as successful as their predecessors, [[Jellyfish (band)|Jellyfish]], [[the Posies]], [[Redd Kross]], [[Teenage Fanclub]], and [[Material Issue]] were critical and cult favorites. In the mid-1990s, an offshoot genre that combined power pop-style harmonies with uptempo punk rock, dubbed \"[[pop-punk]]\", reached mainstream popularity."
}