{
  "description": "'''Progressive rock''' (shortened as '''prog rock''' or simply '''prog''') is a broad [[genre]] of [[rock music]]{{sfn|Martin|1998|pp=71–75}} that primarily developed in the United Kingdom through the mid- to late 1960s, peaking in the early-to-mid-1970s. Initially termed \"[[progressive pop]]\", the style emerged from [[psychedelic music|psychedelic]] bands who abandoned standard [[pop music|pop]] or [[Rock_Music|rock]] traditions in favour of [[Instrumentation (music)|instrumental]] and [[Composition (music)|compositional]] techniques more commonly associated with [[jazz]], [[folk music|folk]], or [[classical music]], while retaining the instrumentation typical of [[rock music]]. Additional elements contributed to its \"[[progressive music|progressive]]\" label: lyrics were more poetic, technology was harnessed for new sounds, music approached the condition of \"[[art music|art]]\", and the studio, rather than the stage, [[Recording studio as an instrument|became the focus of musical activity]], which often involved creating music for listening rather than dancing.\n\nProgressive rock includes a fusion of styles, approaches and genres, and tends to be diverse and [[eclecticism in music|eclectic]]. Progressive rock is often associated with long solos, extended pieces, fantastic lyrics, grandiose stage sets and costumes, and an obsessive dedication to technical skill. While the genre is often cited for its merging of [[high culture]] and [[low culture]], few artists incorporated classical themes in their work to a significant degree, and only a handful of groups, such as [[Emerson, Lake & Palmer]] and [[Renaissance (band)|Renaissance]], intentionally emulated or referenced classical music.\n\nThe genre arose during the mid-1960s. In the early-to-mid-1970s, progressive rock groups such as [[Yes (band)|Yes]] and [[Genesis (band)|Genesis]] experienced great worldwide success; in the late 1970s, progressive rock experienced declining popularity, from which it has never fully recovered.{{sfn|Hegarty|Halliwell|2011|p=1}} Music critics, who often labelled the style of progressive rock as \"pretentious\" and the sounds as \"pompous\" and \"overblown\", tended to be hostile towards the genre or to completely ignore it.{{sfn|Lucky|2000|p=7}} After the late 1970s, progressive rock fragmented into numerous forms. Some bands achieved commercial success well into the 1980s (albeit with changed lineups and more compact song structures) or crossed into [[symphonic pop]], [[arena rock]], or [[new wave music|new wave]].\n\nEarly groups who exhibited progressive features are retroactively described as \"[[proto-prog]]\". The [[Canterbury scene]], originating in the late 1960s, denotes a subset of progressive rock bands who emphasised the use of [[wind instrument]]s, complex chord changes and long improvisations. [[Rock in Opposition]], from the late 1970s, was more [[avant-garde]], and when combined with the Canterbury style, created [[avant-prog]]. In the 1980s, a new subgenre, [[neo-prog]], enjoyed some commercial success, although it was also accused of being derivative and lacking in innovation. [[Post-progressive]] draws upon newer developments in popular music and the avant-garde since the mid-1970s.",
  "last_revision_date": "2025-06-15T07:26:35Z",
  "mixes": [
    {
      "video": "kh1ufeangzo",
      "note": "With thanks to [https://cytricacidart.carrd.co/ CytricAcid], who gave me a very detailed list of artists, albums, and general pointers, and whose advice I wish I could fully capture here."
    }
  ],
  "top_artists": [
    "Siddharta (band)",
    "Pink Floyd",
    "Frank Zappa",
    "Peter Gabriel",
    "Rush (band)",
    "Phil Collins",
    "Genesis (band)",
    "Yes (band)",
    "Muse (band)",
    "King Crimson"
  ]
}