{
  "description": "'''Proibidão''' ({{IPA|pt|pɾo.ibiˈdɐ̃w̃|lang}}), which literally translates to \"strongly prohibited\" or \"heavily forbidden\", is a subgenre of [[funk carioca]] music originating from the [[favela]]s of [[Rio de Janeiro]] where it began in the early 1990s as a parallel phenomenon to the growth of drug gangs in the many slums of the city. The drug gangs sponsored DJs and [[baile funk]]s in the favelas they controlled to spread respect and love for their gang as well as hate to the other gangs. The music that resulted is proibidão.\n\nProibidão is characterized as a raw mix of live funk vocals and [[Miami bass]] structures.  The explicit lyrics typically promote the gang the MC is affiliated with, crime, drug use, and violence. Each drug gang sponsors their own baile funk at their own favela(s), which results in a unique sound that distinguishes each MC, and by extension, each gang.\n\nThe highly territorial nature of the gangs has made proibidão an extremely localized form of funk in Rio de Janeiro.  Moreover, in Brazil, it is against the law to promote crime in song lyrics which makes most proibidão songs illegal to perform or broadcast through radio (hence the name \"proibidão\"). These two factors seldom allow proibidão to be heard beyond the live performances in favela.\n\nOne particularly powerful gang, the [[Comando Vermelho]] ([[Portuguese language|Portuguese]] for ''Red Command'') has given poor youths free girls, drinks, and entertainment at their dances, hoping to engrain a positive image of drug-dealing and gang membership to Rio youths. In Red Command released CDs, their gang sign, a CV, sits across the label, representing the community and the gang instead of the artists. The Red Command's influence was best shown in 1990, when William Santos de Souza and Duda, the \"Kings of Rio rap\" at the time, released a track entitled, \"Rap do Borel\" shouting out to a gang-controlled favela in Rio. No gang better represents Proibidão than the Commando Vermelho.\n\nOther gangs also have renowned songs. For example, the gang [[Amigos dos Amigos]] ([[Portuguese language|Portuguese]] for ‘’Friends of Friends’’) is known for \"A.D.A do Chuck\", featuring MC Cruel. Another Funk emcee, MC Colibri, was very successful with erotic funk, but he has also already made music for the [[Terceiro Comando Puro]].\n\nProibidão has some very important implications for the acquisition of social space in Rio. For the gangs and drug lords, it represents a form of musical expression that corresponds to territorial dominance. In effect, when these gangs host their particular bailes, they assert their authority over rival gangs and state law enforcement. Since Proibidão elicits the criminal lifestyle and habitual drug use which characterize its performers, police naturally attempt to stop the bailes and the correlative spread of Proibidão. Thus, when myriad bailes do subsist each week, despite the efforts of state programs like D.R.E (Divisão de Repressão à Entorpecentes or [[Division of the Repression Against Drugs]])  to stop them, it is a palpable win for the gangs. In addition to just hosting these bailes, the gangs recruit urban youth and advertise their daily struggle, which makes the favela bailes a crucial social space in which gangs can conduct business.",
  "last_revision_date": "2025-03-12T04:38:28Z",
  "mixes": [
    {
      "playlist": "PLa9yusKe6yrev8L_4JOmsD53Os4iH3QT8"
    }
  ],
  "top_artists": []
}