{
  "description": "'''Psychedelic rock''' is a [[subgenre]] of [[rock music]] that originally emerged during the mid-1960s, inspired by [[psychedelia|psychedelic]] culture and primarily centered around the influence of [[Psychoactive drug|psychoactive]] and [[Hallucinogen|hallucinogenic]] drugs. The music incorporated new electronic [[sound effect]]s and recording techniques, extended instrumental solos, and improvisation. Many psychedelic groups differ in style with the label often applied spuriously.{{sfn|Hicks|2000|p=63}}\n\nOriginating in the mid-1960s among British and American musicians, the sound of psychedelic rock invokes three core effects of [[LSD]]: [[depersonalization]], dechronicization (the bending of time), and dynamization (when fixed, ordinary objects dissolve into moving, dancing structures), all of which detach the user from everyday reality.{{sfn|Hicks|2000|p=63}} Musically, the effects may be represented via novelty studio tricks, [[electronic music|electronic]] or non-Western instrumentation, disjunctive song structures, and extended instrumental segments.{{sfn|Hicks|2000|pp=63–66}} Some of the earlier 1960s psychedelic rock musicians were based in [[contemporary folk music|folk]], [[jazz]], and the [[blues]], while others showcased an explicit [[Indian classical]] influence called \"[[raga rock]]\". In the 1960s, there existed two main variants of the genre: the more whimsical, surrealist British psychedelia and the harder American West Coast \"[[acid rock]]\". While \"acid rock\" is sometimes deployed interchangeably with the term \"psychedelic rock\", it also refers more specifically to the heavier, harder, and more extreme ends of the genre.\n\nThe peak years of psychedelic rock were between 1967 and 1969, with milestone events including the 1967 [[Summer of Love]] and the 1969 [[Woodstock Festival]], spearheading an international phenomena that birthed a widespread [[Counterculture of the 1960s|counterculture]] and the [[Hippie|hippie movement]] before declining as changing attitudes, the loss of some key individuals, and a back-to-basics approach led surviving performers to move into new musical areas. The genre bridged the transition from early blues and folk-based rock to [[progressive rock]] and [[hard rock]], and as a result contributed to the development of sub-genres such as [[heavy metal music|heavy metal]]. Since the late 1970s it has been revived in various forms of [[neo-psychedelia]].\n\n{{toclimit|4}}",
  "last_revision_date": "2025-12-18T12:53:49Z",
  "mixes": [
    {
      "video": "tg--8NDbD90"
    }
  ],
  "top_artists": [
    "Pink Floyd",
    "The Doors",
    "Psychic TV",
    "Janis Joplin",
    "Cream (band)",
    "Santana (band)",
    "Jefferson Airplane",
    "Arctic Monkeys",
    "Roger Waters",
    "Jim Morrison"
  ]
}