{
  "description": "'''Puerto Rican hip-hop''' or '''Puerto Rican rap''' (also referred to as '''rap'''/'''hip-hop''' locally or '''hip-hop en Español''' in Spanish) is an [[underground music|underground]] subgenre of [[hip-hop]] music and [[conscious hip-hop]] that originated in [[Puerto Rico]]. At its peak in the late 1980s and early 1990s, it was one of the most popular styles of underground music in Puerto Rico sold by the [[mixtape]]. Puerto Rican hip-hop during its ascension in the late 1980s, and even during its earliest form, explored and touched on taboo and non-taboo societal themes in Puerto Rico like drug abuse, rising crime, governmental corruption, STDs, and sexual abuse. Due to its local relative niche and factors early on in the 1990s, it did not experience as much commercial success on par as other more popular Latin contemporary music such as [[reggaeton]].\n\nThe first ever Puerto Rican hip-hop song to go on the local radio, TV, and [[Phonograph record|vinyl]] oficially was the single \"Las Drogas Matan\" (1987) by [[D-Squad]] (Don Figgaro) and DJ Baron Lopez. However, it wasn't the first Puerto Rican hip-hop song as earlier artists had pioneered it a biennium before. [[Vico C]] is the pioneer of Puerto Rican hip-hop. He was also the first to pioneer the modern [[Urbano music|urbano]] genre, [[reggaeton]], with \"Bomba Para Afincar\" from his hip-hop album ''[[Hispanic Soul]]'' circa 1991. Vico C set the first ever Puerto Rican hip-hop song with the making of \"El Rapeo del Vikingo\", recorded and distributed the same year, 1985, at 14 years old. Inspired by Run DMC and Sugar Hill, in 1984 he formalized his career by calling himself Vico, adding the 'C' just as a novelty. Although he had already gained popularity with [[Viernes 13]]' alongside Rubén DJ, it was with [[La Recta Final]] that he became the number-one rapper in Puerto Rico.",
  "last_revision_date": "2025-05-31T14:47:10Z",
  "mixes": [
    {
      "playlist": "PLHugNrX7qvy_XPhSddF8DccjM7bG0b5R1"
    }
  ],
  "top_artists": [
    "Vico C",
    "Lito & Polaco",
    "Master Joe & O.G. Black",
    "Mexicano 777",
    "PJ Sin Suela",
    "Ruben DJ"
  ]
}