{
  "description": "'''Punk rock''' (also known as simply '''punk''') is a [[rock music]] genre that emerged in the mid-1970s. Rooted in 1950s [[rock and roll]] and 1960s [[garage rock]], punk bands rejected the corporate nature of mainstream 1970s rock music. They typically produced short, fast-paced songs with hard-edged melodies and singing styles with stripped-down instrumentation. Punk rock lyrics often explore [[anti-establishment]] and [[Anti-authoritarianism|anti-authoritarian]] themes. Punk embraces a [[DIY ethic]]; many bands self-produce recordings and distribute them through [[independent record label|independent label]]s.\n\nThe term \"punk rock\" was previously used by American [[Music criticism|rock critics]] in the early 1970s to describe the mid-1960s garage bands. Certain late 1960s and early 1970s Detroit acts, such as [[MC5]] and [[Iggy and the Stooges]], and other bands from elsewhere created out-of-the-mainstream music that became highly influential on what was to come. [[Glam rock]] in the UK and [[the New York Dolls]] from New York have also been cited as key influences. Between 1974 and 1976, when the genre that became known as punk was developing, prominent acts included [[Television (band)|Television]], [[Patti Smith]], [[Richard Hell and the Voidoids]], and the [[Ramones]] in New York City; [[The Saints (Australian band)|the Saints]] in [[Brisbane punk rock|Brisbane]]; the [[Sex Pistols]], [[the Clash]], and [[The Damned (band)|the Damned]] in London, and the [[Buzzcocks]] in Manchester. By late 1976, punk had become a major cultural phenomenon in the UK. It gave rise to a [[punk subculture]] that expressed youthful rebellion through distinctive [[Punk fashion|styles of clothing]], such as T-shirts with deliberately offensive graphics, leather jackets, studded or spiked bands and jewelry, safety pins, and bondage and S&M clothes.\n\nIn 1977, the influence of the music and subculture spread worldwide. It took root in a wide range of local scenes that often rejected affiliation with the mainstream. In the late 1970s, punk experienced a second wave, when new acts that had not been active during its formative years adopted the style. By the early 1980s, faster and more aggressive subgenres, such as [[hardcore punk]] (e.g., [[Minor Threat]]), [[Oi!]] (e.g., [[Sham 69]]), [[street punk]] (e.g., [[the Exploited]]), and [[anarcho-punk]] (e.g., [[Crass]]), became some of the predominant modes of punk rock, while bands more similar in form to the first wave (e.g., [[X (American band)|X]], [[the Adicts]]) also flourished. Many musicians who identified with punk or were inspired by it went on to pursue other musical directions, giving rise to movements such as [[post-punk]], [[new wave music|new wave]], [[thrash metal]], and [[alternative rock]]. Following alternative rock's mainstream breakthrough in the 1990s with [[Nirvana (band)|Nirvana]], punk rock saw renewed major-label interest and mainstream appeal exemplified by the rise of the California bands [[Green Day]], [[Social Distortion]], [[Rancid (band)|Rancid]], [[the Offspring]], [[Bad Religion]], and [[NOFX]].\n\nThe anti-government stance and nihilistic impression of the future provided by capitalism united the punk scene in the 1970s in the United Kingdom as other bands emerged in the 70s and 80s like X-Ray Spex and Steel Pulse.",
  "last_revision_date": "2025-06-18T12:04:07Z",
  "mixes": [
    {
      "video": "Ih6TuqmIwcU"
    }
  ],
  "top_artists": [
    "Green Day",
    "The Clash",
    "Subb",
    "Nirvana (band)",
    "Sex Pistols",
    "Ramones",
    "Iggy Pop",
    "Elvis Costello",
    "Blink-182",
    "Patti Smith"
  ]
}