{
  "description": "'''Punta''' is an Afro-Indigenous dance and cultural music deeply rooted in the cultural traditions of the Garifuna of Honduras. It heavily incorporates [[West Africa]]n/[[Central Africa]]n drumming, the dance primarily of [[Angola]] and [[Congo]] origins. The music also includes Indigenous Kalingo and Spanish influences. In addition to [[Honduras]], Garifuna populations can be found in Guatemala (approximately 15,000 people), Belize (around 35,000 people), and Nicaragua (about 10,000 people). It is widely recognized as the national dance of Honduras, symbolizing resilience, identity, and pride. Punta has its origins on the Caribbean island of Saint Vincent and Honduras after its arrival to the Honduran department of Roatán in 1797, over 228 years ago where it developed blending Garifuna drums with piano, guitar and congas. Punta is a vibrant representation of the community's heritage. It is also referred to as Banguity or Bunda.\n\nThe Garífuna people trace their ancestry back to [[West Africa|West Africans]] who escaped slavery and [[Indigenous peoples of the Americas]]. Punta is used to reaffirm and express the struggle felt by the population's common heritage through cultural artforms such as dance and music; to highlight their strong sense of endurance; and reconnect to their ancestors. Besides [[Honduras]], punta can also be found in the following:  [[Belize]], [[Guatemala]], Saint Vincent and the Grenadines, and the [[United States]].\n\nLyrics may be in Garifuna, [[Belizean Kriol language|Kriol]], [[English language|English]] or [[Spanish language|Spanish]]. Most songs are performed in Garifuna or Spanish, and are often contemporary adaptations of traditional Garífuna songs. Being the most popular dance in Honduran culture, Punta is danced specifically at funerals, on beaches, and in parks. Punta is iconic of Garífuna legacy and modernity and can be seen as poetic folk art that connects older cultures and rhythms with new sounds. Chumba and hunguhungu, circular dances in triple rhythm, are often combined with punta.",
  "top_artists": [
    "Andy Palacio",
    "Aurelio Martínez"
  ]
}