{
  "description": "'''Rabiz''' or '''rabis''' ({{langx|hy|ռաբիզ}} or {{langx|hy|ռաբիս}}; ) is a genre of Armenian [[popular music]], distinguished by its lyrics and dance-oriented synthesized melodies in {{music|time|6|8}} time signature with elements of Armenian [[folk music]]. Rabiz first emerged in [[Yerevan]] in the 1970-80s and was often associated with Armenian migrants from [[Baku]], [[Ganja (city)|Ganja]], [[Tbilisi]] and rural regions of Armenia. Rabiz singers are with few exceptions male. More recently, rabiz songs have been augmented with heavier arrangements and [[electronic dance music]] elements in their instrumentation.\n\nThough the singers and their audience primarily refer to rabiz as a music genre, the term is also used broadly to refer to a certain type of [[subculture]] with its particular fashion, [[Russian language|Russian]]-derived [[slang]], and lifestyle. The genre has received criticism from various music critics due to its perceived similarities to Middle Eastern music. Prominent performers of the genre include [[Aram Asatryan]], [[Tatul Avoyan]] (known by the mononym Tatul), and Hayk Ghevondyan (known as [[Spitakci Hayko]] or more commonly by the mononym Hayko).\n\n{{blockquote|The musical language of the rabiz, being a blend of several musical traditions (primarily Armenian national music, called ''[[ashug]]''. [Bardic-style] and Eastern in the style of the makam [classical court music]), it is marked by delicate Eastern harmony and an abundance of melisinas, which allow the musician to achieve the desired effect by purely musical means.<ref>{{cite book|title=Soviet anthropology and archeology: Volume 29|year=1990|publisher=International Arts and Sciences Press|page=41}}</ref> }}\n\nSome performances of rabiz music are characterized by [[code-switching]] in which rabiz performers such as Mingichauri Samo ([[Samvel Avanesyan]]) and Spitakci Hayko (Hayk Ghevondyan) – reminiscent of similarly multilingual pieces by [[Ashik|ashughs]] such as [[Sayat-Nova]] – improvise simultaneously in different languages such as [[Armenian language|Armenian]], [[Kurdish languages|Kurdish]] or [[Russian language|Russian]].\n\nOutside of Armenia, rabiz also enjoys popularity in the [[Armenian diaspora]], particularly in [[Russia]] and [[Los Angeles]], [[California]]. Many of the performers of the genre are now greatly popular with Armenian diaspora listeners as well."
}