{
  "description": "'''''Radif''''' ({{langx|fa|ردیف}}, {{lit|order}}) is a collection of many old [[Melody type|melodic figures]] preserved through many generations by oral tradition. It organizes the [[melody|melodies]] in a number of different [[Tonality|tonal]] spaces called ''[[dastgāh]]''. The [[Persian traditional music|traditional music]] of [[Iran]] is based on the ''[[radif]]'', which is a collection of old melodies that have been handed down by the masters to the students through the generations. Over time, each master's own interpretation has shaped and added new melodies to this collection, which may bear the master's name.\n\nThe preservation of these melodies greatly depended on each successive generation's memory and mastery, since the interpretive origin of this music was expressed only through the oral tradition.\n\nTo learn and absorb the essence of the ''radif'', many years of repetition and practice are required. A master of the ''radif'' must internalize it so completely to be able to perform any part of it at any given time.\n\nThe ''radif'' contains several different ''dastgāhs'' which are distinguished from each other by their relationship of [[Interval (music)|note intervals]] and the form of the movement of the melodies within them. A ''dastgāh'' portrays a specific sonic space. A ''dastgāh'' may contain approximately 10 to 30 {{lang|far|[[gousheh]]s}} (\"melodies\"). The principal {{lang|far|goushehs}} of the ''dastgāh'' specify the different [[Scale (music)|scales]] within that ''dastgāh''. The [[Musical note|note]], upon which the {{lang|far|gousheh}} is based and often is the center of the {{lang|far|gousheh}}, is called the ''shahed''. The ''shahed'' moves when we modulate between principal {{lang|far|goushehs}}, and this movement creates a new sonic space. [[Rhythm]] in these melodies takes three different forms: symmetric, asymmetric (lang), and free form. The rhythm is greatly influenced by the rhythm and meter of [[Iran|Persian]] poetry. The instrumental and vocal ''radif'' is different from the rhythmical point of view; however, their melodic structures are the same.\n\nThe ''radifs'' for [[tar (string instrument)|tar]] are one of the most famous ''radifs'' associated, with many old melodies collected that include 20–40 {{lang|far|goushehs}} in each ''dastgāh''.\n\nThe ''radifs'' of [[Mirza Hossein-Qoli]] and [[Mirza Abdollah]] are the oldest ''radifs'' that are still in use for many students who wish to carry on learning [[Persian traditional music|Persian music]]. It is very famous as it consisted of many melodies collected from that time and before.\n\nMany of the melodies were changed by Mirza Gholi and some kept same to the composer's desire, but the evidence is small to suggest melodies were changed or not, but due to ''radif'' being passed down through [[oral tradition]] (not in notation) we cannot state whether melodies were changed as we cannot compare notations or audios, but due to the mutations in music through oral transfer it is obvious.\n\nOne of the most notable [[Tar (string instrument)|tar]] players and repertoire of Mirza Hossien Gholi's ''radif'' was Ostad [[Ali-Akbar Shahnazi]], who was the son of Mirza Hossien Gholi and was the first tar player to record the long ''radif'' memorized by heart. His work is still used by many Masters and are now some directions which are followed by many tar players. Of course, beginner-intermediate students will not be able to follow his works on audio due to the level at which it was performed at, so not much will be understood, but a Tar Master can expect to use it and re-focus on what was forgotten in his teachings at lesson with students. This can minimize mutations and keep the ''radif'' in line.\n\nThe ''radif'' of [[Mirza Abdollah]] was published in notation by [[Jean During]] in 1970s based on Nour Ali Boroumand, who recorded the ''radif'' by heart. On the other hand, the ''radif'' of [[Mirza Hossein-Qoli]] was first published in [[Musical notation|notation]] by [[Dariush Pirniakan]] in 2001. Though the ''radif'' is not popular with many young students it still is the constitute and basis of Persian music. It can be related to Classical music of western music that is not much popular, but forms the basis of Western Music."
}