{
  "description": "'''Rock music in Australia''', also known as '''Oz rock''', '''Australian rock''', and '''Aussie rock''', has a rich history, rooted in an appreciation of various [[Rock music|rock]] genres originating in the United States and Britain, and to a lesser extent, in continental Europe and Africa. Australian rock has also contributed to the development of some of these genres, as well as having its own unique [[Australiana]] sound with [[Pub rock (Australia)|pub rock]] and its [[Indigenous Australian music|Indigenous music]].\n\nFrom 1955 to 1975, three distinct \"waves\" of Australian rock occurred. The first wave was from 1955 to 1963 and was influenced by American and British styles with local variants provided by artists such as [[Johnny O'Keefe]], who had a hit with \"[[Wild One (Johnny O'Keefe song)|Wild One]]\", which appeared in July 1958. Late in that stage, clean-cut acts, which featured on TV's ''[[Bandstand (Australia)|Bandstand]]'' and toured as the \"Bandstand family\", were representing local music on the record charts. The second wave from 1964 to 1969 was directly influenced by [[the Beatles]] and their tour of the country in June 1964. Two major acts from that era are [[the Easybeats]] and [[Bee Gees]]. A weekly magazine, ''[[Go-Set]]'', which was published from 1966 to 1974 and aimed at teenagers and twenty-year-olds, quickly became the most influential and popular music-related publication of the period. The third wave from 1970 to 1975, with the advent of pub rock, was typified by early exponents, [[Billy Thorpe and the Aztecs]], [[Blackfeather]], and [[Buffalo (band)|Buffalo]]. Internationally, [[AC/DC]] started as a pub rock group in November 1973 and became one of the most well-known Australian rock bands, with more than 71 million sales in the US alone by 2014. Beginning in that era was ''[[Countdown (Australian TV series)|Countdown]]'', which was a popular music TV program on national broadcaster [[Australian Broadcasting Corporation|ABC]] and ran from November 1974 until July 1987.\n\nAfter 1975, Australian rock began to diversify, including local contributors to [[Punk rock in Australia|punk]] and [[Australian indie rock|indie rock]] styles. By the 1980s [[baby boomer]] acts were prominent, which included [[John Farnham]], whose album ''[[Whispering Jack]]'' (October 1986) peaked at [[Number-one albums of 1986 (Australia)|number one]] on the Australian charts for 25 weeks and was certified 24x [[List of music recording sales certifications#Albums|platinum]] indicating shipment of over 1.68 million copies—the highest by any Australian artist. Also in that decade and the next, Indigenous rock groups such as [[Yothu Yindi]] and [[Warumpi Band]] achieved wider recognition.",
  "last_revision_date": "2025-08-18T04:54:26Z",
  "mixes": [
    {
      "playlist": "PLtm4bnQvH8VTt-3OwTj4fo1HdhlNuqs4z"
    }
  ],
  "top_artists": [
    "Paul Kelly (Australian musician)",
    "Daddy Cool (band)",
    "Tony Currenti",
    "John Williamson (singer)",
    "Weddings Parties Anything",
    "Murray Cook",
    "Paul Dempsey",
    "Kev Carmody",
    "Chris Bailey (musician, born 1950)",
    "Screamfeeder"
  ]
}