{
  "description": "A '''sea shanty''', '''shanty''', '''chantey''', or '''chanty''' ({{IPAc-en|'|ʃ|ae|n|t|i:}}) is a genre of traditional [[Folk music|folk song]] that was once commonly sung as a [[work song]] to accompany rhythmical labor aboard large [[Merchant vessel|merchant]] [[Sailing ship|sailing vessels]]. The term ''shanty'' most accurately refers to a specific style of work song belonging to this historical [[Musical repertoire|repertoire]]. However, in recent, popular usage, the scope of its definition is sometimes expanded to admit a wider range of repertoire and characteristics, or to refer to a \"maritime work song\" in general.\n\nFrom Latin ''cantare'' via French ''chanter'', the word ''shanty'' emerged in the mid-19th century in reference to an appreciably distinct genre of work song, developed especially on merchant vessels, that had come to prominence in the decades prior to the [[American Civil War]]. Shanty songs functioned to synchronize and thereby optimize labor, in what had then become larger vessels having smaller crews and operating on stricter schedules. The practice of singing shanties eventually became ubiquitous internationally and throughout the era of wind-driven [[Packet ship|packet]] and [[clipper ship]]s.\n\nShanties had antecedents in the working chants of British and other national maritime traditions, such as those sung while manually loading vessels with cotton in ports of the [[southern United States]]. Shanty repertoire borrowed from the contemporary popular music enjoyed by sailors, including [[Minstrel show|minstrel music]], popular [[March (music)|marches]], and land-based [[Folk music|folk songs]], which were then adapted to suit musical forms matching the various labor tasks required to operate a sailing ship. Such tasks, which usually required a coordinated group effort in either a pulling or pushing action, included weighing [[anchor]] and setting [[sail]].\n\nThe shanty genre was typified by flexible lyrical forms, which in practice provided for much [[improvisation]] and the ability to lengthen or shorten a song to match the circumstances. Its hallmark was [[Call and response (music)|call and response]], performed between a [[Solo (music)|soloist]] and the rest of the workers in chorus. The leader, called the ''shantyman'', was appreciated for his piquant language, lyrical wit, and strong voice. Shanties were sung without instrumental [[accompaniment]] and, historically speaking, they were only sung in work-based rather than entertainment-oriented contexts. Although most prominent in English, shanties have been created in or translated into other European languages.\n\nThe switch to [[Steamboat|steam-powered ships]] and the use of machines for shipboard tasks by the end of the 19th century meant that shanties gradually ceased to serve a practical function. Their use as work songs became negligible in the first half of the 20th century. Information about shanties was preserved by veteran [[sailors]] and [[folklorist]] song-collectors, and their written and [[Audio recording|audio-recorded]] work provided resources that would later support a revival in singing shanties as a land-based leisure activity. Commercial musical recordings, popular literature, and other media, especially since the 1920s, have inspired interest in shanties among {{linktext|landlubber}}s. Contemporary performances of these songs range from the \"traditional\" style of maritime music to various modern music genres.",
  "top_artists": [
    "Fisherman's Friends",
    "Nathan Evans (singer)",
    "Dan Zanes",
    "Santiano (band)",
    "Jim Radford",
    "The Dreadnoughts",
    "The Longest Johns",
    "Bounding Main",
    "Hank Cramer",
    "Captain Bogg and Salty"
  ]
}