{
  "description": "[[Simon Frith]], the British sociomusicologist and former rock critic, identifies the origins of the power ballad in the emotional singing of [[Soul music|soul]] artists, particularly [[Ray Charles]], and the adaptation of this style by performers such as [[Eric Burdon]], [[Tom Jones (singer)|Tom Jones]], and [[Joe Cocker]] to produce slow-tempo songs often building to a loud and emotive chorus backed by drums, electric guitars, and sometimes choirs. According to [[Charles Aaron]], power ballads came into existence in the early 1970s, when rock stars attempted to convey profound messages to audiences while retaining their \"macho rocker\" mystique. The [[hard rock]] power ballad typically expresses love or heartache through its lyrics, shifting into wordless intensity and emotional transcendence with heavy drumming and a distorted [[electric guitar]] solo representing the \"power\" in the power ballad.\n\nAaron argues that the hard rock power ballad broke into the mainstream of American consciousness in 1976 as FM radio gave a new lease of life to earlier impassioned songs such as [[Badfinger]]'s \"[[Without You (Badfinger song)|Without You]]\", [[Led Zeppelin]]'s \"[[Stairway to Heaven]]\" and [[Aerosmith]]'s \"[[Dream On (Aerosmith song)|Dream On]]\". [[The Carpenters]]' 1972 single \"[[Goodbye to Love]]\" has also been identified as a prototype of the power ballad, driven by the hard rock guitar sound of [[Tony Peluso]]. British [[Heavy metal music|heavy metal]] band [[Judas Priest]] wrote many power ballads, starting with \"[[Dreamer Deceiver]]\" and \"[[Beyond the Realms of Death]]\".\n\nAmerican rock band [[Styx (band)|Styx]] has been credited with releasing the first true power ballad, the song \"[[Lady (Styx song)|Lady]]\", in 1973. Its writer, [[Dennis DeYoung]] is called the \"father of the power ballad\". In 1976 the heavy metal band [[Kiss (band)|Kiss]] shocked their fans with the release of the ballad \n\"[[Beth (song)|Beth]]\", (essentially a solo track by [[Peter Criss]], produced by [[Bob Ezrin]] on which no other members of the band played). \n\nIn the 1980s, bands such as [[Journey (band)|Journey]] and [[REO Speedwagon]] contributed to the power ballad becoming a staple of hard rock performers who wanted to gain more radio airplay and satisfy their female audience members with a slower, more emotional love song.{{Citation needed|date=October 2023}} [[Mötley Crüe]] was one of the bands showcasing this style, with songs such as \"[[Home Sweet Home (Mötley Crüe song)|Home Sweet Home]]\" and \"[[You're All I Need (song)|You're All I Need]]\". Nearly every hard rock and [[glam metal]] band wrote at least one power ballad for each album, and record labels often released these as the album's second single.{{Citation needed|date=October 2023}} In 2008, ''[[Classic Rock (magazine)|Classic Rock]]'' critic Paul Elliott declared Journey's 1983 song \"[[Faithfully (song)|Faithfully]]\" to be \"the greatest power ballad of all time\".\n\nWhen [[grunge]] appeared as a counterpoint to the excesses of 1980s hard rock and glam metal, one of the distinctions of the grunge style was the absence of power ballads; however, some songs from this era such as \"Rooster\" by Alice in Chains (1992), which Ned Raggett described as the band's \"own particular approach\" to the style, and \"[[Black Hole Sun]]\" by Soundgarden (1994) have been described using this term, and songs in its subgenre [[post-grunge]] included ballads.{{citation needed|date=February 2023}}",
  "last_revision_date": "2026-01-22T12:04:45Z",
  "top_artists": [
    "Onewe",
    "Buzz (band)",
    "Awie",
    "Mulan Jameela",
    "Seventeen (Indonesian band)",
    "Zamani Ibrahim",
    "ADA Band",
    "Samsons",
    "M.C the Max",
    "Novia Kolopaking"
  ]
}