{
  "description": "'''Ska punk''' (also spelled '''ska-punk''') is a fusion genre that mixes [[ska]] music and [[punk rock]] music. Ska punk tends to feature [[brass instrument]]s, especially [[Horn (instrument)|horn]]s such as trumpets, trombones and woodwind instruments like saxophones, making the genre distinct from other forms of punk rock. It is closely tied to [[third wave ska]], which reached its zenith in the mid-1990s.\n\nBefore ska punk began, many ska bands and punk rock bands performed on the same bills. Some music groups from the late 1970s and early 1980s, such as [[the Clash]], the Deadbeats, [[the Specials]], [[the Beat (British band)|the Beat]], and [[Madness (band)|Madness]] fused characteristics of punk rock and ska, but many of these were punk bands playing an occasional ska-flavored song or ska bands with punk influences. During the late 1980s and early 1990s, ska-punk enjoyed its greatest success, heralded by bands such as [[Fishbone]], [[the Mighty Mighty Bosstones]], [[Sublime (band)|Sublime]], [[Less Than Jake]], and more.\n\nSka punk had significant mainstream success in the middle-to-late 1990s, with many bands topping pop and rock music charts. The best-selling ska punk record of the era was [[No Doubt]]'s ''[[Tragic Kingdom]]'', which was certified diamond by the [[Recording Industry Association of America|RIAA]] in 1999 and was certified diamond by [[Music Canada]] in 1997. By the early 2000s, many of the bands in ska punk had broken up, and the genre lost mainstream appeal, though it continued to have [[Underground music|underground]] popularity and featured a revival in the late 2010s with bands like [[The Interrupters (band)|the Interrupters]] returning to chart success, when their song \"She's Kerosene\" reached the top 5 on [[alternative rock|alternative]] and rock music charts in Canada and the US, as well as in the early 2020s with [[hyperpop]] duo [[100 gecs]] album ''[[10,000 gecs]]'' incorporating elements of ska punk to critical acclaim."
}