{
  "description": "'''Slowcore''',{{efn|name=Spelling differences}} also known as '''sadcore''', is a subgenre of [[indie rock]] characterised by its subdued tempos, minimalist instrumentation, and sombre vocal performances. Slowcore's influences are diverse, involving varying other genres, including [[folk rock]], [[alternative rock]], and [[dream pop]]. As a result of these contrasting stylistic directions, there is no definitive characterisation of the genre.\n\nThe history of slowcore began in the late-1980s, with several bands forming in reaction to the abrasive sounds of [[grunge]]. Slow rock music, with a pensive style inspired by genres such as [[singer-songwriter]] and [[contemporary folk|folk]], laid the groundwork for the genre in the early years and until the mid-1990s, when [[Low (band)|Low]] played a pivotal role in establishing slowcore as one of the era's [[microgenre]]s; however, despite their retrospective acclamation as slowcore pioneers, Low was not the first band to produce slowcore. [[Codeine (band)|Codeine]], [[Red House Painters]], and [[Bedhead (band)|Bedhead]] all released influential albums earlier that decade, while [[American Music Club]]{{emdash}}widely considered to be the genre's first act{{emdash}}formed in 1982. Regardless, the mellow and restrained sound of Low's debut album, ''[[I Could Live in Hope]]'' (1994), and their albums that followed over the next several years, came to define slowcore. [[Spain (band)|Spain]], [[Duster (band)|Duster]], and [[Ida (band)|Ida]], among others, all followed Low and furthered the reach of the genre, and by the 2000s, slowcore had a defined sound, even if it continued to lack obvious categorisation. Artists like [[Carissa's Wierd]], [[Jason Molina]], and Duster incorporated its archetypical sound in their music throughout the introductory years of the 21st century, while others, including [[Hope Sandoval & the Warm Inventions]], [[Grouper (musician)|Grouper]], and [[Sun Kil Moon]], were more experimental but remained within the genre's confines. Because of slowcore's broad interpretation, observers have described several other musicians and bands as slowcore, including those outside the genre.\n\nThe term \"slowcore\" derives from \"slow\", referring to the tempo and energy of the music, and \"-core\", which refers to a scene, style, or musical [[subgenre]]. \"Sadcore\" imitates similar etymology, and the names are used interchangeably. The term itself has an unclear origin, though sources suggest the use of \"slowcore\" started in the early 1990s. Scholars and bands alike have shown ambivalence towards the name, with some deeming it pejorative."
}