{
  "description": "'''Son cubano''' is a genre of music and dance that originated in the highlands of [[Oriente Province|eastern Cuba]] during the late 19th century. It is a [[Syncretism|syncretic]] genre that blends elements of Spanish and African origin. Among its fundamental Hispanic components are the vocal style, lyrical [[Metre (poetry)|metre]] and the primacy of the [[Tres (musical instrument)|tres]], derived from the [[Classical guitar|Spanish guitar]]. On the other hand, its characteristic [[clave (rhythm)|clave]] rhythm, [[call and response]] structure and percussion section ([[bongo drum|bongo]], [[maracas]], etc.) are all rooted in traditions of [[Bantu peoples|Bantu]] origin.\n\nAround 1909 the son reached [[Havana]], where the first recordings were made in 1917. This marked the start of its expansion throughout the island, becoming Cuba's most popular and influential genre. While early groups had between three and five members, during the 1920s the ''sexteto'' ([[sextet]]) became the genre's primary format. By the 1930s, many bands had incorporated a [[trumpet]], becoming ''septetos'', and in the 1940s a larger type of ensemble featuring [[congas]] and [[piano]] became the norm: the [[Conjunto#Cuban conjunto|conjunto]]. The son became one of the main ingredients in the jam sessions known as [[descarga]]s that flourished during the 1950s.\n\nThe international presence of the son can be traced back to the 1930s when many bands toured Europe and North America, leading to ballroom adaptations of the genre such as the American [[rhumba]]. Similarly, radio broadcasts of son became popular in West Africa and the Congos, leading to the development of hybrid genres such as [[Congolese rumba]]. In the 1960s, [[New York City|New York]]'s music scene prompted the rapid success of [[salsa music|salsa]], a combination of son and other Latin American styles primarily recorded by [[Puerto Ricans]]. While salsa achieved international popularity during the second half of the 20th century, in Cuba son evolved into other styles such as [[songo music|songo]] and [[timba]], the latter of which is sometimes known as \"Cuban salsa\".",
  "top_artists": [
    "Celia Cruz",
    "Johnny Pacheco",
    "Buena Vista Social Club",
    "Ray Barretto",
    "Ibrahim Ferrer",
    "Omara Portuondo",
    "Chano Pozo",
    "Sonora Matancera",
    "Eliades Ochoa",
    "Carlos \"Patato\" Valdes"
  ]
}