{
  "description": "'''Soul music''' is a [[popular music]] genre that originated in [[African-American culture|African-American]] [[African-American neighborhood|communities]] throughout the United States in the late 1950s and early 1960s. Catchy rhythms, stressed by handclaps and extemporaneous body movements, are an important hallmark of soul. Other characteristics are a [[Call and response (music)|call and response]] between the lead and [[Backing vocalist|backing vocalists]],  an especially tense vocal sound, and occasional [[Musical improvisation|improvisational]] additions, twirls, and auxiliary sounds. Soul music is known for reflecting African-American identity and stressing the importance of African-American culture.\n  \nSoul has its roots in African-American [[gospel music]] and [[rhythm and blues]], and primarily combines elements of gospel, R&B and [[jazz]].  The genre emerged from the power struggle to increase black Americans' awareness of their African ancestry, as a newfound consciousness led to the creation of music that boasted pride in being black. Soul music became popular for dancing and listening, and American record labels such as [[Motown]], [[Atlantic Records|Atlantic]] and [[Stax Records|Stax]] were influential in its  proliferation during the [[Civil Rights Movement|civil rights movement]]. Soul also became popular worldwide, directly influencing [[rock music]] and the [[music of Africa]]. It had a resurgence in the mid-to late 1990s with the subgenre [[neo soul]], which incorporated modern production elements and [[Hip hop music|hip hop]] influences.\n\nSoul music dominated the U.S. [[R&B charts]] in the 1960s, and many recordings crossed over into the pop charts in the United States, United Kingdom, and elsewhere. Many prominent soul artists, including [[Ray Charles]], [[Sam Cooke]], [[Otis Redding]], [[James Brown]], [[Aretha Franklin]], and various acts under the Motown label, such as [[The Supremes]] and [[The Temptations]], were highly influential in the genre's development and all gained widespread popularity during this time. By 1968, the soul music genre had begun to splinter. Some soul artists moved to [[funk]] music, while other singers and groups developed slicker, more sophisticated, and in some cases more socially conscious varieties. By the early 1970s, soul music had begun to absorb influences from [[psychedelic rock]] and [[progressive rock]], among other genres, leading to the creation of [[psychedelic soul]] and [[progressive soul]]. Prominent soul artists of this era include [[Marvin Gaye]], [[Jackson 5]], [[Stevie Wonder]], [[Curtis Mayfield]], [[Isaac Hayes]], [[Al Green]], and [[Bill Withers]]. [[Neo soul]], which adopted hip hop influences, emerged around 1994. \n\nOther subgenres of soul include the \"[[Motown (music style)|Motown sound]]\", a more rhythmic and [[pop music|pop]]-friendly  style that originated from the eponymous label; [[Southern soul]], a driving, energetic variety combining R&B with southern gospel music influences; [[Memphis soul]], a shimmering, sultry style; [[New Orleans soul]], which emerged from the rhythm and blues style; [[Chicago soul]], a lighter gospel-influenced sound; and [[Philadelphia soul]], a lush [[orchestral]] variety with [[doo-wop|doo-wop]]-inspired vocals.\nSoul music is a genre that evolved from African American popular music in the United States during the 1950s to the 1970s. It is deeply rooted in gospel and blues, characterized by intense vocal delivery, call-and-response patterns, and melisma. Soul music reinterpreted the sounds of earlier rhythm-and-blues pioneers like Chuck Berry and Ray Charles, and it was a return to African American musical roots after the emergence of rock and roll, which was seen as a white interpretation of rhythm and blues.\n\nThe style of soul music is marked by its emotional intensity and personal expression. It incorporates elements from gospel music, such as the use of church-rooted call-and-response and vocal techniques. Soul music also draws from blues, evident in its expressive and often improvisational vocal style. The genre was popularized by artists like Aretha Franklin, James Brown, and Otis Redding, who infused their music with themes of personal and social significance.\n\nSoul music also influenced and was influenced by other musical styles. The Motown sound, which is considered a form of soul music, had a lighter, more pop-oriented style, while Southern soul was rawer and more emotive. As the genre evolved, it contributed to the development of funk, disco, and hip-hop, with its emphasis on rhythm and groove becoming foundational to these later styles."
}