{
  "description": "'''Space music''', also called '''spacemusic''' or '''space ambient''', is a subgenre of [[ambient music]] and is described as \"tranquil, hypnotic and moving\". It is derived from [[new-age music]] and is associated with [[lounge music]], [[easy listening]], and [[elevator music]].\n\nAccording to [[Stephen Hill (broadcaster)|Stephen Hill]], co-founder of a radio show called ''[[Hearts of Space]]'', the term is used to describe music that evokes a feeling of contemplative spaciousness. Hill states that space music can range in character, the sonic texture of the music can be simple or complex, it can be instrumental or electronic, it may lack conventional melodic, harmonic, or rhythmic features, and may be less concerned with the formal compositional schemes associated with other styles of music. Hill proposes that space music can be found within a wide range of [[music genre|genres]]. Space music may have influences from [[Classical music|western classical]], [[World music|world]], [[Celtic music|Celtic]], [[traditional music|traditional]] and [[Experimental music|experimental]] music.\n\nHill believes that space music can evoke a \"continuum of spatial imagery and emotion\", which can be beneficial for introspection, and for developing, through a practice of ''deep listening'', an awareness of the spatiality of sound phenomenon. This type of [[psychonaut]]ic listening can produce a subtle trance-like state in certain individuals which can in turn lead to sensations of flying, floating, cruising, gliding, or hovering.\n\nHill states that some individuals use space music for both background enhancement and foreground listening, often with headphones, to enable states of relaxation, contemplation, inspiration, and generally peaceful expansive moods; it may promote health through [[Relaxation technique|relaxation]], atmospherics for [[Bodywork (alternative medicine)|bodywork]] therapies, and effectiveness of [[meditation]]. Space music appears in many film [[soundtrack]]s and is commonly played in [[planetarium]]s.\n\nAccording to Hill space music is an [[Eclecticism in music|eclectic]] music produced almost exclusively by [[independent label]]s and it occupies a small [[Niche market|niche]] in the marketplace, supported and enjoyed by a relatively small audience of loyal enthusiastic listeners.",
  "last_revision_date": "2025-10-27T19:49:57Z",
  "mixes": [
    {
      "video": "ADnxyLVVZUk"
    }
  ],
  "top_artists": [
    "Sun Ra",
    "Jean-Michel Jarre",
    "Ned Lagin",
    "Isao Tomita",
    "Graeme Norgate",
    "Billy Currie",
    "Michael Stearns",
    "Constance Demby",
    "Jonn Serrie",
    "Eloy Fritsch"
  ]
}