{
  "description": "'''Spouge''' is a style of [[Barbados|Barbadian]] popular music created by [[Jackie Opel]] in the 1960s. It is primarily a fusion of Jamaican [[ska]] with Trinidadian [[calypso music|calypso]], but is also influenced by a wide variety of musics from the British Isles and United States, including [[sea shanty|sea shanties]], hymns, and [[spiritual (music)|spiritual]]s. Spouge instrumentation originally consisted of [[cowbell (instrument)|cowbell]], bass guitar, trap set, and various other electronic and percussion instruments, later augmented by [[saxophone]], [[trombone]], and [[trumpet]]s. Of these, the cowbell and the guitar are widely seen as the most integral part of the instrumentation, and are said to reflect the African origin of much of Barbadian music.\n\nTwo different kinds of spouge were popular in the 1960s, ''raw spouge'' (''Draytons Two style'') and ''dragon spouge'' (''Cassius Clay style'').  The spouge industry grew immensely by the end of the 1970s, and produced popular stars such as [[The Escorts International]], [[Blue Rhythm Combo]], the [[Draytons Two]], [[The Troubadours (Barbados)|The Troubadours]], and [[Desmond Weekes]]. Desmond Weekes, the former lead singer of the Draytons Two, claims the 1973 album ''[[Raw Spouge]]'' to be \"the only 100 per cent spouge album ever produced\". The album topped the charts in a number of islands, including [[St. Kitts]], [[St. Lucia]], and [[Dominica]].\n\nIn 1950, Opel sang with a band at Coconut Creek Club, St. James, and his Jackie Wilson like voice soon made him popular. Opel appeared as a supporting act on some local shows with well-known overseas performers, and usually became the star performer as he vigorously performed every note and \"out shone\" the star. During this time, ska, the forerunner beat to reggae, was popular in Jamaica, and calypso was popular in Trinidad. Jackie Opel and his band The Troubadours developed the spouge beat as Barbados' answer to ska in Jamaica and calypso in Trinidad. Spouge became so popular that every local band and singer in Barbados and throughout the Caribbean recorded their music using the spouge beat.\n\nAfter six years, the art form declined. Today, very little spouge is played on the airwaves. Spouge is only played on Jackie Opel Day, Independence Day, Heroes Day, and Errol Barrow Day. Spouge has also declined for other reasons:\n\n#The man who created spouge, Jackie Opel, died in a car accident on March 9, 1970 at the age of 32.\n#The Barbadian media does not promote spouge to the extent that it can.{{citation needed|date=March 2022}}\n\nIn 2002, Caribbean Records Inc. released a CD entitled ''Vintage Spouge'' with hits on it such as \"Gimme Music\" by Mike Grosvenor, \"Any Day Now\" by Richard Stoute and a cover of [[Sam Cooke]]'s \"[[You Send Me]]\", sung by spouge creator Jackie Opel.\n\nIn 2024 \"Pure Spouge Gospel\" EP album was released which features five original songs written and performed by Lana Spooner-Jack in the Barbadian-owned genre Spouge. The music for the album was composed by mixing and mastering engineer Jeffrey Y. Grosvenor at his studio \"Edge Cliff\", in Gatineau, Quebec who added his own creativity by infusing African rhythms and Latin patterns. Each track on the album carries its own unique blend. The track \"Come and Buy (Isaiah 55)\" has a Meringue pattern that was altered to fit the Spouge rhythm; \"In the Same Boat\" has a Senagalese mbalax pattern. The congas are playing a Guaguancó pattern in \"Drop by Drop\"; and in the \"Christmas I Believe In\" track, the Spouge and the Cuban Bomba rhythms are played alternatively on the drum set. Very interesting combination! Of note, the song \"Singing Over Me\" is most likely the first Spouge song to be ever composed in the 3/4 time signature.",
  "last_revision_date": "2024-04-04T20:24:14Z",
  "mixes": [
    {
      "video": "47BeNJNQ7mM"
    }
  ],
  "top_artists": [
    "Draytons Two"
  ]
}