{
  "description": "'''Symphonic gothic metal''' was first pioneered by American band [[Saviour Machine]]. One of the first gothic metal bands to release a full album featuring \"beauty and the beast\" vocals, where [[death metal]] vocals are contrasted with clean female vocals, was the Norwegian [[Theatre of Tragedy]] in 1995. From then on after the departure of lead singer [[Liv Kristine]] in 2003, she and her future husband, [[Alexander Krull]], formed the symphonic metal band [[Leaves' Eyes]]. The band is one of the pioneers of the \"beauty and the beast\" vocal style. The contrasting styles of vocals are also sometimes performed by only one vocalist, an example of this being Ambre Vourvahis of [[Xandria]], combining and layering her clean (and occasionally operatic) vocals with her deep gutturals on the band's 2023 album ''[[The Wonders Still Awaiting]]''. Other bands, such as the Dutch [[Within Temptation]] in 1996, expanded on this approach. A debut album, ''[[Enter (Within Temptation album)|Enter]]'', was unveiled in the following year, followed shortly by an EP, ''[[The Dance (EP)|The Dance]]''. Both releases made use of the beauty-and-beast approach delivered by vocalists [[Sharon den Adel]] and [[Robert Westerholt]]. Their second full-length, ''[[Mother Earth (Within Temptation album)|Mother Earth]]'', was released in 2000 and dispensed entirely with the death metal vocals, instead \"relying solely on den Adel's majestic vocal ability\", apart from one [[B-side]] track that did not make the final album release. The album was a commercial success, with their lead single, \"[[Ice Queen (song)|Ice Queen]]\", topping the charts in Belgium and their native Netherlands. Their third album, ''[[The Silent Force]]'', arrived in 2004 as an \"ambitious project featuring a full orchestra and 80-voice choir accompanying the band\". The result was another commercial success across Europe and introduced \"the world of heavy guitars and female vocals\" to \"a mainstream audience\".\n\nWithin Temptation's brand of [[gothic metal]] combines \"the guitar-driven force of hard rock with the sweep and grandeur of symphonic music\". The critic Chad Bowar of [[About.com]] describes their style as \"the optimum balance\" between \"the melody and hooks of mainstream rock, the depth and complexity of classical music and the dark edge of gothic metal\". The commercial success of Within Temptation has since resulted in the emergence of a large number of other female-fronted gothic metal bands, particularly in the Netherlands. A typical example of their most symphonic sound can be heard in the songs \"Jillian (I'd give my Heart)\" and \"Our Solemn Hour\".\n\nAnother Dutch band in the symphonic gothic metal strain is [[After Forever]]. Their debut album, ''[[Prison of Desire]]'' in 2000, was \"a courageous, albeit flawed first study into an admittedly daunting undertaking: to wed heavy metal with progressive rock arrangements and classical music orchestration - then top it all off with equal parts gruesome cookie-monster vocals and a fully qualified opera singer\". Founding member, guitarist and vocalist [[Mark Jansen]] departed After Forever a few months after the release of their second album, ''[[Decipher (After Forever album)|Decipher]]''. Jansen would go on to form [[Epica (band)|Epica]], another Dutch band that performs a blend of gothic and symphonic metal. Their debut album, ''[[The Phantom Agony]]'', emerged in 2003 with music that combines Jansen's death grunts with the \"angelic tones of a classically trained [[soprano]], [[Simone Simons]], over a lush foundation of [[#Symphonic power metal|symphonic power metal]]\". The music of Epica has been described as combination of \"a dark, haunting gothic atmosphere with bombastic and symphonic music\". Like Within Temptation and After Forever, Epica has made use of an orchestra. Their 2007 album ''[[The Divine Conspiracy]]'' was a chart success in their home country.\n\nThis blend of symphonic and gothic metal has also been arrived at from the opposite direction. The band [[Nightwish]] from Finland began as a symphonic power metal act and introduced gothic elements on their 2004 album ''[[Once (Nightwish album)|Once]]'', particularly on the single \"[[Nemo (song)|Nemo]]\". They continued to mix their style of \"bombastic, symphonic and cinematic\" metal with a gothic atmosphere on their next album, ''[[Dark Passion Play]]'', in 2007. The Swedish group [[Therion (band)|Therion]] also introduced gothic elements to their brand of symphonic metal on their 2007 album ''[[Gothic Kabbalah]]''.",
  "last_revision_date": "2025-10-11T20:38:04Z",
  "top_artists": [
    "Saviour Machine",
    "Virgin Black",
    "Eric Clayton",
    "Magion (band)"
  ]
}