{
  "description": "'''Symphonic power metal''' refers to [[power metal]] bands that make extensive usage of keyboards, or instruments normally found in classical music, similar to symphonic metal. These additional elements are often used as key elements of the music when compared to regular power metal, contributing not only an extra layer to the music, but a greater variety of sound. Bands in this genre often feature clean vocals, with some bands adding relatively small quantities of screams or growls.\n\nThe first prototypical symphonic power metal song was \"[[Art of Life]]\", a twenty-nine-minute song performed by Japanese [[Heavy metal music|heavy metal]] band [[X Japan]] in 1993. A defining role for the style's development was played by Italian band [[Rhapsody of Fire]] since their groundbreaking 1997 debut, ''[[Legendary Tales]]'', first with a baroque approach influenced by [[Antonio Vivaldi|Vivaldi]] and [[Niccolò Paganini|Paganini]], and subsequently with a growing film-score-oriented turn employing full orchestras and choirs. The influence of symphonic and operatic music are equally audible in cognate bands [[Luca Turilli's Rhapsody]] and [[Turilli / Lione Rhapsody]]. Rhapsody's contributions to symphonic metal are best exemplified by short songs like \"Emerald Sword\", \"Dawn of Victory\" and \"Lamento Eroico\", and long suites such as \"Gargoyles, Angels of Darkness\", \"The Mystic Prophecy of the Demonknight\" and \"Erian's Mystical Rhymes\". Finnish band [[Nightwish]], who debuted the same year, also performed symphonic power metal, their style being well exemplified by songs like \"Wishmaster\" from the album ''[[Wishmaster (album)|Wishmaster]]'' and the rest of their discography until the year 2000. Since the album ''[[Century Child]]'', they gradually decreased their power metal influences, with songs like \"Ghost Love Score\" from the album ''[[Once (Nightwish album)|Once]]'', \"The Poet and the Pendulum\" from the album ''[[Dark Passion Play]]'' and \"The Greatest Show on Earth\" from the album ''[[Endless Forms Most Beautiful (album)|Endless Forms Most Beautiful]]'' as the best examples of their new course making a more extensive use of orchestral elements.\n\nGerman band [[Blind Guardian]] also introduced some symphonic elements in the album ''[[Nightfall in Middle-Earth]]'', although it wasn't until 2002 with [[A Night at the Opera (Blind Guardian album)|''A Night at the Opera'']] when they established their symphonic power metal style, mainly with the song \"And Then There Was Silence\". They gradually composed more and more symphonic songs such as \"Sacred Worlds\" and \"Wheel of Time\", both featured on the album ''[[At the Edge of Time]]'', and \"The Ninth Wave\", \"At the Edge of Time\", \"The Throne\" and \"Grand Parade\" from their latest album, ''[[Beyond the Red Mirror]]''. They also made orchestral versions of previously released songs like \"The Lord of the Rings\" and \"Theatre of Pain\", both included on the compilation album ''[[The Forgotten Tales]]''. Blind Guardian went deeper into symphonic music with the album ''[[Legacy of the Dark Lands]]'', a fully orchestral album composed by singer [[Hansi Kürsch]] and guitarist [[André Olbrich]] that kept the band's spirit but was credited to the Blind Guardian Twilight Orchestra, as Hansi was the only member of the band to perform on the album.\n\n<gallery mode=\"packed\" caption=\"Several of the most widely known symphonic power metal bands\">\nFile:Twilight Force Rockharz 2016 24.jpg|[[Twilight Force]]\nFile:Rhapsody Buenos Aires 2010.JPG|[[Rhapsody of Fire]]\nFile:Reinxeed.JPG|Majestica\nFile:Dark Moor.jpg|Dark Moor\nFile:20160806 Wacken Wacken Open Air Gloryhammer 0136.jpg|Gloryhammer\n</gallery>",
  "last_revision_date": "2025-07-18T04:02:41Z",
  "top_artists": [
    "Rhapsody of Fire",
    "Symfonia",
    "Oliver Palotai",
    "Avalon (Finnish band)",
    "Luca Turilli's Rhapsody",
    "Kasperi Heikkinen",
    "Fairyland (band)",
    "Luca Princiotta",
    "Twilight Force",
    "Nekrogoblikon"
  ]
}