{
  "description": "'''Traditional bluegrass''', as the name implies, emphasizes the traditional elements of [[bluegrass music]], and stands in contrast to [[progressive bluegrass]].  Traditional bluegrass musicians play folk songs, tunes with simple traditional chord progressions, and on [[acoustic instrument]]s of a type that were played by bluegrass pioneer [[Bill Monroe]] and his [[Blue Grass Boys]] band in the late 1940s.  Traditional bands may use their instruments in slightly different ways, for example by using multiple guitars or fiddles in a band.\n\nBluegrass music developed between 1939 and 1945, largely shaped by Bill Monroe and his Blue Grass Boys, with Monroe being the central figure in its creation. While the style is closely associated with Kentucky, many early bluegrass musicians hailed from other southern states, particularly Appalachia. Despite its global spread and evolving variations, bluegrass continues to maintain its ties to its southern and Appalachian roots.\n\nPopularized by the Monroe brothers from Kentucky, bluegrass music relies on acoustic stringed instruments like the fiddle, acoustic guitar, banjo, mandolin, and upright bass, often accompanied by a resonator guitar. Characterized by \"high lonesome sound\" vocal harmonies, it emphasizes traditional, sentimental songs. Each instrument plays a key role: the mandolin is a defining feature, the banjo is crucial for its signature sound, and the upright bass provides the deep foundation. Other instruments, such as the Dobro and fiddle, further contribute to the genre's distinctive style.\n\nIn some traditional bluegrass bands, the guitar rarely takes the lead, instead acting as a rhythm instrument, one notable exception being [[Gospel music|gospel-based songs]]. Melodies and lyrics tend to be simple, sometimes in the [[key of G]] or other keys, and a I-IV-V chord pattern is common.  Although traditional bluegrass performers do not use electrically amplified instruments, as used in other forms of popular music, it is common practice to \"[[microphone|mike]]\" acoustic instruments during stage performances before larger audiences.\n\nBluegrass music is often defined by its distinctive features, such as the three-finger banjo picking, smooth, bluesy fiddling, and high-pitched, tense vocal harmonies. While it traditionally relies on acoustic instruments and avoids electric bass and drums, these elements are now more commonly accepted. Originally set apart from mainstream country music due to its emphasis on nostalgia and rural myths, bluegrass has since incorporated influences from genres like country-western, western swing, folk-rock, and jazz.\n\nBill Monroe's mandolin playing style and Kenny Baker's fiddling set the standard for traditional bluegrass musicians on those instruments.  [[Earl Scruggs]] is recognized as the developer of bluegrass three finger style banjo playing.\n\nDespite bluegrass's association with rural Appalachia, a significant portion of its early history actually took place in urban settings. In the 1940s, bluegrass music emerged as a response to the experiences of people living between the country and the city. Over time, however, the genre became increasingly associated with an \"authentic\" rural identity. This shift in perception highlights the evolving cultural narrative surrounding bluegrass, with rural imagery becoming more dominant in popular portrayals of the genre's ideological divisions even among traditional bluegrass bands.\n\nThere are ideological divisions even among traditional bluegrass bands.  These divisions center on the longstanding debate about what constitutes \"Bluegrass Music\".  A few traditional bluegrass musicians do not consider progressive bluegrass to truly be \"bluegrass\", some going so far as to suggest bluegrass must be styled directly after Bill Monroe's bands.  However, stylistic divergences in traditional bluegrass generally center on which first generation bands from which contemporary musicians have drawn inspiration.  Examples include bands who sing in the [[Stanley Brothers]] tradition: [[Roy Lee Centers]], [[Larry Sparks]], Sammy Adkins, The Fields Bros, The Wilson Brothers, The [[Gillis Brothers]] and various local bands across the country.  Other bands followed [[Lester Flatt]], such as Willis Spears, Curley Seckler and Karl Shifflett.  [[Mac Wiseman]]'s \"crooning\" style of Bluegrass engendered [[Hylo Brown]] and Sid Campbell.  The [[Osborne Brothers]] have followers in Larry Stephenson as well as the Grascals.  Frank Necessary, Blue Maggie and Hud Hadley were strongly influenced by [[Jimmy Martin]].",
  "last_revision_date": "2025-12-15T23:16:51Z",
  "mixes": [
    {
      "video": "cJbXmiEYumk"
    }
  ],
  "top_artists": [
    "Russ Barenberg",
    "Leroy Drumm"
  ]
}