{
  "description": "'''Tropicália''' ({{IPA|pt|tɾopiˈkaʎɐ, tɾɔpiˈkaljɐ}}), also known as '''tropicalismo''' ({{IPA|pt|tɾopikɐˈlizmu, tɾɔpikaˈ-|}}), was a Brazilian [[art movement]] that arose in the late 1960s. It was characterized by the amalgamation of Brazilian genres—notably the union of the [[pop culture|popular]] and the [[avant-garde]], as well as the melding of Brazilian tradition and foreign traditions and styles. Today, tropicália is chiefly associated with the musical faction of the movement, which merged [[Music of Brazil|Brazilian]] and [[Music of Africa|African rhythms]] with British and American [[psychedelic music|psychedelia]] and [[pop rock]]. The movement also included works of film, theatre, and poetry.\n\nThe term tropicália (tropicalismo) has multiple connotations in that it played on images of Brazil being that of a \"tropical paradise\". Tropicalia was presented as a \"field for reflection on social history\". \nThe movement was begun by a group of musicians from [[Bahia]] notably [[Caetano Veloso]], [[Gilberto Gil]], [[Gal Costa]], [[Tom Zé]], and the poet-lyricist [[Torquato Neto]]. Later the group moved from [[Salvador, Bahia|Salvador]] (the capital of Bahia) to [[São Paulo]] where they met with collaborators [[Os Mutantes]] and [[Rogério Duprat]] among others. They went on to produce the 1968 album ''[[Tropicália: ou Panis et Circencis]]'', which served as the movement's manifesto.\n\nTropicália was not only an expression in analyzing and manipulating culture but also a mode of political expression. The tropicália movement came to fruition at a time when Brazil's [[Military dictatorship in Brazil|military dictatorship]] and left-wing ideas held distinct but prominent amounts of power simultaneously. The tropicalists' rejection of both sides' version of nationalism (the military's conservative patriotism and the ineffectual bourgeois anti-imperialism) was met with criticism and harassment.\n\nThe dissolution of the movement by the early 1970s gave rise to a new wave of soloists and groups identifying as “post-tropicalist”. The movement has inspired many artists nationally and internationally. Additionally, tropicalia continues to be a main feature in the original Bahian group and their fellows’ work.",
  "last_revision_date": "2025-06-15T21:01:47Z",
  "mixes": [
    {
      "playlist": "PLf3ZG1Crb_aUA9SyFuV0U6ErfSkw6PIST"
    }
  ],
  "top_artists": [
    "Gilberto Gil",
    "Caetano Veloso",
    "Os Mutantes",
    "Jorge Ben",
    "El Guincho",
    "Carwyn Ellis",
    "Novos Baianos",
    "Arnaldo Baptista",
    "Abe Vigoda (band)",
    "Quarteto em Cy"
  ]
}