{
  "description": "'''Trot''' ({{Korean|hangul=트로트|rr=teuroteu}}) or '''Ppongjjak''' ({{Korean|hangul=뽕짝}}) is a genre of Korean popular music, known for its use of repetitive rhythm and vocal inflections. Originating during the [[Korea under Japanese rule|Japanese occupation of Korea]] in the first half of the 20th century, trot was influenced by many genres of Korean, Japanese, American, and European music.\n\nTrot has been around for almost 100 years and its distinct singing style has been continuously evolving. Trot music developed in rhythms during Japanese colonial rule. After the liberation of the Korean peninsula and the [[Korean War]] (1950-1953), artists such as [[Lee Mi-Ja]], Choi Sook-ja, [[Bae Ho]], [[Nam Jin]], [[Na Hun-a]], [[Joo Hyun-mi]] and many others helped to make trot popular. With the rise of [[K-pop]] from the 1990s onwards, trot music lost some popularity and was viewed as more old-fashioned. However, from the 2000s onwards, young trot singers such as [[Jang Yoon-jeong (singer)|Jang Yoon-jeong]], [[Hong Jin-young]], K-pop singers such as [[Super Junior-T]], [[Daesung]], [[MJ (South Korean singer)|MJ]] and [[Lizzy (singer)|Lizzy]], renewed interest in the genre and popularised it among young listeners.\n\nAlthough the genre originated before the division of the Korean peninsula, it is actually now mainly sung in [[South Korea]]; the associated pop culture, together with nursery rhymes, new folk songs in [[North Korea]] were categorized as \"Enlightenment Period song\" (계몽기 가요). It is no longer composed as [[Propaganda through media|propaganda music]] has since displaced other musical forms.{{clarification needed |date=May 2024}} Those songs were only orally-recorded. It was intentionally revived during [[Kim Jung Il]] administration: in the late 2000s, [[Korean Central Television]] aired a TV program that introduced those \"Enlightenment songs\".",
  "last_revision_date": "2025-09-14T11:10:37Z",
  "mixes": [
    {
      "video": "9eBiI0KKHS4"
    }
  ],
  "top_artists": [
    "Lim Young-woong",
    "Leeteuk",
    "Kim Hee-chul",
    "Hong Jin-young",
    "Cho Yong-pil",
    "Tae Jin-ah",
    "Crayon Pop",
    "Young Tak",
    "Kim Ho-joong",
    "Jang Yoon-jeong (singer)"
  ]
}