{
  "description": "'''UK rap''', also known as '''British hip hop''' or '''UK hip hop''' or '''British rap''', is a [[music genre]] and culture that covers a variety of styles of [[hip hop music]] made in the [[United Kingdom]]. The development of UK rap was shaped by a distinct set of regional influences, slang, and grassroots movements that differentiated it from American hip hop.\nIt is generally classified as one of a number of styles of [[urban music|R&B/hip-hop]]. \n\nBritish hip hop can also be referred to as '''Brit-hop''', a term coined and popularised mainly by ''[[British Vogue]]'' magazine and the [[BBC]]. British hip hop was originally influenced by the [[Deejay (Jamaican)|dub/toasting]] introduced to the United Kingdom by Jamaican migrants in the 1950s–70s, who eventually developed uniquely influenced rapping (or speed-toasting) in order to match the rhythm of the ever-increasing pace and aggression of Jamaican-influenced [[Dub music|dub]] in the UK. \n\nToasting and [[Sound system (Jamaican)|soundsystem]] cultures were also influential in genres outside of hip hop that still included [[rapping]] – such as [[Grime (music genre)|grime]], [[Jungle music|jungle]], and [[UK garage]].\n\nIn 2003, ''[[The Times]]'' described British hip hop's broad-ranging approach:\n\n<blockquote>...\"UK hip-hop\" is a broad sonic church, encompassing anything made in Britain by musicians informed or inspired by hip-hop's possibilities, whose music is a response to the same stimuli that gave birth to rap in New York in the mid-Seventies.</blockquote>Although the underground scene was well established by the late 1980s, UK rap music saw little commercial success for several decades. Outside of a few exceptions such as [[Derek B]] and later the birth of [[Trip hop|trip-hop]], from the 1980s until the early 2010s UK rap made up a small percentage of album sales in the domestic market. Performers saw wider success in the 2020s, including [[Stormzy]] headlining [[Glastonbury Festival]], [[Dave (rapper)|Dave]] releasing back-to-back UK number one albums with ''[[Psychodrama (album)|Psychodrama]]'' followed by ''[[We're All Alone in This Together]]'', and [[Little Simz]] winning the [[Mercury Prize]].",
  "last_revision_date": "2025-11-14T11:52:26Z",
  "mixes": [
    {
      "video": "fCVJifjG3go"
    }
  ],
  "top_artists": [
    "Dizzee Rascal",
    "Stormzy",
    "KSI",
    "Skepta",
    "Riz Ahmed",
    "Tinie Tempah",
    "Tinchy Stryder",
    "Little Simz",
    "Central Cee",
    "Giggs (rapper)"
  ]
}