{
  "description": "'''Ultra''' is a Dutch [[post-punk]] [[punk movement|movement]] that originated in Amsterdam in the early 1980s.  The name \"ultra\" is a shortening of \"ultramodernen\".  The movement had an avantgarde, experimental, and artistic aesthetic.  Many of its participants were students in art schools.  In contrast to other countries' post-punk movements, the Dutch experimented with, among other things, toy instruments, chainsaws and de-tuned guitars.\n\nThere were four main strands involved with ultra music:\n# [[Dutch Punk]] bands from Amsterdam that embraced experimental music: most notably [[The Ex (band) | The Ex]] and [https://www.discogs.com/artist/328028-Morzelpronk Morzelpronk], led by Dolf Planteijdt, who ran a recording studio called the Koeienverhuurbedrijf (Cow Rental Company).\n# Amsterdam art students: most notably the [[Minny Pops]] led by Wally van Middendorp of the record label [https://www.discogs.com/label/12919-Plurex-Records Plurex]).  Plurex also supported Smalts and Stephen Emmer's solo work. Other Amsterdam ultra bands included [[:nl:The Young Lions (band)|The Young Lions]] (1979 - 1981), [https://www.discogs.com/de/artist/424841-Tox-Modell Tox Modell] (1980– 1982), [https://www.discogs.com/de/artist/526654-The-Tapes-2 The Tapes], and [https://www.discogs.com/de/artist/369477-Mecano-2 Mecano].<ref>{{cite web |url=https://minimalwave.com/interviews/interview/mecano-interview-by-markos-kritzalis-gr |title=Mecano Interview |last=Kritzalis |first=Markos |date=2019 |publisher=Minimal Wave |archive-url=https://web.archive.org/web/20230430172324/https://minimalwave.com/interviews/interview/mecano-interview-by-markos-kritzalis-gr |language=en |access-date=2023-04-30 |archive-date=2023-04-30 |url-status=bot: unknown}}</ref>\n# Nijmegen: [[:nl:Mekanik Kommando |Mekanik Kommando]], [https://www.discogs.com/artist/726723-Bazooka-7 Bazooka], [https://www.discogs.com/artist/685841-Vice-3 Vice], and [https://www.discogs.com/de/artist/882546-Puber-Kristus Puber Kristus]/Das Wesen.<ref>{{cite book |last= Foster |first= Richard |date=2020 |chapter= Mapping Subcultures from Scratch: Moving Beyond the Mythology of Dutch Post-Punk |title= Researching Subcultures, Myth and Memory |pages= 215–232 |url=https://link.springer.com/chapter/10.1007/978-3-030-41909-7_11 |location= Amstelveen |publisher= Palgrave Macmillan |doi= 10.1007/978-3-030-41909-7_11 |isbn= \t978-3-030-41908-0|s2cid= 226450254 }}</ref> Mekanik Kommando had two bass players, and played electronic music with dreamy style. \n# Eindhoven: [[:nl:Nasmak|Nasmak]] and friendly bands, who were interested in repetitive structures, but also produced music that was more fluid and danceable than the Amsterdam ultra bands.\n\nUltra was associated with the modern music magazine [[:nl:Vinyl  (tijdschrift)|Vinyl]], which existed from February 1981 to February 1988, and coined the term \"Ultra\". Stephen Emmer (the guitarist of the Minny Pops) and Arjen Schrama (the guitarist of the band Tox Modell) were the founders of this magazine. André Bach and Mark Tegefoss (also of Tox Modell) were involved and Harold Schellinx (of the band The Young Lions) served as an editor. The magazine's ambition was to create a new journalism that reflected the new music.  Vinyl not only acted as a voice for the movement, but also released the music of ultra bands on flexidisc, with every issue of the magazine accompanied by a free record.  The most representative compilation of the ultra movement was the C-90 cassette ''[https://www.discogs.com/de/release/1095034-Various-Ultra Ultra]'', released in 1981 on the Amsterdam label [https://www.discogs.com/label/73697-Lebel-Period Lebel PERIOD], a Dutch record label associated with Tox Modell, and run by Marc Tegefoss and Det Wiehl.  Most of the tracks on this album are untitled.\n\nThe band [[:nl:The Young Lions (band)|The Young Lions]] played a central role in defining the ultra movement and distinguished it as an abstract and conceptual musical direction.  The Young Lions was active from mid-1979 to early 1981.  The band consisted of the art students Rob Scholte (on drums), Ronald Heiloo (electric piano), Tim Benjamin (guitar), and Harold Schellinx (wonder instrument).  The group began practicing in the basement of the Rietveld art school. The eleven songs on their cassette ''Small World'' were composed in sequence during one uninterrupted, almost 24-hour studio session; these songs were performed live only once.  Scholte described the band's objective as \"to show punk where it had messed up\".  The goal was not to produce punk music, but to take a different, more artistic approach to punk.  Their rare performances often inspired violence and aggression from the audience, who did not understand their objectives.  Scholte has discussed how the audience would throw beer, climb onstage, and try to break their equipment.\n\nThe most successful and internationally recognized ultra band was the [[Minny Pops]], founded in 1978 by Wally van Middendorp (who also founded the record label [https://www.discogs.com/label/12919-Plurex-Records Plurex]). The band consisted of van Middendorp, Frans Hagenaars (bass), Peter Mertens (guitar). The [[Minny Pops]] toured internationally and opened for [[Joy Division]].\n\nWeekly ultra nights were organized at the Oktopus club in Amsterdam between September 1980 and March 1981. Organizers were Wally van Middendorp, Rob Scholte, and Harold Schellinx.",
  "last_revision_date": "2025-05-27T22:38:17Z",
  "mixes": [
    {
      "playlist": "PLQSAiBwcdOQNMl1rWWUIWfdQP3W1RN1hJ"
    }
  ],
  "top_artists": []
}