{
  "description": "'''Vaporwave''' is a [[microgenre]] of [[electronic music]], a visual art style, and an [[Internet meme]] that emerged in the early 2010s and became well-known in 2015. It is defined partly by its slowed-down, [[chopped and screwed]] samples of [[smooth jazz]], 1970s [[elevator music]], [[contemporary R&B|R&B]], and [[lounge music]] from the 1980s and 1990s; similar to [[synthwave]]. The surrounding [[subculture]] is sometimes associated with an ambiguous or satirical take on [[consumer capitalism]] and [[pop culture]], and tends to be characterized by a [[nostalgic]] or [[surrealist]] engagement with the [[popular entertainment]], technology and [[advertising]] of previous decades. Visually, it incorporates early Internet imagery, late 1990s web design, [[glitch art]], [[anime]], stylized [[Ancient Greek sculpture|Ancient Greek]] or [[Roman sculpture]]s, [[3D rendering|3D-rendered]] objects, and [[cyberpunk]] tropes in its cover artwork and [[music video]]s.\n\nVaporwave originated as an ironic variant of [[chillwave]], evolving from [[hypnagogic pop]] as well as similar retro-revivalist and [[post-Internet]] motifs that had become fashionable in underground digital music and art scenes of the era, such as [[Tumblr]]'s [[seapunk]]. The style was pioneered by producers such as [[James Ferraro]], [[Daniel Lopatin]] and [[Vektroid|Ramona Langley]], who each used various pseudonyms. After Langley's album ''[[Floral Shoppe]]'' (2011) established a blueprint for the genre, the movement built an audience on sites [[Last.fm]], [[Reddit]] and [[4chan#/mu/|4chan]] while a flood of new acts, also operating under online pseudonyms, turned to [[Bandcamp]] for distribution.\n\nFollowing the wider exposure of vaporwave in 2012, a wealth of subgenres and offshoots emerged, such as future funk, [[mallsoft]] and [[hardvapour]], although most have waned in popularity. The genre also intersected with fashion trends such as [[streetwear]] and various political movements. Since the mid-2010s, vaporwave has been frequently described as a \"dead\" genre.{{sfn|Harper|2017|p=121}} The general public came to view vaporwave as a facetious Internet meme, a notion that frustrated some producers who wished to be recognized as serious artists. Many of the most influential artists and record labels associated with vaporwave have since drifted into other musical styles. Later in the 2010s, the genre spurred a revival of interest in Japanese [[ambient music]] and [[city pop]]  and in the 2020s with the spread of its latest subgenre, [[Frutiger Aero]], sharing its name with the graphical style."
}