{
  "description": "'''Yodeling''' (also '''jodeling''') is a form of singing which involves repeated and rapid changes of pitch between the low-pitch [[chest register]] (or \"chest voice\") and the high-pitch [[head register]] or [[falsetto]]. The English word ''yodel'' is derived from the [[German (language)|German]] word ''jodeln'', meaning \"to utter the syllable ''jo''\" (pronounced \"yo\"). This vocal technique is used in many cultures worldwide. Recent scientific research concerning yodeling and non-Western cultures suggests that music and speech may have evolved from a common [[prosodic]] precursor.\n\nAlpine yodeling was a longtime rural tradition in Europe, and became popular in the 1830s as entertainment in theaters and [[music hall]]s. In Europe, yodeling is still a major feature of folk music (''[[Volksmusik]]'') from [[Switzerland]], [[Austria]], [[Southern Germany]], the Eastern [[France|French]] regions of [[Alsace]] and [[Savoy]] and the [[Northern Italy|Northern Italian]] region of [[Trentino-South Tirol]] and can be heard in many contemporary folk songs, which are also featured on regular TV broadcasts.\n\nIn the United States, traveling [[minstrels]] were yodeling in the 19th century, and, in 1920, the [[Victor Talking Machine Company|Victor recording company]] listed 17 yodels in their catalogue. In 1928, blending Alpine yodeling with African American work and blues music styles and traditional folk  music, [[Jimmie Rodgers (country singer)|Jimmie Rodgers]] released his recording \"[[Blue Yodel No.&nbsp;1]]\". Rodgers' \"[[blue yodel]]\", a term sometimes used to differentiate the earlier Austrian yodeling from the American form of yodeling introduced by Rodgers, created an instant national craze for yodeling in the United States; according to a black musician{{who?|date=November 2023}} who lived near Rodgers in Mississippi, both black and white musicians began to copy Rodgers' style of vocal delivery.{{citation needed|date=November 2023}}\n\nWhen [[sound film]]s first became available in the 1930s the industry began to turn out numerous  films to meet the nation's fascination with the American cowboy. The [[singing cowboy]] was a subtype of the archetypal cowboy hero of early [[Western (genre)|Western]] films, popularized by many of the [[B-movie]]s of the 1930s and 1940s. The transformation of Rodgers' blue yodel to the cowboy yodel involved both a change in rhythm and a move away from Southern blues-type lyrics. Some yodels contained more of the Alpine type of yodel as well. Most famous of the singing cowboy film stars were [[Gene Autry]] and [[Roy Rogers]], both accomplished yodelers. The popularity of yodeling lasted through the 1940s, but by the 1950s it became rare to hear yodeling in country and western music.",
  "last_revision_date": "2025-12-19T18:04:50Z",
  "top_artists": [
    "Kishore Kumar",
    "Topp Twins",
    "Wylie Gustafson",
    "Takeo Ischi",
    "Shanmukha Priya",
    "McDonald Craig"
  ]
}