{
  "page_title": "Bix Beiderbecke",
  "description": "'''Leon Bismark''' \"'''Bix'''\" '''Beiderbecke''' ({{IPAc-en|ˈ|b|aɪ|d|ər|b|ɛ|k}} {{Respell|BY|dər|bek}}; March 10, 1903 – August 6, 1931) was an American [[jazz]] [[cornetist]], [[pianist]] and composer. Beiderbecke was one of the most influential jazz soloists of the 1920s, a cornet player noted for an inventive lyrical approach and purity of tone, with such clarity of sound that one contemporary famously described it like \"shooting bullets at a bell”.\n\nHis solos on seminal recordings such as [[Singin' the Blues (1920 song)#Trumbauer/Beiderbecke Recording|\"Singin' the Blues\"]] and \"[[I'm Coming Virginia|I'm Coming, Virginia]]\" (both 1927) demonstrate a gift for extended [[Jazz improvisation|improvisation]] that heralded the jazz ballad style, in which jazz solos are an integral part of the composition. Moreover, his use of extended chords and an ability to improvise freely along harmonic as well as melodic lines are echoed in post-WWII developments in jazz. \"[[In a Mist]]\" (1927) is the best known of Beiderbecke's published piano compositions and the only one that he recorded. His piano style reflects both jazz and classical (mainly impressionist) influences. All five of his piano compositions were published by Robbins Music during his lifetime.\n\nA native of [[Davenport, Iowa|Davenport]], Iowa, Beiderbecke taught himself to play the cornet largely [[learning music by ear|by ear]], leading him to adopt a non-standard fingering technique that informed his unique style. He first recorded with Midwestern jazz ensemble [[The Wolverines (jazz band)|The Wolverines]] in 1924, after which he played briefly for the Detroit-based [[Jean Goldkette]] Orchestra before joining [[Frankie Trumbauer|Frankie \"Tram\" Trumbauer]] for an extended engagement at the Arcadia Ballroom in St. Louis, also under the auspices of Goldkette's organisation. Beiderbecke and Trumbauer joined Goldkette's main band at the Graystone Ballroom in Detroit in 1926. The band toured widely and famously played a set opposite [[Fletcher Henderson]] at the [[Roseland Ballroom]] in New York City in {{Nowrap|October 1926}}. He made his greatest recordings in 1927. The Goldkette band folded in September 1927 and, after briefly joining [[bass saxophone]] player [[Adrian Rollini]]'s band in New York, Trumbauer and Beiderbecke joined America's most popular dance band: [[Paul Whiteman]] and his Orchestra.\n\nBeiderbecke's most influential recordings date from his time with Goldkette and Whiteman, although he also recorded under his own name and that of Trumbauer's. The Whiteman period marked a precipitous decline in his health due to his increasing use of alcohol. Treatment for alcoholism in rehabilitation centers, with the support of Whiteman and the Beiderbecke family, failed to stop his decline. He left the Whiteman band in 1929 and in the summer of 1931 died aged 28 in his [[Sunnyside, Queens]], [[New York City|New York]] apartment.{{efn-ua|For summaries of Beiderbecke's life, see Lion, Sudhalter/Evans{{sfn|Sudhalter|Evans|Dean-Myatt|1974}} and the documentary film ''Bix: Ain't None of Them Play Like Him Yet'' (1981), written and directed by [[Brigitte Berman]].{{sfn|Sudhalter|Evans|Dean-Myatt|1974}}}}\n\nHis death, in turn, gave rise to one of the original legends of jazz.{{efn-ua|For a study of Beiderbecke's legend, see Perhonis.{{sfn|Perhonis|1978}}}} In magazine articles,{{efn-ua|For example, see Ferguson.{{sfn|Ferguson|1936}}{{sfn|Ferguson|1997}}}} musicians' memoirs,{{efn-ua|For example, see Carmichael,{{sfn|Carmichael|1999}} Condon,{{sfn|Condon|Sugrue|1992}} and Mezzrow.{{sfn|Mezzrow|Wolfe|1998}}}} novels,{{efn-ua|For example, see Baker{{sfn|Baker|1938|page=3}} and Turner.{{sfn|Turner|2003}}}} and Hollywood films,{{efn-ua|For example, see [[Young Man with a Horn (film)|''Young Man with a Horn'']], the 1950 [[Michael Curtiz]] film adapted from Baker's novel of the same name starring [[Kirk Douglas]], [[Lauren Bacall]], [[Doris Day]], and [[Hoagy Carmichael]]. See also the English-language, Italian-produced film, [[Bix (film)|''Bix: An Interpretation of a Legend'']] (1991), from director [[Pupi Avati]].}} Beiderbecke has been envisaged as a [[Romanticism|Romantic]] hero, the \"[[Young Man with a Horn (novel)|Young Man with a Horn]]\" (a novel, later made into a movie starring [[Kirk Douglas]], [[Lauren Bacall]], [[Doris Day]], and his friend [[Hoagy Carmichael]]). His life has often been portrayed as that of a jazz musician who had to compromise his art for the sake of commercialism. Beiderbecke remains the subject of scholarly controversy regarding his full name, the cause of his death and the importance of his contributions to jazz.\n\nHe composed or played on recordings that are jazz classics and standards such as \"[[Davenport Blues]]\", \"[[In a Mist]]\", \"[[Copenhagen (song)|Copenhagen]]\", \"[[Riverboat Shuffle]]\", \"[[Singin' the Blues (1920 song)|Singin' the Blues]]\", and \"[[Georgia on My Mind]]\".",
  "last_revision_date": "2025-05-04T03:34:43Z"
}