{
  "page_title": "Doof (musician)",
  "description": "'''Nicholas Barber''' (born 31 August 1968), better known by the [[stage name]] '''Doof''', is a British, [[London]]-based [[psychedelic trance]] musician.\n\nDoof's first official release was in 1993 with [[NovaMute]], the dance label run by [[Mute Records]], a three-track [[Extended play|EP]] titled \"Disposable Hymns to the Infinite\". It was through Novamute label-mates [[Juno Reactor]] and [[Ben Watkins]] that Doof was first introduced to producer Youth (of Killing Joke/ Brilliant), [[Hallucinogen (musician)|Simon Posford]], also known as Hallucinogen, and the Dragonfly Records label.\n\nDoof went on to release \"Double Dragons\" as a 12\" with Dragonfly in 1994, and to produce a series of tracks in partnership with Simon Posford, including \"Let's Turn On\", \"Born Again\" and \"Angelic Particles\". It was through his friendship with Simon Posford that Doof was introduced to [[Raja Ram (musician)|Raja Ram]] ([[Shpongle]]/[[The Infinity Project]]/[[Quintessence (English band)|Quintessence]]) who later that year would start the highly influential [[Trance music|trance]] label T.I.P Records. Doof's \"Let's Turn On\" (co-produced with Simon Posford) became the second ever T.I.P 12\" release. This was followed in 1995 by another 12\" for T.I.P (Angelina/Weird Karma), the ''Born Again'' EP on Matsuri and another 12\" for Dragonfly (\"Youth of the Galaxy\"). 1995 also saw numerous Doof remixes, including tracks by Hallucinogen and The Infinity Project.\n\nIn 1996, the first Doof album ''Let's Turn On'' was released on T.I.P. Records, and went on to become one of the defining albums of the early psy-trance sound. It was subsequently re-released in 2000 by [[Twisted Records (UK)|Twisted Records]], who also released the second Doof album ''It's About Time'' the same year. During this time Doof travelled extensively performing live sets all over the globe including numerous appearances across Europe, in the U.S, South America and Japan.\n\nIn 2001, he teamed up with friends Celli Firmi (Earthling/Soundaholix) and Mexican DJ and promoter Xavier Fux (Zulu Lounge) to collaborate on the psy-house project Vatos Locos. The first Vatos Locos album (''Welcome to the Barrio'') was released later that year by [[Sony Music]]. The second album, ''Attack and Release'', went out in 2004 with Dragonfly Records. It was around this time that Doof began to grow disillusioned with the commercial and musical direction that the psy-trance scene was taking, and started to explore other avenues of musical expression. He is also one half of downtempo [[electronica]] project Third Ear Audio with Celli Firmi, and as a singer/songwriter is recording acoustic songs as Nick Barber. In 2008, he released an acoustic album called ''Clear Blue Sky'' under his own name. This was followed by a second album of songs called ''Seeds''.\n\nIn April 2015, ''Let's Turn On'' was re-released by DAT Records in a remastered and expanded double CD version, featuring vintage alternate mixes of all the original tracks. One reviewer nominated it \"the greatest Goa trance album of all time\".\n\nIn early 2015, he started work as composer for the soundtrack of [[Bruce Parry]]'s forthcoming documentary ''Quest''. The film was eventually released under the title ''Tawai, A Voice from the Forest'' in September 2017. The original soundtrack album with music by Barber was also released at the same time.",
  "last_revision_date": "2025-01-16T07:47:46Z"
}