{
  "page_title": "Nine Inch Nails",
  "description": "'''Nine Inch Nails''', commonly abbreviated as '''NIN''' (stylized as '''NIИ'''), is an American [[industrial rock]] band formed in [[Cleveland]], [[Ohio]] in 1988. Its members are the singer-songwriter, multi-instrumentalist and producer [[Trent Reznor]] and his frequent collaborator, [[Atticus Ross]]. Reznor was previously the only permanent member of the band until Ross became an official member in 2016. The band's debut album, ''[[Pretty Hate Machine]]'' (1989), was released via [[TVT Records]]. After disagreements with TVT in regard to how the album would be promoted, the band signed with [[Interscope Records]] and released the EP [[Broken (Nine Inch Nails EP)|''Broken'']] (1992). The following albums, ''[[The Downward Spiral]]'' (1994) and ''[[The Fragile]]'' (1999), were released to critical acclaim and commercial success.\n\nFollowing a hiatus, Nine Inch Nails resumed touring in 2005 and released their fourth album ''[[With Teeth]]'' (2005). Following the release of the next album [[Year Zero (album)|''Year Zero'']] (2007), the band left Interscope after a feud. Nine Inch Nails continued touring and independently released ''[[Ghosts I–IV]]'' (2008) and [[The Slip (album)|''The Slip'']] (2008) before a second hiatus. Their eighth album, ''[[Hesitation Marks]]'' (2013), was followed by a trilogy which consisted of the EPs ''[[Not the Actual Events]]'' (2016) and ''[[Add Violence]]'' (2017) and their ninth album ''[[Bad Witch]]'' (2018). In 2020, Nine Inch Nails simultaneously released two further installments in the ''Ghosts'' series: ''[[Ghosts V: Together]]'' and ''[[Ghosts VI: Locusts]]''. The band announced a number of new projects in 2024 through their multimedia company With Teeth, and plan to embark on the [[Peel It Back Tour]] in 2025.\n\nWhen touring, Reznor typically [[List of Nine Inch Nails band members|assembles a live band]] to perform with him under the Nine Inch Nails name. This live band has varied over the decades, with various members leaving and returning; the most recent lineup consists of [[Robin Finck]] (who initially joined in 1994), [[Alessandro Cortini]] (who initially joined in 2005), and [[Ilan Rubin]] (who initially joined in 2008) alongside Reznor and Ross. [[Nine Inch Nails live performances|The band's concerts]] are noted for their extensive use of thematic visual elements, complex special effects, and elaborate lighting. Songs are often rearranged to fit any given performance, and melodies or lyrics of songs that are not scheduled to be performed are sometimes assimilated into other songs.\n\nNine Inch Nails has sold over 20 million records worldwide and been nominated for 13 [[Grammy Award]]s, winning for the songs [[Wish (Nine Inch Nails song)|\"Wish\"]] in 1992 and \"[[Happiness in Slavery]]\" in 1996. [[Time (magazine)|''Time'']] magazine named Reznor one of its most influential people in 1997, while ''Spin'' magazine has described him as \"the most vital artist in music\". In 2004, ''[[Rolling Stone]]'' ranked Nine Inch Nails No. 94 on its list of the \"[[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]\". Nine Inch Nails was inducted into the [[Rock and Roll Hall of Fame]] in 2020, after being nominated in 2014 (the band's first year of eligibility) and again in 2015.",
  "last_revision_date": "2025-06-20T07:06:51Z"
}