{
  "page_title": "Righeira",
  "description": "'''Righeira''' ({{IPA|it|riˈɡɛira}}) were an Italian [[Italo disco]] duo, formed in [[Turin]] in 1983, that comprised [[Johnson Righeira]] (lead vocals and keyboards) and [[Michael Righeira]] (backing vocals, keyboards and harmonica). Originally rooted in the early stages of [[Italo disco]] music, Righeira's musical style evolved throughout their career, incorporating elements of [[synth-pop]] and [[New wave music|new wave]] in their songs in innovative ways, later exploring music styles such as [[electronic music]] and regular [[pop music|pop]]. \n\nThe duo was formed after attending the Albert Einstein Scientific High School as schoolmates. Within the first months of their career, they signed with several record labels and released their debut album, ''[[Righeira (album)|Righeira]]'' (1983). With the release of the album, and the singles \"[[Vamos a la playa (Righeira song)|Vamos a la playa]]\" and \"[[No tengo dinero (Righeira song)|No tengo dinero]]\", Righeira established their reputation as a modern dance duo.{{sfn|Roberts|2006|p=463}} They scored another hit in the mid-1980s with the single \"[[L'estate sta finendo]]\", and won the [[Festivalbar]] singing competition in 1985. The duo's second album, ''Bambini Forever'' (1986), earned less success in public when it was released but included songs as \"Italians a Go-Go\", \"Oasi in città\" and \"[[Innamoratissimo (Tu che fai battere forte il mio cuore)|Innamoratissimo]]\", with which they performed at the [[Sanremo Music Festival 1986|Sanremo Music Festival]] in 1986.{{fact|date=November 2024}}\n\nRigheira worked  throughout the 1980s. Soon after the release of their third studio album, ''Uno, Zero, Centomila'' (1992), they broke up, and worked separately for seven years. Both singers produced music and pursued a new musical direction by which they were influenced by [[Eurodance]], [[rock music|rock]], [[reggae]], and [[Italo house]]. In 1999, they were reunited and made a successful comeback by then recording and releasing music, embracing a more ironic and electronic image. The duo released re-recorded versions of some of their hit songs, including \"Vamos a la playa\" in 2001. Experimenting with their new image, they released their fourth album, ''Mondovisione'' (2007), gaining mixed success. After performing together for over 25 years, the duo broke up for the second time in 2016.{{fact|date=November 2024}}\n\nRigheira have released four studio albums along with several singles throughout their career, selling millions of records worldwide. The duo remain as one of the most progressive ones in the [[Italo disco]] genre, along with their producers [[La Bionda]].{{sfn|Gonella|Marietti|2012|p=}}",
  "last_revision_date": "2024-11-18T00:01:04Z"
}