{
  "page_title": "Chicago (band)",
  "description": "'''Chicago''' is an American [[rock music|rock]] band formed in [[Chicago]], Illinois, in 1967. Self-described as a \"[[rock and roll]] band with [[Horn (instrument)|horns]],\" their songs often also combine elements of [[classical music]], [[jazz]], [[Rhythm and blues|R&B]], and [[pop music]].\n\nGrowing out of several bands from the Chicago area in the late 1960s, the original line-up consisted of [[Peter Cetera]] on bass, [[Terry Kath]] on guitar, [[Robert Lamm]] on keyboards, \n[[Lee Loughnane]] on trumpet, [[James Pankow]] on trombone, [[Walter Parazaider]] on [[Woodwind instrument|woodwinds]], and [[Danny Seraphine]] on drums. Cetera, Kath, and Lamm shared lead vocal duties. The group initially called themselves '''the Big Thing''', then changed to the '''Chicago Transit Authority''' in 1968, and finally shortened the name to '''Chicago''' in 1969.\n\n[[Laudir de Oliveira]] joined the band as a percussionist and second drummer in 1974. Kath died in 1978 and was replaced by several guitarists in succession. [[Bill Champlin]] joined in 1981, providing vocals, keyboards, and rhythm guitar. Cetera left the band in 1985 and was replaced by [[Jason Scheff]]. Seraphine left in 1990 and was replaced by [[Tris Imboden]]. Although the band's lineup has been more fluid since 2009, Lamm, Loughnane, and Pankow have remained constant members. Parazaider \"officially retired\" in 2017. In 2021, he revealed he had been diagnosed with [[Alzheimer's disease]].\n\nIn September 2008, ''[[Billboard charts|Billboard]]'' ranked Chicago at number thirteen in a list of the top 100 artists of all time for [[Billboard Hot 100|Hot 100]] singles chart success, and ranked them at number fifteen on that same list in October 2015. ''Billboard'' also ranked Chicago ninth on the list of the 100 greatest artists of all time in terms of [[Billboard 200|''Billboard'' 200]] album chart success in October 2015. Chicago is one of the longest-running and most successful rock groups, and one of the [[List of best-selling music artists|world's best-selling groups of all time]], having sold more than 100 million records. In 1971, Chicago was the first rock act to sell out [[Carnegie Hall]] for a week. Chicago is also considered a pioneer in rock music marketing, featuring a recognizable logo on album covers, and sequentially naming their albums using Roman numerals.\n\nIn terms of chart success, Chicago is one of the most successful American bands in [[Recording Industry Association of America]] (RIAA) and [[Billboard charts|''Billboard'']] history (second only to [[the Beach Boys]]), and are one of the most successful [[popular music]] acts of all time. To date, Chicago has sold over 40 million units in the U.S., with 23 [[RIAA certification|gold]], 18 [[Music recording sales certification|platinum]], and eight multi-platinum albums. They had five consecutive number-one albums on the ''Billboard'' 200, 20 top-ten singles on the ''Billboard'' Hot 100, and in 1974 the group had seven albums, its entire catalog at the time, on the ''Billboard'' 200 simultaneously. The group has received ten [[Grammy Award]] nominations, winning one for the song \"[[If You Leave Me Now]]\". The group's first album, ''[[Chicago Transit Authority (album)|Chicago Transit Authority]]'', released in 1969, was inducted into the [[Grammy Hall of Fame]] in 2014. The original line-up of Chicago was inducted into the [[Rock and Roll Hall of Fame]] in 2016. In 2017, Cetera, Lamm, and Pankow were elected to the [[Songwriters Hall of Fame]]. Chicago received a [[Grammy Lifetime Achievement Award]] on October 16, 2020.",
  "last_revision_date": "2025-06-10T04:57:32Z"
}