{
  "page_title": "Juan Carlos Cáceres",
  "description": "'''Juan Carlos Cáceres''' (4 September 1936 – 5 April 2015) was an [[Argentine people|Argentine]] musician.\n\nBorn in the 1930s in Buenos Aires, Juan Carlos Cáceres became intimately involved with the existentialist movement that thrived in the city during the years of his youth. Cáceres was an accomplished jazz trombonist by his mid-twenties, and though he studied fine arts at the university rather than music, he quickly became a fixture in the Buenos Aires jazz community. He became a mainstay at the Cueva de Passarato jazz club, which was not only an important musical venue, but a gathering place for revolutionary and existential thinkers. In the late '60s Caceres relocated to Paris, where he engaged in a wide variety of artistic pursuits, including painting, producing, teaching, and above all, playing.\n\nDuring this period, he became an expert on the music surrounding the [[Río de la Plata]] – styles such as [[tango music|tango]], [[Milonga (music)|milonga]], [[murga]], and [[candombe]]. His musicianship flourished as he earned a reputation not only as a proficient trombonist, but as a pianist, vocalist, and songwriter as well. His debut record, entitled ''Sudacas'', was released on the French/American label Celluloid Records. His second release, ''Tocá Tangó'', was deeply influenced by his studies on the African origins of tango and its relationship with murga and candombe. It featured a non-traditional, fusion-oriented ensemble and the stunning candombe compositions \"Tango Negro\" and \"Tocá Tangó.\" His fourth original release, ''Murga Argentina'', found a home on the Mañana Music label. Caceres' 2007 release Utopia was the first to earn him the moniker ''The Lion'', heralded as a triumph of both performance and musicology.\n\nHis interest in the various styles of tango led him to start other projects in widely different formats than his more percussion-guided solo records. He also founded the more traditional \"golden age\" tango group [[París Gotán Trío]], along with Sedef Ercetin on cello and Sasha Rozhdestvensky on violin. He also started a project in the increasingly popular electronic tango genre, [[Maquinal Tango]].\n\nHe died of cancer at his home in Paris on 5 April 2015 at the age of 78.",
  "last_revision_date": "2025-03-11T23:53:50Z"
}