{
  "page_title": "Connie Smith",
  "description": "'''Connie Smith''' (born '''Constance June Meador'''; August 14, 1941) is an American [[country music]] singer and songwriter. Her [[contralto]] vocals have been described by music writers as significant and influential to the women of country music. A similarity has been noted between her vocal style and the stylings of country vocalist [[Patsy Cline]]. Other performers have cited Smith as influence on their own singing styles, which has been reflected in quotes and interviews over the years.\n\nDiscovered in 1963, Smith signed with [[RCA Victor Records]] the following year and remained with the label until 1973. Her debut single \"[[Once a Day]]\" was nominated at the [[Grammy Awards]] for [[Best Female Country Vocal Performance]] and reached number one on the ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs]] chart in November 1964 and remained at the top position for eight weeks. In 1991, [[Trisha Yearwood|Trisha Yearwood's]] [[She's in Love with the Boy|debut single]] went to #1 for two weeks, but Smith still held the record for the most number of weeks at #1 by any female country artist in history. [[Taylor Swift|Taylor Swift's]] \"[[We Are Never Ever Getting Back Together]]\" broke Smith's 48 year record in 2012. Smith's success continued through 1960s and mid-1970s with 19 more top-10 hits (including \"[[Then and Only Then]]\", \"[[Ain't Had No Lovin']]\", \"[[Cincinnati, Ohio (song)|Cincinnati, Ohio]]\", \"[[I Never Once Stopped Loving You (song)|I Never Once Stopped Loving You]]\", and \"[[Ain't Love a Good Thing]]\") on the country songs chart.\n\nIn the early 1970s, Smith began to record [[gospel music]] more frequently as she became more serious in her Christianity. As she focused more heavily on religion, Smith became known for her outspoken religious demeanor at concerts and music venues. At the same time, she spent more time raising her five children than focusing on music. She eventually went into semi-retirement in 1979 and returned to recording briefly in the mid-1980s with [[Epic Records]]. However, it was not until her collaboration with [[Marty Stuart]] in the 1990s that she returned permanently. Their musical friendship became romantic, leading to their marriage in 1997, and to ''[[Connie Smith (1998 album)|Connie Smith]]'', her first studio album in 20 years. Critically acclaimed, Smith began performing again and has recorded two more studio albums.\n\nSmith has been nominated for 11 [[Grammy Awards]], including eight nominations for Best Female Country Vocal Performance. She has also been nominated for one [[Academy of Country Music]] award and three [[Country Music Association]] awards. ''Rolling Stone'' included her on its list of the 100 greatest country music artists and ''[[CMT (U.S. TV channel)|CMT]]'' ranked her among the top 10 in its list of the 40 greatest women of country music. She has been a member of the [[Grand Ole Opry]] cast since 1965. In 2012, Smith was inducted into the [[Country Music Hall of Fame]].",
  "last_revision_date": "2025-06-16T02:01:28Z"
}