{
  "page_title": "Foreigner (band)",
  "description": "'''Foreigner''' is a British-American rock band formed in New York City in 1976. The band's original lineup consisted of vocalist [[Lou Gramm]], guitarist [[Mick Jones (Foreigner guitarist)|Mick Jones]], drummer [[Dennis Elliott]], keyboardist [[Al Greenwood]], multi-instrumentalist [[Ian McDonald (musician)|Ian McDonald]] (formerly of [[King Crimson]]), and bassist [[Ed Gagliardi]]. Foreigner is one of the [[List of best-selling music artists|best-selling bands of all time]], with worldwide sales exceeding 80 million records, including 38 million in the US.\n\nJones came up with the band name because he, Elliott, and McDonald were British, while Gramm, Greenwood, and Gagliardi were American, meaning at least half the members would be considered foreigners regardless of the country they were in. In 1977, Foreigner released its [[Foreigner (Foreigner album)|self-titled]] debut album, the first of six consecutive albums to be certified multi-platinum and reach the Top 10 in the US. The album produced two US Top 10 singles, \"[[Feels Like the First Time]]\" and \"[[Cold as Ice (Foreigner song)|Cold as Ice]]\". Their 1978 follow-up, ''[[Double Vision (Foreigner album)|Double Vision]]'', was successful and included two more US hits: \"[[Hot Blooded]]\" and the [[Double Vision (Foreigner song)|title track]].\n\n[[Rick Wills]] replaced Gagliardi on bass before Foreigner recorded their third album, ''[[Head Games (album)|Head Games]]'' (1979), which featured US Top 20 singles \"[[Dirty White Boy (song)|Dirty White Boy]]\" and the [[Head Games (song)|title track]]. After the departures of McDonald and Greenwood, reducing the band to a quartet, their next album, ''[[4 (Foreigner album)|4]]'' (1981), hit No. 1 for 10 weeks in the US and became their breakthrough album in the UK, where it reached the Top 5. The album produced three hit singles: \"[[Urgent (song)|Urgent]]\", \"[[Waiting for a Girl Like You]]\", and \"[[Juke Box Hero]]\". In 1984, Foreigner released their fifth studio album, ''[[Agent Provocateur (album)|Agent Provocateur]]'', which reached No. 1 in the UK and included their biggest hit single, \"[[I Want to Know What Love Is]]\". The song topped the charts in the US, UK, Canada, and Australia, No. 3 in Germany, and the Top 10 in other countries.\n\nAfter a break, Foreigner released ''[[Inside Information (album)|Inside Information]]'' in 1987. Despite two more US Top 10 hits with \"[[Say You Will (Foreigner song)|Say You Will]]\" and \"[[I Don't Want to Live Without You]]\", it became their first album not to achieve multi-platinum certification or reach the Top 10 in the US. Since 1990, Foreigner has undergone lineup changes, including the departures of Elliott and Wills in 1991. Gramm left in 1990, returned in 1992, and departed again in 2003. Three studio albums—''[[Unusual Heat]]'' (1991), ''[[Mr. Moonlight (album)|Mr. Moonlight]]'' (1994), and ''[[Can't Slow Down (Foreigner album)|Can't Slow Down]]'' (2009)—were not commercial successes. However, the 1992 greatest hits album, ''[[The Very Best ... and Beyond]]'' achieved 2× platinum certification in the US and gold certification in the UK.\n\nSince 2003, Jones has been the only founding member actively involved, though Foreigner has occasionally toured without him. Two founding members, Gagliardi and McDonald, died in 2014 and 2022. Since 2013, there have been quasi-reunion tours, concerts, and guest appearances featuring varying combinations of former members, including Gramm, Elliott, Wills, Greenwood, and McDonald. In 2024 Foreigner was inducted into the [[Rock and Roll Hall of Fame]].",
  "last_revision_date": "2025-06-15T10:49:11Z"
}