{
  "page_title": "Los Tigres del Norte",
  "description": "'''Los Tigres del Norte''' (English: ''The Tigers of the North'') are a [[Norteño (music)|norteño]] band from [[San Jose, California]]. Originally founded in the small town Rosa Morada in the municipality of [[Mocorito]], [[Sinaloa, Mexico]], with sales of 32 million albums, the band is one of the most recognized acts in [[Regional Mexican|regional Mexican music]], due to their long history and their successes within the Mexican community in the diaspora. The band is famous for its political [[corridos]], some of which have been censored, even in its own country. The band is the only Mexican group to win 7 [[Grammy Awards]] and 12 [[Latin Grammys]]. In addition, the band has made 40 films alongside the Almada brothers ([[Mario Almada (actor)|Mario]] and Fernando) among other well-known Mexican actors.\n\n\nThe band's style is based on regional music of Mexico, using mainly instruments such as the electric bass (or double bass), accordion, bass, drums, and sometimes other percussion instruments. The lyrics in their songs fluctuate between the romantic and the corrido, including [[narcocorridos]], in which they narrate the experience of members of drug gangs operating in Mexico. The narcocorrido song \"Muerte Anunciada\", for example, stands out, as it is dedicated to the legendary Mexican drug trafficker [[Miguel Ángel Félix Gallardo]], \"El Jefe de Jefes.\" In that song, the band tells the story of the power and influence of the now imprisoned Gallardo. Another of their famous narcocorridos, \"The Queen of the South\", is based on [[The Queen of the South (novel)|a novel]] by [[Arturo Pérez-Reverte]] from which a television series was made based on the Spanish writer's work. They have become famous in Mexico and the United States, especially in California and Texas, mainly due to the large number of Mexicans living there. They also have found considerable fame in Colombia.\n\nThe band won a Grammy Award in 1988 for their album ''Gracias, América sin Fronteras'', and twelve years later their album ''Herencia de Familia'' won the award for Best Norteño Album at the first ever Latin Grammys. A year later, in the second edition of the awards, they were nominated again for Best Norteño Album, this time for ''De Paisano a Paisano'', and Best Regional Mexican Song for the song of the same title from that album.",
  "last_revision_date": "2025-05-25T02:05:34Z"
}