{
  "page_title": "Chrisye",
  "description": "[[Hajji]] '''Chrismansyah Rahadi''' ({{IPA|id|xrisˈmanʃah raˈhadi|}}; born '''Christian Rahadi''' {{IPA|id|xristiˈan raˈhadi|}}; 16 September 1949 – 30 March 2007), better known by his [[stage name]] '''Chrisye''' ({{IPA|id|xəˈriʃə|}}), was an Indonesian [[progressive pop]] singer and songwriter. In 2011, ''[[Rolling Stone Indonesia]]'' declared him the third-greatest Indonesian musician of all time.\n\nBorn in Jakarta of mixed [[Chinese Indonesians|Chinese-Indonesian]] descent, Chrisye became interested in music at an early age. At high school, he played [[bass guitar]] in a band he formed with his brother, Joris. In the late 1960s, he joined Sabda Nada (later Gipsy), a band led by his neighbours, the Nasutions. In 1973, after a short hiatus, he rejoined the band to play in New York for a year. He briefly returned to Indonesia and then went back to New York with another band, the Pro's. After once again returning to Indonesia, he collaborated with Gipsy and [[Guruh Sukarnoputra]] to record the 1976 indie album ''[[Guruh Gipsy]]''.\n\nFollowing the success of ''Guruh Gipsy''; in 1977, Chrisye recorded two of his most critically acclaimed works: \"[[Lilin-Lilin Kecil]]\" by [[James F. Sundah]], which eventually became his signature song, and the soundtrack album ''[[Badai Pasti Berlalu (album)|Badai Pasti Berlalu]]''. Their success landed him a recording contract with [[Musica Studios]], with whom he released his first solo album, ''[[Sabda Alam]]'', in 1978. Over his almost 25-year career with Musica, he recorded a further 18 albums, and in 1980, he acted in a film, ''[[Seindah Rembulan]]''. Chrisye died in his Jakarta home on 30 March 2007 after a long battle with [[lung cancer]].\n\nKnown for his stiff stage persona and smooth vocals, Chrisye was critically acclaimed in Indonesia. Five albums to which he contributed were included in ''Rolling Stone Indonesia''{{'s}} list of the 150 Best Indonesian Albums of All Time; another four of his songs (and a fifth to which he contributed) were classified as some of the best Indonesian songs of all time in a later issue of the same magazine. Several of his albums received [[Music recording sales certification|certification]] of silver or gold. He received two lifetime achievement awards, one in 1993 from the BASF Awards and another posthumously in 2007 from Indonesian television station [[SCTV (Indonesia)|SCTV]].",
  "last_revision_date": "2025-03-30T17:57:59Z"
}