{
  "page_title": "Issues (band)",
  "description": "'''Issues''' was an American [[metalcore]] band based in [[Atlanta, Georgia]], founded in 2012. The band's final lineup consisted of guitarist and vocalist AJ Rebollo, bassist and vocalist Skyler Acord, and drummer Josh Manuel. They were known for their combination of [[metalcore]], [[nu metal]], [[pop music|pop]] and [[contemporary R&B]].\n\nFollowing original member Michael Bohn and [[Tyler Carter]]'s departure from [[Woe, Is Me]], the duo formed Issues with keyboardist Ben Ferris, bassist Cory Ferris, guitarist AJ Rebollo, and drummer Case Snedecor, subsequently signing to [[Rise Records]]. The Ferris brothers departed from the group prior to the release of the ''[[Black Diamonds (EP)|Black Diamonds]]'' EP, in 2012. Snedecor left the band in 2013 and was replaced by drummer Josh Manuel while Ben and Cory Ferris were replaced by keyboardist and [[disc jockey]] [[Tyler Acord]] and bassist Skyler Acord, respectively. The band released their [[Issues (Issues album)|self-titled debut studio album]] in 2014, which was praised for its DJ-based breakdowns and mixture of metalcore and [[electronica]], charting at number-nine on the US [[Billboard 200|''Billboard'' 200]]. They released their remix album, ''[[Diamond Dreams (EP)|Diamond Dreams]]'', in November 2014. Their second studio album, ''[[Headspace (Issues album)|Headspace]]'', was released in May 2016. On January 4, 2018, it was revealed the band had fired Michael Bohn due to \"wanting to go in a different direction\". The following year, the group released their third studio album, ''[[Beautiful Oblivion]]'', on October 4, 2019. In September 2020, Tyler Carter was fired from the band for multiple accusations of grooming and sexual misconduct. The band would remain inactive until November 2023, when they announced they would be disbanding following three farewell shows slated for January 2024.\n\nIssues won the [[Alternative Press Music Awards|Alternative Press Music Award]] for Artist of the Year in 2015 and for Best Bassist the following year, and altogether was nominated for seven Alternative Press Music Awards. The group was nominated for Best New Talent at the 2014 ''[[Revolver (magazine)|Revolver]]'' [[Golden Gods]]. The band performed at various music festivals including the [[Vans Warped Tour]], the [[Reading and Leeds Festivals]], and [[Slam Dunk Festival]].",
  "last_revision_date": "2025-06-15T00:06:10Z"
}