{
  "page_title": "Samla Mammas Manna",
  "description": "'''Samla Mammas Manna''' was a [[Sweden|Swedish]] [[progressive rock]] band often characterized by virtuosic musicianship, [[circus]] references and [[Silliness|silly]] [[humour]], similar in many ways to the song-writing style of [[Frank Zappa]]. They were one of the founding members of the [[Rock in Opposition]] (RIO) movement in the late 1970s. In 1979 they were [[Fred Frith]]'s backing band on his solo album, ''[[Gravity (Fred Frith album)|Gravity]]'' (1980). Musically, they bore a resemblance to the [[Canterbury scene]].\n\nThe original line-up was [[Lars Hollmer]] (keyboards), Hasse Bruniusson (drums), Lars Krantz (bass) and Henrik Öberg (percussion). For ''Måltid'', [[jazz fusion]] guitarist Coste Apetrea joined the group.\n\nThey were on the fringe of the Swedish political \"[[progg]]\" movement, although their lyrics were humorous and not explicitly political. The title of the album ''Klossa Knapitatet'' is a play on the Swedish phrase ''krossa kapitalet'', a common [[slogan]] in the 1970s that means \"crush the [[Capital (economics)|capital]]\", and also the title of a seminal progg song by [[Blå Tåget]], called \"Staten och Kapitalet (Den ena handen vet vad den andra gör)\". Some more serious elements of the progg movement were not amused by this frivolous attitude.\n\nThey spent a significant part of the 70s touring in Sweden, but also in other European countries.\n\nThe band underwent line-up and name changes over the years (they released albums as Zamla Mammaz Manna and von Zamla), reinventing their sound each time. In 1999, the band reformed under their original name for a one-off release entitled ''Kaka''. In 2002 they reunited again, this time with Japanese musician [[Tatsuya Yoshida]] on drums, for some performances and their final album ''Dear Mamma''. The band played their first concerts in the US in August 2003, in Chicago at Schuba's, and at the annual Progday festival in [[North Carolina]].\n\nIn 2005 the band opened the international [[progressive rock]] [[rock festival|festival]] that took place in [[Moscow]], [[Russia]], [[InProg]] 2005.\n\nHollmer died in December 2008.",
  "last_revision_date": "2024-03-29T05:27:45Z"
}