{
  "page_title": "The Mavericks",
  "description": "'''The Mavericks''' are an American band from [[Miami]], Florida. The band consists of [[Raul Malo]] (lead vocals, guitar), Paul Deakin (drums), [[Eddie Perez (guitarist)|Eddie Perez]] (lead guitar), and Jerry Dale McFadden (keyboards). Malo and Deakin founded the band in 1989 along with Robert Reynolds (bass guitar) and Ben Peeler (lead guitar). After one independent album, the band was signed by [[MCA Nashville Records]] and [[David Lee Holt]] replaced Peeler on lead guitar; he would be replaced by Nick Kane shortly after their second MCA album and third overall 1994's ''[[What a Crying Shame]]''. The band recorded a total of four albums for MCA and one for [[Mercury Records]] before disbanding in 2000. They reunited for one album in 2003 on [[Sanctuary Records]], by which point Perez had become their fourth guitarist, and former touring keyboardist Jerry Dale McFadden became an official fifth member. The lineup of Malo, Deakin, Reynolds, Perez, and McFadden reunited a second time in 2012 for a series of new albums, first on [[Big Machine Records]]' Valory imprint and then on Mono Mundo. Reynolds was fired in 2014 and Ed Friedland served as touring bassist until 2023, with Malo briefly taking over on bass before Scotty Huff joined as touring bassist in 2024.\n\nThe Mavericks have charted 15 times on the American ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs]] charts; their highest-peaking single there is \"[[All You Ever Do Is Bring Me Down]]\", a collaboration with accordionist [[Flaco Jiménez]] which reached number 13 in 1996. Three of their singles made top 10 on the country music charts of the defunct ''[[RPM (magazine)|RPM]]'' magazine in Canada, and \"[[Dance the Night Away (The Mavericks song)|Dance the Night Away]]\" was a hit single in the United Kingdom in 1998. Their most commercially successful album ''What a Crying Shame'' has been [[music recording certification|certified platinum]] in the United States and double-platinum in Canada. In addition, the band has received one [[Grammy Award]], two [[Country Music Association]] awards, and three [[Academy of Country Music]] awards. Their sound is defined by a wide variety of musical styles outside of country music, such as [[Tejano music|Tejano]], [[Music of Latin America|Latin]], [[Americana music|Americana]], and the [[pop music]] of the 1950s, with particular emphasis on Malo's singing voice.",
  "last_revision_date": "2025-05-29T12:11:30Z"
}