{
  "page_title": "Tatana Sterba",
  "description": "'''Tatana Sterba''' (born October 7, 1976, in [[Uherské Hradiště]], [[Czechoslovakia]] (now in the [[Czech Republic]]) as ''Taťána Štěrbová'' ({{IPA|cs|ˈtacaːna ˈʃcɛrbovaː|pron}}), in 1980 the family emigrated to Switzerland) is a [[dance music|dance]] and [[Trance music|trance]] [[record producer|producer]] better known under her alias '''Tatana'''.\n\nTatana is one of the most successful artists of the 2000s in the [[Switzerland|Swiss]] charts, with several successful [[trance music|trance]] albums since her debut album ''24 Carat'' was released in February 2000.\n\nTatana's Swiss chart debut came in May 1999, with the release of the single \"End Of Time\", a collaboration with [[DJ Energy]]. The single was not a chart success, but put her on the map in the Swiss trance genre. The No. 14 single \"More Than Words – Street Parade Hymn '99\" followed, along with \"Dream Off\" and then her early 2000 debut album. Her debut album made No. 9 in the charts, but despite its success, no further singles followed from the album.\n\nTatana returned in November 2000 with her album ''Pure Elements'', but again, no singles followed. Tatana had appeared to have abandoned releasing singles by this point, and released a third album, entitled ''Pink Punk'', in May 2001. The album peaked at No. 5 and was at the time her biggest success to date.\n\nDJ Energy collaborated again with Sterba in July 2001, releasing the single \"Feel (Energy 2001 Anthem)\". The single peaked at No. 83 but spent 5 weeks in the Top 100, and became a club success. Tatana went quiet for a while after that, before releasing the single \"Words\" in March 2002. The single was a huge success, making No. 5 in the Swiss charts, which to this day makes it her highest-placing single.\n\nThe album ''Superpop'' followed, making No. 2 on the Swiss album chart. A year without a new single or album followed, with the single \"Moments\" and album ''Wildlife'' released in March and April 2003 respectively. ''Wildlife'' would become her first album chart #1.\n\nTatana appeared to be reducing the release of new material, with rumours of retirement even circulating. She returned in May, 2004, and the album ''Neon Lights'' would be her second successive No. 1 album. Her May 3, 2004, single release \"Always On My Mind\", a collaboration with [[Jaël]], would become her second top ten single and peak at #6.\n\nThe top twenty singles \"Elements Of Culture – Street Parade Hymn 2004\" and \"All That I Feel\" (the latter featuring [[Pee (artist)|Pee]]) would follow, before her April 2005 album ''Peace And Love'' was released. The album would complete a hat-trick of chart #1s, a feat never achieved by any trance producer in Swiss chart history.\n\nHer third top ten single \"Today Is Tomorrow – Street Parade 2005\", featuring the vocal talents of [[Morris (vocalist)|Morris]], would follow in July 2005. \"If I Could\" followed in November 2005, and on December 3, 2005, Tatana released her ''Greatest Hits'' album. The album reached a peak of No. 13 in the singles chart.\n\nHer 2008 single \"Spring Breeze\" was included in [[Armin van Buuren]]'s A State of Trance 2008 Yearmix.\n\nIn 2011, Tatana collaborated with British singer-songwriter [[Natalia Kills]] for the single \"You Can't Get in My Head (If You Can't Get in My Bed),\" featured on a new album called ''Heart''.",
  "last_revision_date": "2024-12-27T20:51:26Z"
}