{
  "page_title": "65daysofstatic",
  "description": "'''65daysofstatic''' (often abbreviated as '''65dos''', '''65days''', or simply '''65''') are  a [[post-rock]] band from [[Sheffield]], England. Formed in 2001, the band is composed of instrumentalists Paul Wolinski, Joe Shrewsbury, Rob Jones and Simon Wright.\n\nThe band's music has been described as noisy, electronic, guitar-driven instrumentals, interspersed with live drums and [[Beat (music)#On-beat and off-beat|off-beat]] [[sampling (music)|sampled]] drums akin to those of [[Intelligent dance music|IDM]] artists, although they have continued to evolve their sound by incorporating [[electronic music]], [[drum and bass]] and [[Glitch (music)|glitch music]]. They have been described as, \"a soundtrack to a new dimension, where [[Rock music|rock]], [[Dance music|dance]] and [[electronic music|electronica]] are equals.\"\n\nThe band's first album, ''[[The Fall of Math]]'', was released in September 2004, to critical acclaim, described as \"an album that can retain the dynamics, fraught tension and climactic explosiveness of its peers and influences, whilst still sounding like one of the most urgent and direct long-player releases of the year.\" The band released a further five studio albums, ''[[One Time for All Time]]'', ''[[The Destruction of Small Ideas]]'', ''[[We Were Exploding Anyway]]'', [[Wild Light (album)|''Wild Light'']], ''[[replicr, 2019]]'', and a soundtrack, ''[[Silent Running (album)|Silent Running]]''.\n\nDuring the [[The Game Awards|Game Awards 2014]], it was announced that they would be providing the soundtrack for the video game ''[[No Man's Sky]]'', followed by a live performance. An album containing music from the soundtrack, entitled ''No Man's Sky: Music for an Infinite Universe'', was released in August 2016. During September 2017, the band announced new work involving algorithmic techniques, titled ''Decomposition Theory.'' Their latest studio album, ''Debris,'' was released on 14 February 2022.",
  "last_revision_date": "2025-06-06T04:08:10Z"
}