{
  "description": "'''8 Bit Weapon''' is an American [[Chiptune|chiptune music]] band formed in [[Ventura County, California]], by Seth and Michelle Sternberger. It was originally created by Seth Sternberger around 1998. Its instruments consists primarily of old [[8-bit]] and [[16-bit]] [[computer]]s (with 8-bit audio output) such as the [[VIC-20]], [[Commodore 64]], [[Commodore 128]],  [[Amiga 500]], and the [[Apple II]], as well as [[video game console|game consoles]] such as the [[Nintendo Entertainment System]], [[Game Boy]], [[Atari 2600]], and an [[Intellivision]] synthesizer.\n\nThe band started around 1998 by remixing Commodore 64 [[MOS Technology 6581|SID]] tunes like Crazy Comets, [[M.U.L.E.]], and some [[Nintendo]] [[Nintendo Entertainment System|NES]] game music such as ''[[Super Mario Bros. 2]]'' and ''[[Metroid]]''. Both the SID remixes can be heard on the album titled \"Confidential 1.0\" and the Nintendo remixes on the band's official website. Later on, they began writing original music using the Commodore 64, [[Nintendo]] Game Boy, and NES, as well as other 8 bit consoles and computers.\n\nThe band has become well known recently after favorable coverage in the ''[[Los Angeles Times]]'', A live performance on G4's Attack of the Show, and performances at [[E3 (Electronic Entertainment Expo)|E3]] 2004, 2005, and 2006. The project with [[Nokia]] is the soundtrack for ''[[Reset Generation]]'' (previously known under the [[code name]] \"Project White Rock\"), a game by [[RedLynx]] for [[N-Gage 2.0]] and [[Personal computer|PCs]].\n\n[[Xbox (console)|Xbox]]’s exclusive [[Halo 2]] [[E3 (Electronic Entertainment Expo)|E3]] 2004 preview event had its own 15-minute soundtrack written and produced by 8 Bit Weapon, which was played continuously in the gaming area of the party. The band has also remixed music for [[Erasure (duo)|Erasure]], [[Information Society (band)|Information Society]], and [[Kraftwerk]].\n\nIn July 2007, they were hired to perform at [[Commodore International|Commodore]]'s 25th anniversary party for the Commodore 64 computer.\n\nOn March 16, 2012, the [[Smithsonian American Art Museum]]'s \"The Art of Video Games\" exhibit opened featuring a chipmusic soundtrack at the entrance by artists 8 Bit Weapon & [[ComputeHer]]. 8 Bit Weapon also created a track called \"The Art of Video Games Anthem\" for the exhibit as well.\n\nIn July 2017, they released \"Class Apples\", the world's first 100% Apple II based music album, featuring dance-oriented versions of classical music by Bach, Beethoven, and Mozart, recorded directly from the Apple II motherboard, including the drum sounds.\n\n\nIn November 2024, 8 Bit Weapon made the world's first \"rogue-like\" 100% randomly arranged video game soundtrack for Bub-O Burst on Steam.  \"Every piece of music in  Bub-O Burst is randomized. We created randomised music for every portion of the game: the intro, the levels, and even the ending is randomised. Every time a player launches a new game of Bub-O Burst, the soundtrack takes musically interchangeable drum, bass, & lead loops I created from scratch and arranges them into songs with verses, chorus’, and bridges that make the soundtrack.\"",
  "last_revision_date": "2025-04-11T04:57:59Z"
}