{
  "name": "ABBA",
  "description": "'''ABBA'''{{efn|An [[acronym]] of the first letters of the members' first names arranged as a [[palindrome]], usually stylized as '''A{{css-style|{{mirrorH}}|B}}BA'''. The group was originally named '''Björn & Benny, Agnetha & Anni-Frid''' or '''Björn & Benny, Agnetha & Frida'''.}} ({{IPAc-en|ˈ|æ|b|ə|audio=LL-Q1860 (eng)-Naomi Persephone Amethyst (NaomiAmethyst)-ABBA.wav}} {{respell|AB|ə}} {{IPA|sv|ˈâbːa|}}) were a Swedish pop group formed in Stockholm in 1972 by [[Agnetha Fältskog]], [[Björn Ulvaeus]], [[Benny Andersson]], and [[Anni-Frid Lyngstad]]. They are one of the most popular and successful musical groups of all time, and are one of the [[List of best-selling music artists|best-selling music acts]] in the history of popular music. \n\nIn {{Escyr|1974}}, ABBA became {{Esccnty|Sweden}}'s first winner of the [[Eurovision Song Contest]] with the song \"[[Waterloo (ABBA song)|Waterloo]]\", which in 2005 was chosen as the best song in the competition's history as part of the [[Congratulations: 50 Years of the Eurovision Song Contest|50th anniversary celebration]] of the contest. During the band's main active years, it consisted of two couples: Fältskog and Ulvaeus, and Lyngstad and Andersson. With the increase of their popularity, their personal lives suffered, which eventually resulted in the collapse of both marriages. The relationship changes were reflected in the group's music, with later songs featuring darker and more introspective lyrics. After ABBA disbanded in December 1982, Andersson and Ulvaeus continued their success writing music for multiple audiences including stage, musicals and movies, while Fältskog and Lyngstad pursued solo careers. Ten years after the group broke up, a compilation, ''[[ABBA Gold]]'', was released, becoming a worldwide best-seller. In 1999, ABBA's music was adapted into ''[[Mamma Mia! (musical)|Mamma Mia!]]'', a stage musical that toured worldwide and, as of October 2024, is still in the top-ten longest running productions on both [[List of the longest-running Broadway shows|Broadway]] (closed in 2015) and the [[List of the longest-running West End shows|West End]] (still running). [[Mamma Mia! (film)|A film of the same name]], released in 2008, became the highest-grossing film in the United Kingdom that year. A sequel, ''[[Mamma Mia! Here We Go Again]]'', was released in 2018.\n\nABBA have record sales estimated to be between 150 million to 385&nbsp;million sold worldwide and the group were ranked 3rd best-selling singles artists in the United Kingdom with a total of 11.3&nbsp;million singles sold by 3 November 2012. In May 2023, ABBA were awarded the [[Brits Billion Award|BRIT Billion Award]], which celebrates those who have surpassed the milestone of one billion UK streams in their career. ABBA were the first group from a non-English-speaking country to achieve consistent success in the charts of English-speaking countries, including the [[UK Singles Chart|United Kingdom]], [[ARIA Charts|Australia]], [[Billboard Hot 100|United States]], [[Irish Recorded Music Association|Republic of Ireland]], [[Canadian Hot 100|Canada]], [[Recording Industry Association of New Zealand|New Zealand]] and [[Recording Industry of South Africa|South Africa]]. They are the best-selling Swedish band of all time and the best-selling band originating in [[continental Europe]]. ABBA had eight consecutive number-one albums in the UK. The group also enjoyed significant success in Latin America and recorded a [[Gracias Por La Música (album)|collection]] of their hit songs in Spanish. ABBA were inducted into the [[Vocal Group Hall of Fame]] in 2002. The group were inducted into the [[Rock and Roll Hall of Fame]] in 2010, the first recording artists to receive this honour from outside an Anglophonic country. In 2015, their song \"[[Dancing Queen]]\" was inducted into the [[Recording Academy]]'s [[Grammy Hall of Fame]]. In 2024, the United States [[Library of Congress]] included the album ''[[Arrival (ABBA album)|Arrival]]'' (1976) in the [[National Recording Registry]], which recognises works \"worthy of preservation for all time based on their cultural, historical or aesthetic importance in the nation’s recorded sound heritage\".\n\nIn 2016, the group reunited and started working on a digital [[Avatar (computing)|avatar]] concert tour. Newly recorded songs were announced in 2018. ''[[Voyage (ABBA album)|Voyage]]'', their first new album in 40 years, was released on 5 November 2021 to positive critical reviews and strong sales. [[ABBA Voyage]], a concert residency featuring ABBA as virtual avatars, opened in May 2022 in London.",
  "last_revision_date": "2025-06-20T00:01:58Z",
  "genres": [
    912,
    415,
    914,
    347
  ]
}