{
  "name": "ABBA",
  "description": "'''ABBA'''{{efn|An [[acronym]] of the first letters of the members' first names arranged as a [[palindrome]], usually stylised as '''A{{css-style|{{mirrorH}}|B}}BA'''. The group was originally named '''Björn & Benny, Agnetha & Anni-Frid''' or '''Björn & Benny, Agnetha & Frida'''.}} ({{IPAc-en|ˈ|æ|b|ə|audio=LL-Q1860 (eng)-Naomi Persephone Amethyst (NaomiAmethyst)-ABBA.wav}} {{respell|AB|ə}} {{IPA|sv|ˈâbːa|}}) were a Swedish pop group formed in Stockholm in 1972 by [[Agnetha Fältskog]], [[Björn Ulvaeus]], [[Benny Andersson]], and [[Anni-Frid Lyngstad]]. They are among the most renowned and commercially successful musical groups in history.\n\nIn {{Escyr|1974}}, ABBA won the [[Eurovision Song Contest]] for {{Esccnty|Sweden}} with their song \"[[Waterloo (song)|Waterloo]]\". In 2005, \"Waterloo\" was chosen as the best song in the competition's history during its [[Congratulations: 50 Years of the Eurovision Song Contest|50th anniversary celebration]]. During their peak, ABBA comprised two married couples: Fältskog and Ulvaeus, and Lyngstad and Andersson. As their fame grew, their personal lives suffered, leading to the dissolution of both marriages. These relationship changes were reflected in the group's later music, which featured darker and more introspective lyrics. After ABBA disbanded in December 1982, Andersson and Ulvaeus continued their success writing music for stage, musicals, and films, while Fältskog and Lyngstad pursued solo careers. Ten years after the group's breakup, the compilation ''[[ABBA Gold]]'' was released and became a worldwide best-seller. In 1999, ABBA's music was adapted into ''[[Mamma Mia! (musical)|Mamma Mia!]]'', a stage musical that toured globally. As of October 2024, it remains one of the ten longest-running productions on [[List of the longest-running Broadway shows|Broadway]] (closed in 2015) and the [[List of the longest-running West End shows|West End]] (still running). [[Mamma Mia! (film)|A film of the same name]], released in 2008, became the highest-grossing film in the United Kingdom that year. A sequel, ''[[Mamma Mia! Here We Go Again]]'', was released in 2018.\n\nABBA have sold in excess of 400 million records worldwide. In 2004 they received an award from Polar Records and Universal Music Group to commemorate achieving worldwide record sales of 360 million between 1974 and 2004, making them one of the [[List of best-selling music artists|best-selling acts in the history of popular music]]. The group are ranked as the third best-selling singles artist in the United Kingdom, with a total of 11.3 million singles sold as of 3 November 2012. In May 2023, ABBA received the [[Brits Billion Award|BRIT Billion Award]], which honours artists who have surpassed one billion UK streams in their careers. They were the first group from a non-English-speaking country to achieve consistent success on the charts in English-speaking countries, including the [[UK Singles Chart|United Kingdom]], [[ARIA Charts|Australia]], the [[Billboard Hot 100|United States]], the [[Irish Recorded Music Association|Republic of Ireland]], [[Canadian Hot 100|Canada]], [[Recording Industry Association of New Zealand|New Zealand]], and [[Recording Industry of South Africa|South Africa]]. ABBA are recognised as the best-selling Swedish band of all time and the best-selling band originating from [[continental Europe]]. The group achieved eight consecutive number-one albums in the UK and also enjoyed significant success in Latin America, recording a [[Gracias Por La Música (album)|collection]] of their hit songs in Spanish. ABBA were inducted into the [[Vocal Group Hall of Fame]] in 2002 and the [[Rock and Roll Hall of Fame]] in 2010, becoming the first recording artists to receive this honour from outside an Anglophone country. In 2015, their song \"[[Dancing Queen]]\" was inducted into the [[Recording Academy]]'s [[Grammy Hall of Fame]]. In 2024, the United States [[Library of Congress]] included the album ''[[Arrival (ABBA album)|Arrival]]'' (1976) in the [[National Recording Registry]], recognising it as a work \"worthy of preservation for all time based on its cultural, historical, or aesthetic importance in the nation's recorded sound heritage\".\n\nIn 2016, the group reunited and started working on a digital [[Avatar (computing)|avatar]] concert tour. Newly recorded songs were announced in 2018. ''[[Voyage (ABBA album)|Voyage]]'', their first new album in 40 years, was released on 5 November 2021, to positive critical reviews and strong sales. [[ABBA Voyage]], a concert residency featuring ABBA as virtual avatars, opened in May 2022 in London.",
  "last_revision_date": "2026-01-31T21:59:51Z",
  "genres": [
    357,
    427,
    950,
    952
  ]
}