{
  "page_title": "Adam Ant",
  "description": "'''Stuart Leslie Goddard''' (born 3 November 1954), known professionally as '''Adam Ant''', is an English singer, musician, and actor. He gained popularity as the lead singer of [[new wave music|new wave]] group [[Adam and the Ants]] and later as a solo artist, scoring 10 UK top ten hits from 1980 to 1983, including three UK No. 1 singles. He has also worked as an actor, appearing in many films and television episodes.\n\nAnt began his musical career playing bass in the band [[Bazooka Joe (band)|Bazooka Joe]]. From 1977 to 1982 he performed with Adam and the Ants. Their debut album ''[[Dirk Wears White Sox]]'' (1979) reached number one on the [[UK Indie Chart|UK Independent Albums Chart]]. Before recording his debut album as Adam and the Ants, he asked producer [[Malcolm McLaren]] to manage his band; McLaren instead took his backing band to form [[Bow Wow Wow]]. Ant regrouped with new members, including [[Marco Pirroni]], to release his second album ''[[Kings of the Wild Frontier]]'' (1980). It reached number one in the [[UK Album Chart]], spawned three hit singles, became the UK number-one selling album in 1981, and won [[Brit Award for British Album of the Year|Best British Album]] at the [[Brit Awards 1982|1982 BRIT Awards]]. He released his third and final album with the group, ''[[Prince Charming (album)|Prince Charming]]'' (1981), which spawned two UK number-one singles \"[[Stand and Deliver (Adam and the Ants song)|Stand and Deliver]]\" and \"[[Prince Charming (Adam and the Ants song)|Prince Charming]]\".\n\nIn 1982, he began a solo career, retaining [[Marco Pirroni]] as co-songwriter. His first solo album was ''[[Friend or Foe (album)|Friend or Foe]]'' (1982), from which the debut single \"[[Goody Two-Shoes (song)|Goody Two Shoes]]\" reached number one in the UK and Australia in 1982, and became his first top 20 hit in the United States on the [[Billboard Hot 100|''Billboard'' Hot 100]]. The album reached number five on the UK Albums Chart and number 16 on the US [[Billboard 200|''Billboard'' 200]] album chart, becoming his most successful solo album. His next two solo albums ''[[Strip (Adam Ant album)|Strip]]'' (1983) and ''[[Vive Le Rock]]'' (1985) were less commercially successful. Ant began to focus on an acting career, performing on stage and in film and television roles throughout the 1980s and 1990s. He released his fourth solo album ''[[Manners & Physique]]'' (1990) which was produced by [[André Cymone]] and featured a [[Minneapolis sound]]. Despite the US top 20 success of the single \"[[Room at the Top (Adam Ant song)|Room at the Top]]\", Ant was dropped from [[MCA Records]], and his album ''[[Persuasion (Adam Ant album)|Persuasion]]'' (1991) was shelved and never officially released. He signed with [[Capitol Records]] to release ''[[Wonderful (Adam Ant album)|Wonderful]]'' (1995). The single \"Wonderful\" became Ant's third US top 40 hit single.\n\nSince 2010, Ant has continued his music career, recording and releasing a new album ''[[Adam Ant Is the Blueblack Hussar in Marrying the Gunner's Daughter]]'' (2013, UK number 25), and completing eight full-length UK national tours, five US national tours, and two Australian tours. A further album, ''Bravest of the Brave'', was recorded in 2014 and is still awaiting release.",
  "last_revision_date": "2025-06-15T13:07:35Z"
}