{
  "description": "'''Ahab''' is a German [[Doom metal#Funeral doom|funeral doom metal]] band founded in 2004 by [[Midnattsol]] guitarists Christian Hector and [[Daniel Droste]]. The band is named after [[Captain Ahab]], a character in the 1851 novel ''[[Moby-Dick]]'' by [[Herman Melville]]. Along with its name, the band also draws thematic and lyrical inspiration from ''Moby-Dick''; some songs even feature direct quotations from the book.\n\nNear the end of 2004, with one song already written, Christian Hector and [[Daniel Droste]] decided to form a band and recorded their first single, ''The Stream''. On 15 April 2005, after several months of rehearsing, the band's first demo, ''The Oath'', was released. The demo was limited to 30 hand-numbered copies and contained the band's first song, \"The Stream\", as well as two new songs and an outro track. Nearly a year and a half later, ''[[The Call of the Wretched Sea]]'', the group's first full-length album was released on [[Napalm Records]] with the help of new band member Stephan Adolph and session drummer Cornelius Althammer.\n\nAfter the release of ''[[The Call of the Wretched Sea]]'', the band played some few gigs in Europe. In 2008, shortly after playing at the [[Summer Breeze Open Air]] metal festival in [[Dinkelsbühl]], [[Germany]], bassist Stephan Adolph left the band due to \"personal differences.\" He was quickly replaced by Stephan Wandernoth, a member of the band Dead Eyed Sleeper to which the drummer, Cornelius, also belongs.\n\nThe band's next album ''[[The Divinity of Oceans]]'' was released in July 2009.\n\nIn April 2012, Ahab announced they would be releasing their third studio album, titled ''The Giant'', later in 2012. The announcement included the artwork and track listing.\n\nAhab released ''[[The Boats of the \"Glen Carrig\" (album)|The Boats of the \"Glen Carrig\"]]'', on 28 August 2015. It is a concept album based on [[William Hope Hodgson]]'s [[The Boats of the \"Glen Carrig\"|novel]] of the same name.\n\nAhab released their most recent album, ''[[The Coral Thombs|The Coral Tombs]]'', on Friday January the 13th 2023 and made the charts in the US, this time taking their fans on a musical journey with ''[[Captain Nemo]]'' and ''[[Professor Aronnax]]'' through the depths of the sea and the abysmal nature of mankind.\n\nTo date, Ahab has released five studio albums and one live album and has performed across Europe. The band is currently endorsed by several music gear manufactures including Neunaber Audio, LICHTLÆRM Audio and ICE Stix.",
  "last_revision_date": "2025-06-02T02:10:16Z"
}