{
  "name": "AKB48",
  "description": "'''AKB48''' (pronounced ''A.K.B. Forty-Eight'') is a [[Japanese idol]] musical girl group named after the [[Akihabara]] area in Tokyo, where the group's theater is located. AKB48 has sold more records than any other female musical act in Japanese history. AKB48's producer, [[Yasushi Akimoto]], wanted to form a [[girl group]] with its own theater and performing daily so fans could always see them live (which is not the case with usual pop groups giving occasional concerts and seen on television). This \"Idols You Can Meet\" concept includes teams which can rotate performances and perform simultaneously at several events and \"handshake\" events, where fans can meet group members. Akimoto has expanded the AKB48 concept to several girl groups within Japan, and internationally in China, Indonesia, Thailand, Taiwan, Philippines and Malaysia.\n\nAKB48 have been characterized as a social phenomenon.  They are among the highest-earning musical acts in Japan, and are the [[List of best-selling girl groups#Best-selling girl groups worldwide|seventh-best-selling girl group worldwide]]. For example, their 2012 sales from record and DVD/Blu-ray releases reached $226 million, earning the group the top spot in the 2012 artist ranking. By April 2019, the group had sold over 60&nbsp;million records, including over 6 million albums. At least 35 of AKB48's [[single (music)|singles]] have topped the ''[[Oricon]]'' [[Oricon Singles Chart|Weekly Singles Chart]], with at least 30 singles selling over a million copies each, making the group the [[List of best-selling music artists in Japan|highest selling musical act in Japan]] in terms of singles sold. Their highest selling single, \"[[Teacher Teacher (AKB48 song)|Teacher Teacher]]\", sold over 3&nbsp;million in 2018 according to ''[[Billboard (magazine)|Billboard]]'' / [[Soundscan]]. Between 2010 and 2020, AKB48's singles occupied at least the top two spots of the Oricon Yearly Singles Chart. As of their 61st single, they sold over 70 million copies. With their 66th single released, they ranked #1 on Orion 53 consecutive times, starting with \"RIVER\" in 2009.",
  "last_revision_date": "2026-02-01T06:51:27Z",
  "genres": [
    630
  ]
}