{
  "name": "Al Jolson",
  "description": "'''Al Jolson''' (born '''Asa Yoelson''', {{langx|yi|אַסאַ יואלסאָן}}; {{circa}} May 26, 1886 (O.S.) June 9, 1886 (N.S.) – October 23, 1950) was an American singer, comedian, actor, and [[vaudevillian]].\n\nSelf-billed as \"The World's Greatest Entertainer,\" Jolson was one of the United States' most famous and highest-paid stars of the 1910s and 1920s. He was known for his \"shamelessly sentimental, melodramatic approach\" towards performing, along with popularizing many of the songs he sang. According to music historian Larry Stempel, \"No one had heard anything quite like it before on Broadway.\" [[Stephen Banfield]] wrote that Jolson's style was \"arguably the single most important factor in defining the modern musical.\" Jolson has been referred to by modern critics as \"the king of [[blackface]] performers\".\n\nAlthough best remembered today as the star of the first talking picture, ''[[The Jazz Singer]]'' (1927), he starred in a series of successful musical films during the 1930s. After the [[attack on Pearl Harbor]] in December 1941, he was the first star to entertain troops overseas during World War II. After a period of inactivity, his stardom returned with ''[[The Jolson Story]]'' (1946), in which [[Larry Parks]] played the younger Jolson, but with sung vocals dubbed by Jolson himself. The formula was repeated in a sequel, ''[[Jolson Sings Again]]'' (1949). In 1950, he again became the first star to entertain GIs on active service in the [[Korean War]], performing 42&nbsp;shows in 16&nbsp;days. He died weeks after returning to the U.S., partly owing to the physical exhaustion from the performance schedule. Defense Secretary [[George Marshall]] posthumously awarded him the [[Medal for Merit]].\n\nWith his dynamic style of singing, he became widely successful by extracting traditionally [[African-American music]] and popularizing it for White American audiences who would be unwilling to listen to it when performed by Black artists. Despite his promotion and perpetuation of Black stereotypes, his work was often well regarded by Black publications, and he has been credited for fighting against Black discrimination on Broadway as early as 1911. In an essay written in 2000, music critic [[Ted Gioia]] remarked, \"If blackface has its shameful poster boy, it is Al Jolson\", showcasing Jolson's complex legacy in American society.\n{{TOC limit|limit=3}}",
  "last_revision_date": "2025-11-14T16:03:57Z",
  "genres": [
    139,
    1009,
    1228
  ]
}