{
  "name": "Alabama",
  "description": "'''Alabama''' is an American [[country music]] band formed in [[Fort Payne, Alabama]], in 1969. The band was founded by [[Randy Owen]] ([[lead vocals]], [[rhythm guitar]]) and his cousin Teddy Gentry ([[Bass guitar|bass]], [[Backing vocalist|backing vocals]]). They were soon joined by another cousin, [[Jeff Cook]] ([[lead guitar]], [[fiddle]], and [[Keyboard instrument|keyboard]]s). First operating under the name Young Country and later Wildcountry, the group toured the [[Southeast United States|Southeast]] bar circuit in the early 1970s, and began writing original songs. They changed their name to Alabama in 1977 and following the chart success of two singles, were approached by [[RCA Records]] for a recording deal.\n\nAlabama's biggest success came in the 1980s, when the band had 27 country No. 1 hits, seven multi-platinum albums, and received numerous major awards. Alabama's first single on RCA Records, \"[[Tennessee River (song)|Tennessee River]]\", began a streak of 21 country No. 1 singles, including \"[[Love in the First Degree (Alabama song)|Love in the First Degree]]\" (1981), \"[[Mountain Music (song)|Mountain Music]]\" (1982), \"[[Dixieland Delight]]\" (1983), \"[[If You're Gonna Play in Texas (You Gotta Have a Fiddle in the Band)]]\" (1984) and \"[[Song of the South (song)|Song of the South]]\" (1988). The band's popularity waned slightly in the 1990s, although they continued to produce hit singles and multi-platinum albums. Alabama disbanded in 2004 following a farewell tour and two albums of inspirational music, but reunited in 2010 and has continued to record and tour worldwide.\n\nThe band's blend of traditional [[country music]] and [[Southern rock]] combined with elements of [[bluegrass music|bluegrass]], [[folk music|folk]] and [[pop music]] gave it a [[crossover (music)|crossover]] appeal that helped lead to their success. They also [[concert|toured]] extensively and incorporated production elements such as lighting and sets inspired by [[rock concert]]s into their shows. The band has over 41 number-one country records on the ''[[Billboard (magazine)|Billboard]]'' charts to their credit and have sold over 75&nbsp;million records, making them the [[List of best-selling music artists|most successful band in country music history]]. [[AllMusic]] credited the band with popularizing the idea of a country band and wrote that \"It's unlikely that any other country group will be able to surpass the success of Alabama.\"{{sfn|Erlewine|Woodstra|Bogdanov|Erlewine|1997|p=6}}\n\n \nAlabama was inducted into the [[Musicians Hall of Fame and Museum]] in 2019 and was awarded the first-ever Life Time Achievement Award from this institution.\n\nThey were inducted into the [[Country Music Hall of Fame and Museum]] in 2005.\n\nThe group is known for hits such as \"[[Mountain Music (song)|Mountain Music]],” \"[[Dixieland Delight]],” \"[[Song of the South (song)|Song of the South]],” and “[[I'm in a Hurry (And Don't Know Why)|I’m In A Hurry (And Don’t Know Why)]].”",
  "last_revision_date": "2026-01-22T01:14:02Z",
  "genres": [
    140,
    250,
    295,
    1160
  ]
}