{
  "name": "Alan Murin",
  "description": "'''Alan Murín''', known as '''Alan Murin''', previously performing under the pseudonym '''Sane''' [pronounced: seɪn] (born October 23, 1998), is a Slovak singer, composer, [[Record producer|music producer]] and [[Audio engineer|sound engineer]]. He began his music career in 2019 with the release of his debut EP trilogy, ''15 23'', ''23 10'' and ''19 98''. He has released one studio album and four EPs. Some of his biggest hits include the songs \"Do Rúk,\" \"Domov,\" \"Dokola,\" and \"Prepáč.\"\n\nThrough the success of several singles, he gained the attention of a wider audience. This recognition led to collaborations with several Slovak artists and producers, such as Kali, [[Rytmus]], Ego, Separ, [[Majk Spirit]], [[Tina (singer)|Tina]], [[Pil C]], [[Celeste Buckingham]], [[Dominika Mirgová]], [[ADiss]], [[Momo (Slovakian musician)|Momo]], or the band [[Moja Reč]], as well as international artists like [[Raunii]], [[IOVA]] and [[Serban Cazan]].\n\nIn 2022, he released his debut album, ''[[Trueself]]'', which achieved success in Slovakia. Album debuted at the top of the Slovak albums chart of the ČNS [[International Federation of the Phonographic Industry|IFPI]]. In the same year, he won three awards at [[Ruka Hore Awards|the Ruka Hore Awards]] and his debut took 2nd place in ''the Album of the Year'' category. Murin is actively involved in music engineering and production, while also writing his own song lyrics. He has worked on productions in Great Britain, the USA, the Czech Republic and Romania. He produced songs for Dominika Mirgová, for example.\n\nHis music videos on YouTube frequently rank among the top on the Slovak YouTube trending chart. The first to reach this peak was the music video for his single \"Prepáč\", which quickly climbed to the top within hours of its release and remained there for several weeks. He also topped the YouTube trending chart with the duet \"Do Rúk\" featuring Tina, despite the song not having an official music video at the time. Due to its popularity, a music video was later created, which remains his most-watched video on the platform, with over 7 million views. His hit \"Raz Dva Tri\" also achieved trending status as his third song on the Slovak YouTube chart. Murin's YouTube channel has more than 50 million views to date.\n\nMurin is known for his distinctive interpretation, authenticity and directness.'''''' His musical style incorporates elements of pop, rock, hip-hop, and electronic music. He himself classifies his work as New Pop, which, however, is based on a long-standing affection for rap. Murin is known for his distinct sound, blending modern production with authentic lyrics that often explore themes of love and personal experience.\nIn addition to a very specific sound quality, his asset is his musical education. After two years of intensive work in the Slovak music industry, he became one of the most active Slovak performers.",
  "last_revision_date": "2025-11-19T04:21:52Z",
  "genres": [
    558,
    844
  ]
}