{
  "name": "Alexander Rosenbaum",
  "description": "'''Alexander Yakovlevich Rosenbaum''' [[People's Artist of Russia|PAR]] ({{langx|ru|link=no|Александр Яковлевич Розенбаум}}, ''Aleksandr Jakovlevič Rozenbaum'') (born September 13, 1951) is a Russian [[Bard (Soviet Union)|bard]] from [[Saint Petersburg]].\n\nAmong his most famous songs are the ones about [[Saint Petersburg|Leningrad]], the [[Soviet–Afghan War]], [[Cossack]]s, and [[Odessa]]. Songs such as \"Gop-Stop\" (a comedy about two gangsters executing an unfaithful lover) and \"Vals-boston\" ([[Boston (dance)|The Boston Waltz]]) are popular across Russian social groups and generations.\n\nRosenbaum is an accomplished guitarist and accompanies himself on either a six- or twelve-string acoustic guitar, using the [[Open G tuning]] adopted from the [[Russian guitar|Russian seven string guitar]].\n\nHis attitude toward the criminal song genre can best be illustrated by his own words:\n{{cquote|Only a dull-witted person would think that this should not be, that this is wrong. All those songs that I call \"songs of confinement,\" that have lasted and will last, are works of art, and as a rule they are written by cultured and educated people. Because everything that is composed in huge quantities at penitentiaries can very rarely be described as [high quality] work. ... It is very important to understand why those songs are composed, for whom and how. ... They are set in a criminal context, they contain criminal themes, but they are not at all about that. If you read and listen to them carefully, they will tell you of faithfulness, love and many other things. ... I am sometimes asked: \"Why do you not write ''[[blatnaya pesnya]]'' anymore?\" I am not interested in it today. The nondescript chaos now has abated somewhat, fortunately, but three, four or five years ago you switched on the crate<!-- translation remark: I do not actually know what he meant, when he said \"утюг\" (literally \"iron\", the implement to make clothes smooth). Maybe he used the word as a colloquial occasionalism to designate a TV set or a radio. But then maybe he meant just that – an iron; maybe he hyperbolically meant that even switching on an iron would make the cheap music flow from there. --> – and had low-down trash rushing at you... Not the blatnaya pesnya that I treat with respect, but cheap ''blatota''.<ref>{{cite web |title=Official site. March 2001 charity concert transcript (interaction with audience) |url=http://www.rozenbaum.ru/public/index.php?type=2&id=3&id2=30 |access-date=December 4, 2007 |archive-url=https://web.archive.org/web/20071018174404/http://www.rozenbaum.ru/public/index.php?type=2&id=3&id2=30 |archive-date=October 18, 2007 |url-status=dead |df=mdy-all}}</ref>}}",
  "last_revision_date": "2025-05-29T09:54:23Z",
  "genres": [
    1042
  ]
}