{
  "name": "Ali Kiba",
  "description": "'''Ali Saleh Kiba''' (born 29 November 1986), best known as '''Ali Kiba''' or occasionally as '''King Kiba''', is a [[Tanzanian]] musician and songwriter. He is one of the most talented musicians in East Africa and mostly considered the King of Bongo Flava music Genre. He is from Kigoma and the owner of both Kings Music label and Crown Media Group. With hit songs such as  ''Mwana'', ''Aje'', ''Chekecha Cheketua'', ''Cinderella'', ''Nakshi Mrembo'', ''Usiniseme'', ''Dushelele'', ''Single Boy'' with [[Lady Jaydee]], ''Mapenzi Yana Run Dunia and ''Macmuga.'' Ali Kiba is usually regarded as one of the most successful [[Bongo Flava]] stars usually associated with his close rival [[Diamond Platnumz]].\n\nIn 2008 Alikiba collaborated with [[R. Kelly]] and other African musicians on the One 8 project. Since then the multiple award-winner singer collaborated with various music heavyweights such as [[Patoranking]], [[Sauti Sol]], [[Marioo]], [[Nyashinski]], [[Khaligraph Jones]] and [[Sarkodie (rapper)|Sarkodie]] among others.\n\nAround 2011 Alikiba took a three years hiatus from the music industry and returned in 2014 with the release of \"Mwana\". The song was well received by fans and made him to win 5 awards at the 2015 Tanzania Music Awards \n \nOn his comeback, Alikiba was signed under Rockstar 4000, music label owned by Christine Mosha. Under the label, Alikiba released many hit songs including ''Chekecha Cheketua'', ''Lupela'', ''Mvumo Wa Radi a''nd ''Aje'', a Bongo Flava love song that was ranked number 3 by [[NotJustOk|Notjustok]] on their list of Best 100 Tanzanian songs of the decade ranging from 2012 to 2022\n \nIn May 2016, Alikiba signed to [[Sony Music]], being the first East African to be signed by the recording company. He left both Sony and Rockstar 4000 in 2021 and started his own record label, Kings Music which now houses different Tanzanian acts such as ''Tommy Flavour'', ''Vanillah'', ''K2ga'' and ''Abdu Kiba''.\n\nIn November 2021, Alikiba released his third studio album titled ''Only One King'' containing 16 songs including ''Utu, Niteke, Salute'' featuring Rude Boy, Jealous featuring [[Mayorkun]] and Washa featuring [[Nyashinski]].\n\n''Only One King'' which Alikiba termed as a \"Pan African album\" went on to win the Best Album category in the 2022 [[Tanzania Music Awards|Tanzanian music awards]],  a highly prestigious ceremony that Alikiba went on to win 5 awards in a single night where he also won other categories such as  Best Male Artist People's Choice, Best Music Video for his smash hit \"Salute\" featuring Nigerian Rudeboy, Best Melodic Songwriter of the Year and Best East African Artist during the ceremony.\n\nAlikiba became the most awarded Tanzanian artist in the 2022 Tanzania Music Awards  followed by [[Nandy (singer)|Nandy]] and [[Marioo]] who won 3 awards each.\n\nOn March 10, 2024, Bongo Flava star Alikiba launched his new radio station, Crown FM 92.1, broadcasting in Dar es Salaam, Zanzibar, Tanga, and Pwani.",
  "last_revision_date": "2025-04-28T07:11:17Z",
  "genres": [
    145,
    276,
    805
  ]
}