{
  "name": "Alice Cooper",
  "description": "'''Alice Cooper''' (born '''Vincent Damon Furnier'''; February 4, 1948) is an American singer and songwriter. With a career spanning more than five decades, Cooper is known for his raspy singing voice and theatrical stage shows that feature numerous [[Prop|props]] and [[Stage illusion|illusions]]. He is considered by [[Music journalism|music journalists]] and peers to be \"The Godfather of [[Shock rock|Shock Rock]]\". He has drawn from [[Horror film|horror films]], [[vaudeville]], and [[garage rock]] to pioneer a macabre and theatrical brand of [[Rock music|rock]] designed to shock audiences.\n\nOriginating in [[Phoenix, Arizona]] in 1964, [[Alice Cooper (band)|Alice Cooper]] was originally a band consisting of Furnier, guitarists [[Glen Buxton]] and [[Michael Bruce (musician)|Michael Bruce]], bassist [[Dennis Dunaway]], and drummer [[Neal Smith (drummer)|Neal Smith]]. The band released seven studio albums and several singles from 1969 to 1973. Following the group disbanding in 1975, Furnier legally changed his name to Alice Cooper and began a solo career with the concept album ''[[Welcome to My Nightmare]]'' (1975). He gained mainstream success with the singles \"[[Poison (Alice Cooper song)|Poison]]\" and \"[[School's Out (song)|School's Out]]\"; the latter of which became his biggest international hit and was inducted into the [[Grammy Hall of Fame]] in 2015. Over the course of his career, Cooper has released [[Alice Cooper discography|30 studio albums]] and sold over 50 million records worldwide.   \n\nCooper has experimented with various musical styles, mainly [[hard rock]], [[glam rock]], [[Heavy metal music|heavy metal]], and [[glam metal]], as well as [[New wave music|new wave]], [[art rock]], and [[industrial rock]].  He helped shape the sound and look of heavy metal, and he has been described as the artist who \"first introduced horror imagery to rock'n'roll, and whose stagecraft and showmanship have permanently transformed the genre\". Cooper is also known for his wit offstage, with ''[[The Rolling Stone Album Guide]]'' calling him the world's most \"beloved heavy metal entertainer\". He was inducted into the [[Rock and Roll Hall of Fame]] in 2011. \n\nAside from his recording career, Cooper is also a film actor, a golfing celebrity, a restaurateur, and, since 2004, a radio [[disc jockey]] with his classic rock show [[Nights with Alice Cooper|''Alice's Attic'']]. He is also known for his philanthropic work, particularly through his Solid Rock Foundation, which provides free music, art, and vocational programs for at-risk youth in [[Phoenix, Arizona]].",
  "last_revision_date": "2025-11-19T18:33:43Z",
  "genres": [
    496,
    533,
    548,
    1111
  ]
}