{
  "name": "Alice Cooper",
  "description": "'''Vincent Damon Furnier''' (born February 4, 1948), known by his stage name '''Alice Cooper''', is an American rock singer whose career spans six decades. With a raspy voice and a stage show that features numerous [[prop]]s and [[stage illusion]]s, Cooper is considered by [[Music journalism|music journalists]] and peers to be \"The Godfather of [[Shock rock|Shock Rock]]\". He has drawn from [[horror film]]s, [[vaudeville]], and [[garage rock]] to pioneer a macabre and theatrical brand of rock designed to shock audiences.\n\nOriginating in [[Phoenix, Arizona]], in 1964, [[Alice Cooper (band)|Alice Cooper]] was originally a band consisting of Furnier, guitarists [[Glen Buxton]] and [[Michael Bruce (musician)|Michael Bruce]], bassist [[Dennis Dunaway]], and drummer [[Neal Smith (drummer)|Neal Smith]]. The band released seven albums from 1969 to 1973 and broke up in 1975. Having legally changed his name to Alice Cooper, Furnier began a solo career that year with the concept album ''[[Welcome to My Nightmare]]''. During his career he has sold over 50 million records.\n\nCooper has experimented with various musical styles, mainly [[hard rock]], [[glam rock]], [[Heavy metal music|heavy metal]], and [[glam metal]], as well as [[New wave music|new wave]], [[art rock]], and [[industrial rock]]. He helped shape the sound and look of heavy metal, and he has been described as the artist who \"first introduced horror imagery to rock'n'roll, and whose stagecraft and showmanship have permanently transformed the genre\". He is also known for his wit offstage, with ''[[The Rolling Stone Album Guide]]'' calling him the world's most \"beloved heavy metal entertainer\". Aside from music, Cooper is a film actor, a golfing celebrity, a restaurateur, and, since 2004, a radio [[disc jockey]] (DJ) with his classic rock show ''Alice's Attic''.",
  "last_revision_date": "2025-07-18T23:56:17Z",
  "genres": [
    491,
    542,
    528,
    1091
  ]
}