{
  "name": "Alice in Chains",
  "description": "'''Alice in Chains''' (often abbreviated as '''AiC''') is an American rock band formed in [[Seattle]] in 1987. Since 2006, the band's lineup has comprised vocalist/guitarists [[Jerry Cantrell]] and [[William DuVall]], bassist [[Mike Inez]], and drummer [[Sean Kinney]]. Vocalist [[Layne Staley]] and bassist [[Mike Starr (musician)|Mike Starr]] are former members of the band. The band took its name from Staley's previous band, [[Alice N' Chains]]. Often associated with [[grunge]] music, Alice in Chains' sound and style is rooted in [[Heavy metal music|heavy metal]]. The band is known for its distinctive vocal style, which often included the [[vocal harmony|harmonized]] vocals between Staley and Cantrell (and later Cantrell and DuVall).\n\nAlice in Chains rose to international fame as part of the grunge movement of the early 1990s, along with other Seattle bands such as [[Nirvana (band)|Nirvana]], [[Pearl Jam]], and [[Soundgarden]]. They achieved success during the era with the albums ''[[Facelift (album)|Facelift]]'' (1990), ''[[Dirt (Alice in Chains album)|Dirt]]'' (1992) and ''[[Alice in Chains (album)|Alice in Chains]]'' (1995), as well as the extended play ''[[Jar of Flies]]'' (1994). The band was plagued by extended inactivity from 1996 onward, largely due to Staley's [[substance abuse]], which resulted in his death in 2002 and caused the band to go on hiatus. Alice in Chains reunited in 2005, with DuVall joining in 2006 as rhythm guitarist and sharing lead vocal duties; the band has since released three more albums: ''[[Black Gives Way to Blue]]'' (2009), ''[[The Devil Put Dinosaurs Here]]'' (2013) and ''[[Rainier Fog]]'' (2018).\n\nSince its formation, Alice in Chains has released six studio albums, three EPs, three live albums, four compilations, two DVDs, 43 music videos and 32 [[Alice in Chains discography#Singles|singles]]. The band has sold more than 30 million records worldwide, and over 20 million records in the US alone. It has had 18 Top 10 songs on [[Billboard (magazine)|''Billboard'']]'s [[Hot Mainstream Rock Tracks|Mainstream Rock Tracks]] chart and 5 No. 1 hits, and has received eleven [[Grammy Award]] nominations. The band was ranked number 34 on [[VH1]]'s ''100 Greatest Artists of Hard Rock'' special and as the 15th greatest live band by ''[[Hit Parader]]''.",
  "last_revision_date": "2025-08-17T21:49:55Z",
  "genres": [
    39,
    42,
    519,
    547,
    1113
  ]
}