{
  "name": "Alla Pugacheva",
  "description": "'''Alla Borisovna Pugacheva'''{{efn-ua|{{family name explanation|Borisovna|Pugacheva|lang=Eastern Slavic}} Sometimes '''Pugachova'''}} ({{langx|ru|Алла Борисовна Пугачёва|link=no}}, {{IPA|ru|ˈalːə bɐˈrʲisəvnɐ pʊɡɐˈtɕɵvə|IPA}}; born 15 April 1949) is a Russian singer and songwriter. Her career began in 1965 and continues to this day, although she retired from performing in 2010 after the international [[concert tour]] \"Dreams of Love\". For her \"clear [[mezzo-soprano]] and a full display of sincere emotions\", she enjoys an [[Pop icon|iconic status]] across the [[Post-Soviet states|former Soviet Union]] as the most successful Soviet performer in terms of record sales and popularity. For several decades, Pugacheva was a sex symbol, a style icon, an inspiration for Soviet women and a heroine of Russian tabloids. In the media, Pugacheva has been called \"[[Honorific nicknames in popular music|the Queen of Russian pop music]]\". Pugacheva is one of the few Russian performers who has achieved international success, along with [[Anna Netrebko]] and [[t.A.T.u.]] Some Russian publications have suggested that she would not be welcome to return to Russia.\n\nHer repertoire includes over 500 songs in Russian, English, German, French, Kazakh, Hebrew, Finnish and Ukrainian, and her discography has more than 100 records, CDs and DVDs. In addition to Russia and the former Soviet Union, Pugacheva's albums have been released in [[Japan]], [[South Korea|Korea]], [[Sweden]], [[Finland]], [[Germany]], [[Poland]], [[Czech Republic|Czechia]], [[Slovakia]], [[Bulgaria]] and [[Israel]]. In total, she has sold more than 250 million records. Her debut album, ''Mirror of the Soul'', has sold 10 million copies. Pugacheva's other albums were also successful, including ''How Disturbing Is This Way'', released in 1982, which sold 7 million copies.\n\nDuring her career, Pugacheva has toured [[Eastern Europe]], the [[Baltic states]], [[Scandinavia]], [[Central Asia]] and other countries around the world, including the [[United States]], [[United Kingdom]]''',''' [[France]], [[Netherlands]], [[Greece]], [[Italy]] and Israel. She has performed in some of the most famous concert halls in the world, including [[Carnegie Hall]] in [[New York City|New York]], [[Olympia (Paris)|Olympia]] in [[Paris]], [[Friedrichstadt-Palast]] in [[Berlin]], [[Royal Theater Carré|Royal Theater Carre]] in [[Amsterdam]] and [[Hammersmith Apollo|Apollo]] in [[London]].\n\nIn addition to Russia and the countries of the former USSR, Pugacheva's [[Single (music)|singles]] were included in the [[hit parade]] in other countries of Europe and Asia, including France, Sweden, Poland, Greece, Japan and [[Mongolia]].The singles \"[[Arlekino|Harlequin]]\" and \" [[Million Roses|А Million Scarlet Roses]]\" are her main international hits.\n\nIn 1988, ''[[Billboard (magazine)|Billboard]]'' noted that Pugacheva “ranks with such great musicians of all time as [[Bing Crosby]], [[Elvis Presley]] and [[Michael Jackson]]. In 2000, ''[[The New York Times]]'' called her \"the goddess of Russian pop music, Moscow's [[Tina Turner]] with a touch of [[Édith Piaf]]\".\n\nShe became a [[People's Artist of the USSR]] in 1991, a Laureate of the [[State Prize of the Russian Federation]] in 1995. In addition to state awards, Pugacheva was awarded regional and international music prizes. She has received awards in several countries around the world, including the United States, Germany, Finland, Poland, Bulgaria, [[Ukraine]], [[Belarus]], [[Azerbaijan]], [[Armenia]] and the [[Ampex Golden Reel Award]], among others. Pugacheva was recognized as the best singer of the 20th century in Eastern Europe by the [[ZD Awards]], named a living legend and the best performer of the 1990s decade by the [[Ovation (award)|Ovation Award]]. In 2017, she was included in the list of \"100 most influential Russians of the century\" according to [[Forbes]], along with [[Mikhail Gorbachev]], [[Yuri Gagarin]] and [[Pavel Durov]]. In 2022, she was among three Russian women included in the [[BBC's 100 Women]] list. Pugacheva was inducted into the [[Top Hit Music Awards]] Hall of Fame. For several decades, Pugacheva had the largest fee among performers in Eastern Europe. Due to her many years of popularity in Eastern Europe and Central Asia, Pugacheva was compared by the media to [[Madonna]], and she received the nickname Russian Madonna.\n\nIn addition to her career on the music stage, she starred in films and [[Musical film|musicals]], voiced films and recorded [[soundtrack]]s. Pugacheva is considered a [[gay icon]], and in 2012 she supported the punk group [[Pussy Riot]]. She was a [[UNICEF Goodwill Ambassador]] from 1998 to 2007.",
  "last_revision_date": "2025-06-20T07:30:53Z"
}