{
  "name": "Amalia Bakas",
  "description": "'''Amalia Bakas''' (born '''Mazaltov [Mally] Matsa''' 1897–1979) was a [[Greek people|Greek]] singer and performer in the [[United States]] during the 20th century. She was heavily involved in the \"Eighth Avenue scene\"{{clarify|date=January 2011}} in [[New York City]] and in Greek communities around the United States.\n\nHer repertoire consisted of mostly traditional songs to which she added her own style and words. Unlike other singers of the time, her songs were mostly about love.  She also wrote two songs, \"Elenitsa Mou\" after she was baptized and \"Diamontoula Mou\" for her daughter.\n\nLittle is known about Bakas before her time in the United States. She was born in [[Ioannina]] in the [[Janina Vilayet]] of the [[Ottoman Empire]] in a [[Romaniotes|Romaniote]] Jewish community. The Romaniote community was male-dominated and births of females were not even recorded which may account for lack of information of Amalia’s early life.\n\nIn 1912, when Bakas was 15 years old, she traveled to America on the [[SMS Kaiser Franz Joseph I|Kaiser Franz Josef I]] [[ocean liner]]. She was detained at [[Ellis Island]], lacking the necessary $50 fee until a phone call to a relative was made, who paid the fee for her. In 1913, she married Jack Saretta, also from Ioannina and they lived on Rivington Street on the [[Lower East Side]] in New York, NY. She worked in a factory as a [[seamstress]] and the couple had two daughters, Diamond and Ester Cleonike.\n\nIn the 1920s, Bakas began to perform in the [[Music of Greece#Greece during Ottoman Empire|café-amans]] and Turkish nightclubs in the early 1920s taking the [[stage name]] Amalia. Her first recordings were made with the M.G. Parsekian Record Company in [[Hoboken, New Jersey]] and consisted of 8 Turkish songs. Later in [[Chicago]] she recorded 6 Greek and Turkish songs with the Greek Record Company. Bakas also recorded with [[Marika Papagika]], another popular Greek singer of the time. Bakas was one of Papagika’s only known friends and Papagika would babysit her daughter Diamond.\n\nHer daughter Diamond would often perform with her mother by either singing duets or by accompanying her on the [[Goblet drum|doumbek]]. As the life of a performer was not one a woman of the Romaniote community should be leading, Bakas' husband divorced her and sent her other daughter Ester to live in Greece. In 1926 she converted to the [[Greek Orthodox Church]] to marry Gus Bakas. Amalia and Gus worked in the restaurant business with Bakas still performing at the café-amans on 8th Avenue in New York City.\n\nDuring the 1930s, Bakas did not record, but traveled the United States to perform with George Katsaros. They performed in New York City, the [[Catskills|Catskill Mountain region]], [[Finger Lakes]] region, [[Detroit]], Chicago, [[Gary, Indiana]] and [[Philadelphia]] where large Greek communities resided.\n\nIn this period of the Second World War, Bakas and her daughter Diamond were living in Chicago, working at a restaurant called Pantheon where she also performed. In the early part of the decade, Bakas recorded for Ajdin Aselois labels in which she had part ownership. She performed with a variety of artists including [[Gus Gadines]], John Pappas, John Dalas, Garbis Bakirgian, Theodore Kappas, Alexis Zervas, and Nicke Doneff.\n\nDuring this period, the 1940s, there was a revival of Greek songs from the 1910s and 1920s and Amalia’s recordings reflected this shift. This revival can be directly attributed to the mass exodus of Greek refugees fleeing from Turkey to Greece - escaping the 20th century's first mass genocide.\n\nOver one-third of Amalia's music during this period were old songs from her own or from the pioneer Greek vocalist Coula Antonopoulos's early recorded music - which were laments, music expressing personal anguish and resilience in times of hardship, adversity, and atrocities. These provided some solace to expatriates eager to begin a new life in America.\n\nIn the early 1960s, Amalia retired from the performing life. She moved to [[New Port Richey, Florida]] to be close to her daughter in 1974. She died in 1979 and her obituary did not even mention her career as a singer.",
  "last_revision_date": "2025-06-12T04:41:14Z",
  "genres": [
    657,
    1029
  ]
}