{
  "name": "Animal Collective",
  "description": "'''Animal Collective''' is an American [[experimental pop]] band formed in [[Baltimore County]], [[Maryland]]. Its members consist of [[Avey Tare]] (David Portner), [[Panda Bear (musician)|Panda Bear]] (Noah Lennox), [[Geologist (musician)|Geologist]] (Brian Weitz), and [[Deakin (musician)|Deakin]] (Josh Dibb). The band's work is characterized by an eclectic exploration of styles, including [[psychedelic music|psychedelia]], [[freak folk]], [[noise music|noise]], and [[electronica]], with the use of elements such as [[loop (music)|loops]], [[drone (music)|drones]], [[sample (music)|sampling]], vocal harmonies, and [[sound collage]]. [[AllMusic]]'s Fred Thomas suggests that the group \"defined the face of independent [[experimental rock]] during the 2000s and 2010s.\"\n\nThe band members met in school and started recording together in various forms of collaboration from a young age. In 1999, they established the record label [[Paw Tracks]], issuing what is now considered their debut album, ''[[Spirit They're Gone, Spirit They've Vanished]]'' (2000), as well as work by other artists. The band's 2007 album ''[[Strawberry Jam]]'' was their first to chart on the [[Billboard 200|''Billboard'' 200]]. Their 2009 follow-up ''[[Merriweather Post Pavilion (album)|Merriweather Post Pavilion]]'' was the band's most commercially successful album, reaching No. 13 on the US chart; its reverb-heavy [[psychedelic pop]] sound proved highly influential to independent music of the subsequent decade.\n\nRecords released under the name \"Animal Collective\" may include contributions from any or all of its members. Evolving from early collaborations between Lennox and Portner, the collective was not officially established until all four members came together for the 2003 album currently titled ''[[Here Comes the Indian|Ark]]''. Most prior collaborations between the band members were then retroactively classified under Animal Collective's discography. In the case of Dibb, who often takes breaks from recording and performing with the band, his time off does not constitute full leave.",
  "last_revision_date": "2025-12-01T00:17:56Z",
  "genres": [
    401,
    425,
    819,
    982,
    984
  ]
}