{
  "page_title": "Antonio Carmona",
  "description": "'''Antonio Carmona Amaya''' (born 21 May 1965) is a Spanish [[Gitanos|gitano]] singer of flamenco. He also has French nationality. From the early 1980s, he was a member of the Spanish flamenco-fusion group [[Ketama]], which he joined after main vocalist Ray Heredia left. The band also included José Soto, also known as \"Sorderita\". Ketama in its latest set-up included Antonio Carmona as main vocalist along with his brother, Juan José Carmona Amaya, known as \"El Camborio\", and his cousin, José Miguel Carmona Niño, known as \"Josemi\".\n\nAfter the break-up of the band in 2004, Carmona started his solo career and released a series of solo albums, including his debut ''Vengo Venenoso'' in 2006 on Universal Records. He also collaborated with [[La Mala Rodríguez]], Juanes and [[Alejandro Sanz]]. This was followed by the album ''De Noche'' in 2011, which included the single \"El Camino De Los Sueños\" featuring [[Nelly Furtado]] and collaborations with Spanish singer [[Concha Buika]].\n\nHe appeared in 1988 in ''Berlín Blues'', directed by [[Ricardo Franco (director)|Ricardo Franco]]. He had a lead role with Portuguese actress [[Maria de Medeiros]] in the 1997 film ''[[Go for Gold!]]'', directed by Lucien Segura. In 2000, he appeared in a role in the film ''Gitano'' starring [[Joaquín Cortés]], [[Pilar Bardem]] and [[Laetitia Casta]].\n\nIn 1996, he wrote the song \"[[¡Ay, qué deseo!]], which represented [[Spain in the Eurovision Song Contest|Spain]] in the [[Eurovision Song Contest 1996]]. The song was interpreted by [[Antonio Carbonell]] during the contest.\n\nIn 2017, he appeared in a collaboration with [[Alejandro Sanz]] that included also the Spanish singers [[Pablo Alborán]], [[David Bisbal]] and [[Manuel Carrasco (singer)|Manuel Carrasco]] with additional participation of Jesse & Joy, Juanes, Pablo López, Malú, Vanesa Martín, India Martínez, Antonio Orozco, Niña Pastori, Laura Pausini, Abel Pintos, Rozalen, Shakira, Tommy Torresin in the song \"Y, ¿Si Fuera Ella?\". The song topped the Spanish Singles Chart at number one.",
  "last_revision_date": "2025-06-07T17:12:16Z"
}