{
  "name": "Antonio Aguilar",
  "description": "'''José Pascual Antonio Aguilar Márquez Barraza''' (17 May 1919{{spnd}}19 June 2007), known as '''Antonio Aguilar''', was a Mexican singer and actor. He recorded over 150 albums, which sold 25&nbsp;million copies, and acted in more than 120 films. He was given the honorific nickname \"''El Charro de México''\" (Mexico's Horseman) because he is credited with popularizing the Mexican equestrian sport ''[[Charreada|la charrería]]'' to international audiences.\n\nAguilar began his career singing on Mexican radio station [[XEW-AM|XEW]] in 1950. That year, he signed a contract with Mexican independent label [[Musart Records]] and became one of its best-selling artists. He made his acting debut with [[Pedro Infante]] in the drama ''[[A Place Near Heaven|Un rincón cerca del cielo]]'' (1952). After appearing in gentleman roles in several films, he achieved popularity as a film star with his performance as lawman Mauricio Rosales in a series of seven films in the mid-1950s. His success increased with his tours throughout [[Latin America]] and his studio albums, which included Mexican folk songs (''[[ranchera]]s'') and ballads (''[[corrido]]s''). In the 1960s, he focused on producing and starring in films set in the [[Mexican Revolution]]. In 1970, he won [[Association of Latin Entertainment Critics|Latin ACE Award for Best Actor]] for his portrayal of [[Emiliano Zapata]] in the [[Emiliano Zapata (film)|1970 epic film of the same name]]. He also portrayed [[Pancho Villa]] twice in film. In 1997, Aguilar was awarded the [[Golden Ariel]] for his \"invaluable contribution and spreading of Mexican cinema\". To this day, he has been the only Hispanic artist to sell out the [[Madison Square Garden]] of New York City for six consecutive nights in 1997.\n\nHis second wife was famous singer and actress [[Flor Silvestre]]. They had two sons, [[Antonio Aguilar, hijo|Antonio Aguilar Hijo]], and [[Pepe Aguilar]], who also became singers and actors. His family is known as \"''la dinastía Aguilar''\" (the Aguilar dynasty).",
  "last_revision_date": "2025-09-09T20:23:10Z",
  "genres": [
    1030
  ]
}