{
  "name": "Anuel AA",
  "description": "'''Emmanuel Gazmey Santiago''' (born November 26, 1992), known professionally as '''Anuel AA''',{{efn|Pronounced as {{langnf|es|Doble A|Double A}}.}} is a Puerto Rican rapper and singer. Often called \"The God of [[Latin trap]]\" by himself and major Latin artists. His music often contains samples and [[Interpolation (popular music)|interpolations]] of songs that were popular during his youth. He is seen as a controversial figure in the Latin music scene for his legal troubles and feuds with fellow Puerto Rican rappers [[Cosculluela]], [[Ivy Queen]], and [[Arcángel]] as well as American rapper [[6ix9ine]]. Raised in [[Carolina, Puerto Rico]], he started recording music at age fourteen and began posting it online four years later in 2014, before eventually signing to the Latin division of fellow American rapper [[Rick Ross]]'s [[Maybach Music Group]]. His 2016 [[mixtape]] ''Real Hasta la Muerte'' was well-received, but his success was put on hold the same year by a 30-month prison sentence for illegal firearm possession in Puerto Rico. He recorded the entirety of his debut album while incarcerated, during which time his genre of music surged in popularity.\n\nAnuel AA released his debut album, also titled ''[[Real Hasta la Muerte]]'', on July 17, 2018, the day he was released from prison. The album was a critical and commercial success. In the coming six months, he appeared on the ''Billboard'' [[Hot Latin Songs]], solidifying his position as one of the top Latino artists. In July 2019, he released the song \"[[China (Anuel AA song)|China]]\", a collaboration with [[Daddy Yankee]], [[Karol G]], [[Ozuna]], and [[J Balvin]], which was a global success. He has since released the hit song \"[[Me Gusta (Shakira and Anuel AA song)|Me Gusta]]\" with [[Shakira]], and his second album, ''[[Emmanuel (album)|Emmanuel]]'', which was released on May 29, 2020. In November, Anuel AA made a statement on [[Instagram]] and released a new song suggesting his imminent retirement from the music industry, citing family and relationship issues. He was back to music with his collaborative album ''[[Los Dioses]]'' with [[Ozuna]]. His third studio album ''[[Las Leyendas Nunca Mueren]]'' was released on November 26, 2021, including 16 tracks. His fourth studio album ''[[LLNM2]]'' was the second part of \"Las leyendas nunca mueren\" and It was released on December 9, 2022.",
  "last_revision_date": "2025-06-16T20:22:03Z"
}