{
  "description": "The '''Apolinario Mabini Hiking Society''', later popularly known as '''APO Hiking Society''', or simply '''APO''', are a Filipino musical group, that comprised [[Danny Javier]], [[Jim Paredes]], and [[Boboy Garrovillo]]. Today, the group consists of only Paredes and Garrovillo as a duo.\n\nAPO Hiking Society are regarded as one of the pillars and icons of [[Original Pilipino Music]] (OPM). The group was formed and had its fledgling beginnings in 1969 at the [[Ateneo de Manila University|Ateneo de Manila]] High School, with 12 members: Lito de Joya, Sonny Santiago, Gus Cosio, Renato Garcia, Chito Kintanar, Kenny Borton, Bruce Brown, Butch Dans, Doden Besa, [[Ric Segreto|Ric Segreto Macaraeg]], [[Jim Paredes]], [[Boboy Garrovillo]], and the 13th member, [[Danny Javier]], who joined in college. The group's name was created from the acronym AMHS representing their school with a witty twist having an irreverent reference to the  Philippine revolutionary intellectual and hero, [[Apolinario Mabini]], and later shortened to \"Apo\", an [[Ilocano language|Ilocano]] term for a wise man or a [[Tagalog language|Tagalog]] term for grandchildren, and later re-branded to \"APO\" (all caps). Contrary to popular belief, the \"Apo\" name was not a reference to the Philippines's highest peak, the [[Philippine Institute of Volcanology and Seismology#Potentially active|potentially-active]] [[stratovolcano]] [[Mount Apo]]. The group's name and meaning was a joke for the fact that Mabini has been paralyzed by polio during the Philippine revolution and cannot use his feet for walking nor hiking, hence the name.\n\nAs the students advanced into college, their lead vocalist, Danny Javier joined the group. After graduation, the majority of its members left to pursue individual careers, with only three members remaining, made up of Javier, Jim Paredes, and Boboy Garrovillo.\n\nIn the span of their professional career, APO emerged as a principal adherent of the musical movement termed [[Original Pilipino Music]] (OPM), a term coined by Javier, a milieu in which their original musical contributions and cultural influence became essential. APO became involved in record production, talent management and organizing artists under the ''Organisasyon ng Pilipinong Mang-aawit'' (O.P.M., <small>acronym translation: \"Organization of Philippine Singers/musicians\"</small>). The group expanded its activities into establishing and furthering the careers of new OPM artists in the Philippines.\n\nTo date, the group has released 27 albums in the five decades of their career. Two successful [[tribute album]]s were produced in 2006 and 2007 by their management group, featuring numerous young bands reinterpreting APO's expansive repertoire.\n\nThe group frequently utilized their brand name, \"APO\", as a clever component for [[Tagalog language|Tagalog]] [[pun]]s in titles for television shows such as their own noon-time variety shows, ''[[Sa Linggo nAPO Sila]]'' and ''[['Sang Linggo nAPO Sila]]'', live programs and marketing materials, for example, as in ''n'''A PO''','' which transliterates as \"''already''\" (polite/formal usage).\n\nIn 2010, APO Hiking Society performed a series of concerts and the [[inauguration of Benigno Aquino III]] from February to June 30, 2010. Paredes and Garrovillo still remained active in show business and perform occasionally as a duo. In 2022, the group lost one of its members upon the death of lead singer, Danny Javier, due to a prolonged illness at the National Kidney and Transplant Institute on October 31, 2022, at the age of 75, as confirmed by his daughter Justine.",
  "last_revision_date": "2025-05-07T05:12:14Z"
}