{
  "name": "Arashi",
  "description": "{{Nihongo|'''Arashi'''|{{linktext|lang=ja|嵐}}||{{lit.}} \"Storm\"}} is a Japanese boy band officially formed on September 15, 1999, in [[Honolulu]], Hawaii, and debuted on November 3, 1999, under [[Johnny & Associates]]. The group consists of five members: [[Satoshi Ohno]], [[Sho Sakurai]], [[Masaki Aiba]], [[Kazunari Ninomiya]], and [[Jun Matsumoto]]. Initially signed to [[Pony Canyon]], where they released one studio album and six singles, beginning with their 1999 eponymous debut single, they were moved in 2001 to the Johnny's subsidiary label [[J Storm]], which was set up for their succeeding releases.\n\nTheir eighteenth single \"[[Love So Sweet]]\", theme song for Matsumoto's [[Japanese television drama|drama]] ''[[Hana Yori Dango Returns (TV series)|Hana Yori Dango 2]]'', was one of the top five best-selling singles of 2007 in Japan, and their first single to exceed 400,000 copies sold overall in nearly seven years. In the following two years, Arashi became the first artist to place the top two rankings on the ''[[Oricon]]'' singles yearly chart with their singles \"[[Truth / Kaze no Mukō e]]\" and \"[[One Love (Arashi song)|One Love]]\" in 2008, and \"[[Believe / Kumorinochi, Kaisei]]\" and \"[[Ashita no Kioku / Crazy Moon (Kimi wa Muteki)]]\" in 2009. They simultaneously topped the 2009 ''Oricon'' singles, album and music DVD yearly charts, becoming the third artist in ''Oricon'' history to monopolize the top three best-selling singles of the year. In 2010, all six of Arashi's singles ranked within the top ten of the ''Oricon'' singles yearly chart, and their million-selling studio album ''[[Boku no Miteiru Fūkei]]'' was named the best-selling album of the year in Japan. {{As of|2020|10}}, the group had sold over 58.8&nbsp;million copies of albums, singles and videos, becoming the best selling boy band in Asia. Since then, Arashi continued to release chart-topping singles and albums, performed in sold-out concert tours, host a number of variety shows, and remained an influential figure in Japanese media.\n\nOn January 27, 2019, Arashi announced that group activities would be suspended as of December 31, 2020. On May 6, 2025 the group announced that they will end activities following a final tour in the spring of 2026.",
  "last_revision_date": "2025-07-15T10:17:50Z",
  "genres": [
    277,
    552,
    616
  ]
}