{
  "name": "Arcaño y sus Maravillas",
  "description": "'''Arcaño y sus Maravillas''' was a Cuban [[charanga (Cuba)|charanga]] founded in 1937 by flautist [[Antonio Arcaño]]. Until its dissolution in 1958, it was one of the most popular and prolific [[danzón]] orchestras in Cuba, particularly due to the development of the [[danzón-mambo]] by its two main composers and musicians: [[Orestes López]] (piano, cello, bass) and his brother [[Cachao|Israel López \"Cachao\"]] (bass). Such upbeat version of the danzón served as a precursor of the [[mambo (music)|mambo]] popularized by [[Pérez Prado]], as well as the [[cha-cha-chá (music)|chachachá]] created by [[Enrique Jorrín]], a violinist who started his career in the Maravillas. Other important musicians in the Maravillas were pianist Jesús López (unrelated to Orestes and Israel), timbalero [[Ulpiano Díaz]], violinist [[Félix Reina]] and flautist Eulogio Ortiz.\n\nAntonio Arcaño, former member of singer Fernando Collazo's La Maravilla del Siglo, founded his orchestra in November 1937 under the name '''La Maravilla de Arcaño''', featuring many of the members of Collazo's group. Collazo himself complained about the similarity in the name, so by 1939 it was changed to Arcaño y sus Maravillas. By then the band had become popular across the island due to hits such as \"[[Mambo (1938 song)|Mambo]]\". Around 1944, they began to play at radio shows in Havana and the group doubled its roster. It became known as ''La Radiofónica'' and Arcaño as ''El Monarca del Danzón'' (The Monarch of Danzón). However, Arcaño had to stop playing in 1945 due to lip problems preventing him from maintaining his [[embouchure]]. He continued as director and hired his cousin José Antonio Díaz as flautist, who was later replaced by Eulogio Ortiz. Cachao left the group by the end of the decade (being replaced by his nephew [[Orlando \"Cachaíto\" López]], Orestes' son), but returned to record \"[[Chanchullo]]\" in 1957, one year before the Maravillas played their last show in [[Alquízar]].\n\nSeveral reunions of the group occurred in the 1970s and 1980s featuring some of the original members. These were released on two LPs by [[Areito (record label)|Areito]].",
  "last_revision_date": "2025-02-04T11:52:00Z"
}