{
  "name": "Architects",
  "description": "'''Architects''' are an English [[metalcore]] band from [[Brighton]], [[East Sussex]], England formed in 2004 by twin brothers Dan and Tom Searle. The band now consists of Dan Searle on drums, Sam Carter on vocals, Alex Dean on bass, and Adam Christianson on guitar. They have been signed to [[Epitaph Records]] since 2013.\n\nStrongly influenced by bands such as [[The Dillinger Escape Plan]], the sound of their first three albums was coarse, chaotic, and rhythmically complex. In 2011, Architects went in a more melodic [[post-hardcore]] direction with ''[[The Here and Now]]'', alienating some of their fanbase. The following year, they returned towards their original style with ''[[Daybreaker (Architects album)|Daybreaker]]'',  establishing a balance of melody and technical harshness while introducing more politicised lyrics. With the release of their sixth album ''[[Lost Forever // Lost Together]]'' in 2014, the band achieved lasting popularity and critical acclaim.\n\nSoon after the release of their seventh album, ''[[All Our Gods Have Abandoned Us]]'', in 2016, guitarist and principal songwriter Tom Searle died after three years of living with skin cancer, making Dan Searle the only original band member. In September 2017, the band released the single \"[[Doomsday (Architects song)|Doomsday]]\", the last song he was working on before his death, and announced Middleton as their new lead guitarist. The single is featured on ''[[Holy Hell (Architects album)|Holy Hell]]'', their first album recorded without Tom Searle, which was released in November 2018. Their ninth studio album, ''[[For Those That Wish to Exist]]'', was released in 2021, and became their first chart-topper on the [[UK Albums Chart]]. Its follow-up, ''[[The Classic Symptoms of a Broken Spirit]]'', was released in October 2022. Their eleventh studio album, ''[[The Sky, the Earth & All Between]]'', was released on 28 February 2025.",
  "last_revision_date": "2025-07-20T22:06:44Z",
  "genres": [
    39,
    736,
    754,
    955
  ]
}