{
  "name": "Arthur Brown",
  "description": "'''Arthur Wilton Brown''' (born 24 June 1942) is an English singer and songwriter best known for his [[flamboyant]] and theatrical performances, eclectic (and sometimes experimental) work and his powerful, wide-ranging [[operatic]] voice, in particular his high pitched banshee [[Screaming (music)|screams]]. He is also notable for his unique stage persona, featuring extreme [[facepaint]] and a burning helmet.\n\nBrown has been the lead singer of various groups, most notably [[the Crazy World of Arthur Brown]] and [[Kingdom Come (British band)|Kingdom Come]], followed by a varied solo career as well as associations with [[Hawkwind]], [[the Who]] and [[Klaus Schulze]]. In the late 1960s, the Crazy World of Arthur Brown's popularity was such that the group shared bills with the Who, [[Jimi Hendrix]], [[the Mothers of Invention]], [[the Doors]], [[Small Faces]] and [[Joe Cocker]], among others.\n\nHe is best known for The Crazy World of Arthur Brown's 1968 single \"[[Fire (Arthur Brown song)|Fire]]\", reaching number one in the [[UK Singles Chart]] and Canada, and number two on the US [[Billboard Hot 100|''Billboard'' Hot 100]] as well as its parent album ''[[The Crazy World of Arthur Brown (album)|The Crazy World of Arthur Brown]]'' which reached number 2 in the UK, number 6 in Canada, and number 7 in the US. Following the success of the single \"Fire\", the press would often refer to Brown as \"[[Honorific nicknames in popular music|The God of Hellfire]]\", in reference to the opening shouted line of the song, a moniker that exists to this day. Overlooked upon release, Kingdom Come's 1973 album ''[[Journey (Kingdom Come album)|Journey]]'' has received generally positive retrospective reviews from critics. Alan Holmes of ''Freq'' said that \"''Journey'' was so far ahead of its time that you have to keep checking the sleeve to make sure that it really does say 1973 and not 1983\" and that the album was \"not only Arthur Brown's masterpiece, but also one of the truly great albums of the seventies.\"\n\nAlthough Brown has had limited commercial success and has never released another recording as commercially successful as \"Fire\", he has remained a significant influence on a wide range of musicians in numerous genres because of his operatic vocal style, wild stage persona and often experimental concepts; he is considered to be a pioneer of [[shock rock]] and [[progressive rock]] and has had an influence on both [[electronic music|electronic]] and [[heavy metal music]]. In 2005 Brown won the 'Showman of the Year' award from ''[[Classic Rock (magazine)|Classic Rock]]'' magazine, receiving the award at the [[Classic Rock Roll of Honour Awards]] ceremony held in London's [[Café de Paris (London)|Café de Paris]].",
  "last_revision_date": "2025-05-21T15:47:37Z",
  "genres": [
    964,
    974,
    975,
    1105
  ]
}