{
  "name": "As I Lay Dying",
  "description": "'''As I Lay Dying''' is an American [[metalcore]] band from [[San Diego]], California. Formed in 2000 by vocalist [[Tim Lambesis]], the band's first full lineup (including Lambesis' [[Point of Recognition]] bandmate [[Jordan Mancino]]) was completed in 2001. The band has released eight albums, one [[split album]], and two compilation albums.\n\nAs I Lay Dying's fourth studio album ''[[An Ocean Between Us]]'' peaked at No.&nbsp;8 on the [[Billboard 200|''Billboard'' 200]], and No.&nbsp;1 on the Top Rock chart. The band has performed at festivals such as [[Wacken Open Air]], [[With Full Force]], [[Soundwave (Australian music festival)|Soundwave Festival]], [[Warped Tour]], [[Bloodstock Open Air]] and [[Taste of Chaos]]. In 2007, As I Lay Dying won the \"Ultimate Metal God\" award from [[MTV2]] at the first annual \"All That Rocks\" special; was named \"Artist of the Year\" at the San Diego Music Awards in 2005, 2007 and 2008; and was nominated for a 2008 [[Grammy Award]] for the song \"Nothing Left\". Their fifth studio album ''[[The Powerless Rise]]'' was written over a three-year period, and was released in May 2010 to widespread critical acclaim. Their last studio album before their hiatus, ''[[Awakened (album)|Awakened]]'', was released on September 25, 2012.\n\nThe band went on an indefinite hiatus in 2014 when Lambesis was convicted and sentenced to six years in prison for [[Solicitation|soliciting]] the murder of his estranged wife. The remaining members formed [[Wovenwar]] with vocalist [[Shane Blay]].\n\nIn 2018, Lambesis reunited with Hipa, Sgrosso, Mancino and Gilbert. On June 8, 2018, the band released the song \"[[My Own Grave]]\", their first recording in six years. They released their seventh studio album, ''[[Shaped by Fire]]'', on September 20, 2019. The band's lineup would crumble in the years following the album's release; Hipa departed the band in 2020, followed by Gilbert and Mancino in 2022, just over a month between each other. They were replaced by Ken Susi, Ryan Neff, and Nick Pierce, respectively in 2022; all three would also leave the band in 2024, with Sgrosso's departure from the band following shortly after, leaving Tim Lambesis as the sole member of the band. The band released their eighth studio album titled ''[[Through Storms Ahead]]'' on November 15, 2024.",
  "last_revision_date": "2025-08-04T02:38:00Z",
  "genres": [
    252,
    747,
    1203
  ]
}