{
  "name": "Aurthohin",
  "description": "'''Aurthohin''' (Bangla: {{Lang|Bn|অর্থহীন}}) is a Bangladeshi rock band formed in [[Dhaka]] in 1998 by [[Saidus Salehin Khaled Sumon|Saidus Sumon]] (vocals and bass guitar), Tonmoy Rahman (lead guitar), Ponir (rhythm guitar), and Rumi Rahman (drums and percussion). They are considered to be one of the pioneering bands in Bangladeshi alternative rock music. The band was seen as revolutionary within the rock scene in Bangladesh and played a huge part promoting rock/metal music in the country by supporting underground rock/metal bands in Bangladesh. They have released 8 studio albums and also have appeared in some mixed albums. Though they were formed as a rock band, they have experimented with genres like [[progressive metal]] and [[groove metal]]. Sumon's interests in [[Slap-bass|slap bass]] also led the band's sound into [[funk-rock]]. Aurthohin currently holds a lineup of Saidus Khaled Sumon (bass), Mark Don (drums) and Ehtesham Ali Moeen (guitars).\n\nAfter signing with [[G-Series (record label)|G-Series]], they released their debut studio album ''Trimatrik'' on 7 October 2000. The following album ''Biborton'', released on 10 December 2001, was more positively reviewed and gained more success than the previous one. The band released several hit songs in the 2000s like ''Adbhut Shei Cheleti'' (2000), ''Amar Proticchobi'' (2001), ''Hoytoba'' (2003), ''Anmone'' (2008) and ''Nikrishto'' (2008). Their most commercially successful album ''Aushomapto 2'' was released on 7 October 2011 by ME Label. Their sound was drawn from variety of musical influences including [[alternative rock|alternative]], [[blues]] and also the [[country music]] of [[John Denver]]. There were several lineup changes, with Sumon being the only member who remained throughout the band's career.\n\nThey have won many accolades including [[Channel i]] and [[Citycell]]'s best band of the year award in 2008 and 2011 respectively.",
  "last_revision_date": "2025-09-15T03:45:55Z",
  "genres": [
    39,
    355,
    518,
    534,
    549,
    757,
    988
  ]
}