{
  "page_title": "Australian Crawl",
  "description": "'''Australian Crawl''' (often called '''Aussie Crawl''' or '''The Crawl''' by fans) were an Australian [[Rock music|rock]] band founded by [[James Reyne]] ([[vocal|lead vocals]]/[[piano]]/[[harmonica]]), [[Brad Robinson (Australian musician)|Brad Robinson]] ([[rhythm guitar]]), Paul Williams ([[Bass (guitar)|bass]]), [[Simon Binks]] ([[lead guitar]]) and [[David Reyne]] ([[drum]]s) in [[Melbourne]] in 1978. David Reyne soon left and was replaced by Bill McDonough (drums, [[percussion]]). They were later joined by his brother [[Guy McDonough]] (vocals, rhythm guitar). The band was named after the [[front crawl]] swimming style also known as the Australian crawl.\n\nAustralian Crawl were associated with [[surf music]] and sponsored a surfing competition in 1984. However, they also handled broader social issues such as shallow [[materialism]], [[alcoholism]], [[car accidents]], and cautionary tales of [[Romance (love)|romance]].\n\nAfter their 1980 debut album, ''[[The Boys Light Up]]'', reached No. 4, Australian Crawl had two No. 1 albums; 1981's ''[[Sirocco (album)|Sirocco]]'' and 1982's ''[[Sons of Beaches]]''. Their early singles reached the top 25 but none broke into the Top Ten; their best performing single was No. 1 hit \"[[Reckless (Australian Crawl song)|Reckless]]\" which showed a more mature approach than earlier hits, and came from their 1983 ''[[Semantics (album)|Semantics]]'' [[Extended play|EP]].\n\nUpheaval within the band occurred from 1983 onwards. First, Bill McDonough left in 1983, then his brother Guy McDonough died in 1984, and finally, Paul Williams departed in 1985. Their 1985 release ''[[Between a Rock and a Hard Place (Australian Crawl album)|Between a Rock and a Hard Place]]'' was produced at an exceptionally high cost of $400,000 AUD, but sales were disappointing, and they disbanded in early 1986. The band's status as an icon on the Australian music scene was acknowledged by induction into the 1996 [[Australian Recording Industry Association]] (ARIA) [[ARIA Hall of Fame|Hall of Fame]]. Hospitalised with [[lymphoma]], founding guitarist Brad Robinson was unable to attend the Hall of Fame induction in person. He died two weeks later.",
  "last_revision_date": "2025-06-06T23:36:23Z"
}