{
  "name": "Aya Nakamura",
  "description": "'''Aya Coco Danioko''' (born 10 May 1995), known professionally as '''Aya Nakamura''', is a French-Malian singer-songwriter. She began publishing her music online, gaining a following with the songs \"Karma\" and \"J'ai mal\". Dembo Camara, a longtime friend, became her producer and manager. Her song \"Brisé\" garnered traction on [[YouTube]], and a duet with rapper [[Fababy]], \"[[Love d'un voyou]]\", resulted in her charting in France for the first time. She released her debut album, ''[[Journal intime]]'', in 2017, followed in 2018 by ''[[Nakamura (album)|Nakamura]]'', which was certified diamond in France and has sold more than 1.2 million copies worldwide. The album spawned the hit singles \"[[Djadja (song)|Djadja]]\" and \"[[Copines]]\" and launched the singer's international career. The same year, she beat the record held by [[Édith Piaf]] since 1961 as the most-listened-to French-speaking female artist in the Netherlands.\n\nNakamura has accumulated [[List of artists who reached number one on the French Singles Chart|five number-one songs]] and a number-one album in France. She was awarded a [[Victoires de la Musique]] award for her 2020 album, ''[[Aya (album)|Aya]]'', which was certified double platinum in 2023, having sold 200,000 copies. She also won an [[NRJ Music Award]] and received multiple nominations for the [[MTV Europe Music Award for Best French Act]]. Two years after its release, ''Nakamura'' surpassed a billion streams on [[Spotify]], making the singer the most-listened-to French-language female artist on the platform.\n\nIn February 2023, she became [[Lancôme]]'s international beauty muse.\n\nOn 23 February 2025, the video for Nakamura's single \"Djadja\" became the fourth French-language song to surpass one billion views on YouTube, behind [[Indila]]'s \"[[Dernière danse (Indila song)|Dernière Danse]]\", [[Stromae]]'s \"[[Papaoutai]]\", and [[Willy William]]'s \"[[Ego (Willy William song)|Ego]]\". She is the first African musician to have a video with over one billion views, and she is the fastest French-speaking artist to reach this milestone in six years.\n\n{{toc limit|3}}",
  "last_revision_date": "2025-11-19T23:33:03Z",
  "genres": [
    25,
    276,
    935,
    1308
  ]
}