{
  "page_title": "Ayumi Hamasaki",
  "description": "{{Nihongo|'''Ayumi Hamasaki'''|浜崎あゆみ|Hamasaki Ayumi|born October 2, 1978}} is a Japanese singer-songwriter and producer. Nicknamed the \"Empress of Pop\" on account of her influence throughout Asia, she is widely recognized for her versatile music production, songwriting, and live performances. Hamasaki is the [[List of best-selling music artists in Japan|best-selling solo artist in Japan]], and a [[cultural icon]] of the [[Heisei era]].\n\nBorn and raised in [[Fukuoka]], Hamasaki moved to Tokyo in 1993 to pursue a career in modeling and acting. In 1998, Hamasaki released her debut single \"[[Poker Face (Ayumi Hamasaki song)|Poker Face]]\" and debut major-label album ''[[A Song for XX|A Song for ××]]''. The album debuted at the top of the [[Oricon]] charts and remained there for five weeks, selling over a million copies. This rapid rise to fame was attributed to her lyrics, listeners praising her insight and relatability. Her next ten albums shipped over a million copies in Japan, with her third, ''[[Duty (album)|Duty]],'' selling nearly three million. ''[[A Best]]'', her first compilation album, further established her position as a crowning artist with more than four million copies sold in Japan. It was at this time that she represented more than 40% of her record label's income.\n\nAfter ''A Best'', Hamasaki went on to experiment with her music style and lyricism, incorporating English into her work from [[Rainbow (Ayumi Hamasaki album)|''Rainbow'']] onwards. Later albums would range from electronic dream-pop to rock genres, the singer commenting that she focuses on what she wants to create \"whether it is trendy or not\". Hamasaki currently holds the record for the most albums to place in the top ten by a female artist in Japan.\n\nHamasaki has sold over fifty million units in Japan, and has several domestic record achievements for her singles: the most number-one hits by a female artist (38); the most consecutive number-one hits by a solo artist (25), and the most million-sellers. From 1999 to 2010, Hamasaki had at least two singles each year topping the charts. Hamasaki is also the first female recording artist to have ten studio albums since her debut to top the Oricon, and the first artist to have a number one album for thirteen consecutive years since debut. Hamasaki's remix albums ''[[Super Eurobeat Presents Ayu-ro Mix]]'' and ''Ayu-mi-x II Version Non-Stop Mega Mix'', are also recognized as two of the best selling remix albums of all time worldwide.",
  "last_revision_date": "2025-06-06T00:45:12Z"
}