{
  "name": "Babymetal",
  "description": "{{Nihongo|'''Babymetal'''|ベビーメタル|Bebīmetaru|lead=yes}}, stylized in [[all caps]], is a Japanese [[kawaii metal]] band formed in [[Tokyo]] in 2010. It consists of [[Suzuka Nakamoto]] as \"Su-metal\" (lead vocals, dancing), [[Moa Kikuchi]] as \"Moametal\" (backing vocals, dancing), and [[Momoko Okazaki]] as \"Momometal\" (backing vocals, dancing). The band is produced by [[Kobametal]] from the talent agency [[Amuse Inc.]] Their vocals are backed by instrumentation performed by a group of [[session musician]]s known as the \"Kami Band\".\n\nBabymetal was created with the concept of fusing the [[Heavy metal music|heavy metal]] and [[Japanese idol]] genres. Initially a sub-unit of the Japanese idol group [[Sakura Gakuin]], which features school-aged members who leave upon graduation, the band became an independent act in 2013 following Nakamoto's graduation from Sakura Gakuin. The band originally consisted of Su-metal, Moametal, and [[Yui Mizuno]] as \"Yuimetal\". In 2018, after Mizuno had been absent from live performances for almost a year, Babymetal announced she had left the band due to health issues. During her absence, the band performed with one or more backup dancers; Okazaki, a former member of Sakura Gakuin who had served as one of those backup dancers, officially joined as the third member in 2023.\n\nBabymetal have embarked on several tours, of which a majority have taken place in Europe and the Americas, and have released five studio albums: ''[[Babymetal (album)|Babymetal]]'' (2014), ''[[Metal Resistance]]'' (2016), ''[[Metal Galaxy]]'' (2019), ''[[The Other One (Babymetal album)|The Other One]]'' (2023), and ''[[Metal Forth]]'' (2025), though they consider ''The Other One'' to be a separate [[concept album]] and not their fourth studio album. ''Metal Forth'' was released in August 2025, and was the first album to feature Okazaki; it signaled a new approach for the band, with seven of its ten tracks being collaborations with artists from various countries, such as [[Electric Callboy]] and [[Tom Morello]].",
  "last_revision_date": "2026-01-18T18:18:24Z",
  "genres": [
    39,
    630,
    670,
    973
  ]
}