{
  "name": "Baccara",
  "description": "'''Baccara''' was a Spanish female vocal duo formed in 1977 by Spanish artists Mayte Mateos (born 7 February 1951) and [[María Mendiola]] (4 April 1952 – 11 September 2021). The duo rapidly achieved international success with their debut single \"[[Yes Sir, I Can Boogie]]\", which reached [[Chart-topper|number one]] across much of Europe and became the [[List of best-selling singles|best-selling single of all time by a female duo]], eventually selling more than 16 million copies worldwide. A successful follow-up single (\"[[Sorry, I'm a Lady]]\") and European tour led to a number of album releases, numerous television appearances and the duo's selection to represent [[Luxembourg]] in the [[Eurovision Song Contest 1978]].\n\nDespite a substantial following in Spain, Germany and Japan, by 1981 their blend of [[disco]], pop and Spanish [[folk music]] was no longer fashionable, and by 1983 Mateos and Mendiola were both working on solo projects. Achieving little success as solo artists, the two formed duos of their own: separate incarnations of the original Baccara appeared during the middle of the decade, with Mendiola fronting '''New Baccara''' and Mateos keeping the duo's original name. During the 1990s, New Baccara reverted to Baccara and as a consequence both Mateos and Mendiola headed different duos with the same name. Both principals subsequently had prolonged but separate legacy careers based on nostalgia and their earlier fame.\n\nMendiola's Baccara has seen more international recognition, releasing a string of [[Hi-NRG]] club hits such as \"Fantasy Boy\", \"Call Me Up\" and \"Touch Me\" in the late 1980s and the later UK club hit \"Wind Beneath My Wings\". Mateos' Baccara has released few new recordings, but has remained in demand for television and live appearances in countries such as Spain and Germany, where the original Baccara developed a loyal fan base, performing the duo's back-catalogue and modernised versions of traditional Spanish songs.",
  "last_revision_date": "2025-07-18T10:26:25Z",
  "genres": [
    414,
    347
  ]
}