{
  "name": "Balance and Composure",
  "description": "'''Balance and Composure''' is an American [[emo]] band from [[Doylestown, Pennsylvania]]. They formed in the winter of 2007, after the breakup of two local Doylestown bands.\n\nThe band's musical style has been compared  those of [[Nirvana (band)|Nirvana]] and fellow Pennsylvanians [[Title Fight]]. Their early influences included Nirvana, [[Neutral Milk Hotel]], [[Sunny Day Real Estate]], [[Jawbreaker (band)|Jawbreaker]], and [[Braid (band)|Braid]].\n\nThey released three studio albums and two EPs over the initial course of their career. Their second album ''[[The Things We Think We're Missing]]'' reached number 51 on the [[Billboard 200|''Billboard'' 200]], number 10 on the [[Independent Albums]], number 13 on the Modern Rock/[[Alternative Albums]] and number 16 on the [[Rock Albums]] charts.\n\nOn December 14, 2017, on Taylor Madison's ''Strange Nerve'' podcast, vocalist Jon Simmons announced that their upcoming anniversary tour would be their last. On January 14, 2019 a press release went out on the band's [[Twitter]] account announcing a farewell tour. Six dates were confirmed, saying that \"These shows are the only shows we have planned in our future, we would love if you joined us one last time.\" The band later added extra dates due to high demand. These shows had select support from [[Tigers Jaw]], [[mewithoutYou]], and [[Touché Amoré|Touche Amore]].\n\nOn April 11, 2023, the band reunited and surprise released the 7-inch single ''Too Quick to Forgive'' with two new songs, \"Savior Mode\" and \"Last to Know\". The release was produced by longtime collaborator [[Will Yip]] and released via his label, Memory Music. The band also announced a handful of reunion shows with select support from Webbed Wing, Grist Mil, Fleshwater, [[Seahaven (band)|Seahaven]], Death Bells, [[Choir Boy (band)|Choir Boy]], and Toledo. Simmons, Andy Slaymaker (guitar), Erik Petersen (guitar), and Matt Warner (bass) returned in the formation of the 2023 iteration of the band. They were joined by new drummer Dennis Wilson, formerly of [[Saves the Day]] and [[Every Avenue]].\n\nThe band released their fourth studio album (and first in eight years), ''[[With You in Spirit]]'', on October 4, 2024, via Memory Music.",
  "last_revision_date": "2025-08-13T20:25:04Z",
  "genres": [
    42,
    406,
    943,
    944,
    1124
  ]
}