{
  "name": "Barbara Kanam",
  "description": "'''Barbara Kanam Mutund''' (born 27 September 1973), known professionally as '''Barbara Kanam''', is a Congolese singer-songwriter, producer, television personality, philanthropist, and politician currently serving as the Director General of the Cultural Promotion Fund of the [[Democratic Republic of the Congo]]. Noted for her [[coloratura]] and [[soprano]] vocal range, Kanam is considered one of the most influential figures in 21st-century [[Music of the Democratic Republic of the Congo|Congolese]] and [[African popular music]]. She sings in [[French language|French]], [[Swahili language|Swahili]], [[Lingala]], and [[English language|English]], often addressing themes such as [[peace]], [[love]], [[happiness]], and [[women's rights]] in her lyrics.\n\nBorn in [[Bukavu]], she gained fame after being spotted by Ivorian [[reggae]] singer [[Alpha Blondy]] and producer Dodo Koné, who produced her 1999 debut studio album, ''Mokili''. The album's [[gospel music|gospel]]-influenced lead single \"Mokili Ekoleka\" earned Kanam a television appearance at the [[Kora Awards|Koras Awards]]. Kanam's second studio album, ''Téti'', released in 2003, won her [[Kora Awards|Most Promising African Female Artist]] at the [[Kora Awards|2003 Kora Awards]]. ''Téti'' won her many accolades, including Best Female of Central Africa at Kunde d'Or and Tamani d'O for Best Female Hope in 2004, followed by two consecutive Black Music Awards in 2005 for Revelation of the Year and Best Video for \"Bibi Madeleine: L'argent appelle l'argent\" in 2005. \n\nBreaking away from Koné's record label in 2008, Kanam established Kanam Music. She released her third studio album, ''Karibu'', in January 2010 and won the Okapi Award for Best Female Artist the following year. In July 2015, her fourth studio album, ''Zawadi'', earned her the Ndule Award for Best Female Voice and the Afroca Music Award for Best Female Artist. Her fifth studio album, ''Transfiguration'', premiered on 23 December 2023.\n\nAside from music, Kanam owns Kanam Luxury, a boutique in [[Kinshasa]] specializing in her branded products, including the Barbara Luxury champagne line.",
  "last_revision_date": "2025-11-23T22:25:32Z",
  "genres": [
    275,
    813,
    1144,
    1300
  ]
}