{
  "name": "BnS",
  "description": "'''Bathiya & Santhush''' ({{langx|si|භාතිය හා සන්තුෂ්}}), also known as '''BnS''', are a [[Sri Lanka]]n [[Pop music|pop]] duo consisting of '''Bathiya Jayakody''' (born on 22 December 1976)  and '''Santhush Weeraman''' (born on 5 September 1977), who met while at the \"Mary Anne David School of Vocal Music and\" in [[Colombo]] (training mainly under the categories of classical and show tunes). They both were born in [[Colombo]], [[Sri Lanka]]. They have been one of the most commercially successful music acts in [[Sri Lanka]] in the last two decades.\n\nBathiya Jayakody was educated at [[Ananda College]], [[Colombo]] while Santhush Weeraman was educated at [[Royal College, Colombo|Royal College]], [[Colombo]]. Santhush comes from a musical family, his brother [[Dushyanth Weeraman]] is also a popular singer in Sri Lanka.\n\nSince the inception of their act in 1998, they have over 50 number-one hit singles, six platinum selling mainstream albums, four commercially successful EPs and countless movie soundtracks. BNS are one of the biggest musical acts to hit the Sri Lankan musical scene since the 1990s, mixing [[Sinhala language|Sinhala]], [[Tamil language|Tamil]], and [[English language|English]] rap verses in their originals, while they have also mixed [[Hindi]] rap verses in their [[folkhop]] [[remix]]es bringing out their contemporary style and the music industry in [[Sri Lanka]]. BNS became the only Sri Lankan [[hip hop]] act to feature [[India]]n singers, namely [[Hariharan (singer)|Hariharan]] (in the song Yaalpanamen), [[Asha Bhosle]] (Dedunna Sedi) and [[Sonu Nigam]] (in the song Aachale). BNS is also the only Sri Lankan artistes to have albums under both [[Sony BMG]] & [[Universal Music India]].\n\nHaving performed in over 2000 concerts in [[Sri Lanka]] and abroad, BnS marked significant success with their own concert tour series \"Neththara Live\" with 120 concerts (2005–2008), \"Shaheena Live\" 40 concerts (2009–2011), \"Sarasihina Live\" 150 concerts (2011–2014), \"BNS Up Close & Personal\" 50 Concerts (2015–2018) and their latest concert series \"Oba Nisa – Celebrating 20 Years of Music\" which was launched in 2019.\n\nStarting from a musical duo from their home during their early days, BnS Currently are the primary share holders of the BNS Production Group which houses some of the most successful companies in the Sri Lankan entertainment industry companies&nbsp;— Showtown Entertainment event management & production, Saregama Music Digital Audio Production, Saregama Films, Saregama Digital Content Acquisition & Management and Leap Strategic Concepts.",
  "last_revision_date": "2025-11-25T07:29:06Z",
  "genres": [
    302,
    443,
    558
  ]
}