{
  "name": "Bee Gees",
  "description": "The '''Bee Gees''' \nwere a musical group formed in 1958 by brothers [[Barry Gibb|Barry]], [[Robin Gibb|Robin]], and [[Maurice Gibb]]. The trio was especially successful in popular music in the late 1960s and early 1970s, and later as prominent performers in the [[disco]] music era in the mid-to-late 1970s. The group sang recognisable three-part [[Close and open harmony|tight harmonies]]: Robin's clear [[vibrato]] lead vocals were a hallmark of their earlier hits, while Barry's [[Rhythm and blues|R&B]] [[falsetto]] became their signature sound during the mid-to-late 1970s and 1980s. The group wrote all their own original material, as well as writing and producing several major hits for other artists, and are regarded as one of the most important and influential acts in pop-music history. They have been referred to in the media as [[Honorific nicknames in popular music|The Disco Kings, Britain's First Family of Harmony, and The Kings of Dance Music]].\n\nBorn on the [[Isle of Man]] to English parents, the Gibb brothers lived in [[Chorlton-cum-Hardy|Chorlton, Manchester]], England, until the late 1950s. There, in 1955, they formed the [[skiffle]]/[[rock and roll]] group [[The Rattlesnakes (1950s band)|the Rattlesnakes]]. The family then moved to [[Redcliffe, Queensland|Redcliffe]], in the [[City of Moreton Bay|Moreton Bay Region]], Queensland, Australia, and later to [[Cribb Island, Queensland|Cribb Island]].  After achieving their first chart successes in Australia as the Bee Gees, they returned to the UK in January 1967, when producer [[Robert Stigwood]] began promoting them to a worldwide audience. The Bee Gees' [[Saturday Night Fever (soundtrack)|''Saturday Night Fever'' soundtrack]] (1977) was the turning point of their career, with both the film and soundtrack having a cultural impact throughout the world, enhancing the disco scene's mainstream appeal. They won five [[Grammy Awards]] for ''Saturday Night Fever'', including [[Grammy Award for Album of the Year|Album of the Year]].\n\nThe Bee Gees have sold an estimated 120 million to 250 million records worldwide, placing them among the [[List of best-selling music artists|best-selling music artists of all time]], as well as the most successful trio in the history of contemporary music. They were inducted into the [[Rock and Roll Hall of Fame]] in 1997; the Hall's citation stating at the time, \"Only [[Elvis Presley]], [[the Beatles]], [[Michael Jackson]], [[Garth Brooks]] and [[Paul McCartney]] have outsold the Bee Gees.\" With nine number-one hits on the [[Billboard Hot 100|''Billboard'' Hot 100]], the Bee Gees are the third-most successful band in [[Billboard charts|''Billboard'' charts]] history behind only the Beatles and [[the Supremes]]. Following Maurice's sudden death in 2003 aged 53, Barry and Robin retired from the group after 45 years of activity. However, in 2009 Robin announced that he and Barry had agreed the Bee Gees would re-form and perform again. Robin died in 2012, aged 62, and [[Colin Petersen]] died in 2024, aged 78, leaving Barry, [[Vince Melouney]], and Geoff Bridgford as the surviving members of the group.",
  "last_revision_date": "2025-10-19T15:27:43Z",
  "genres": [
    352,
    932,
    1044,
    1126,
    1135
  ]
}