{
  "name": "Bibiladeniye Mahanama",
  "description": "'''Bibiladeniye Mahanama''' Thera is a [[Buddhist monk]] of the [[Theravada]] Order. The Thera is the only Buddhist monk in Asia of the Theravada school to engage in the experimentation and the creative exploration of music as a form of aesthetic expression. The Thera has been engaged with the art, both on overseas projects as well as in [[Sri Lanka]] for nearly two decades.\n\n[[Share the Love]], the album released in 2014, is his very first experimental attempt on Spirituality and Relaxation. The album was released in Europe, Asia and Sri Lanka. In 2015 the album was awarded the prestigious State Music Award for the best album produced in Sri Lanka.\n\nIn 2017, the venerable entered the world of cinema with the musical direction debut on the film [[Girivassipura]] directed by Devinda Konhahage. It is recorded that this is the first ever time a Buddhist monk achieved such a milestone.\n Since then, he has worked on many films, documentaries, theme songs and musical pieces.\n\nThe Thera is also recognised as the pioneer who introduced Conceptual Musical Short Films to Sri Lanka. In 2019, he started work on the first Conceptual Musical Short Film – Wallstory. It was released on the digital stream in 2020. This was a milestone for the Sri Lankan cinema music industry. On the 21st of September, 2021 on World Peace Day, he released the second conceptual musical short film – Piece for Peace, to celebrate peace and inter-religious harmony.\n\nThe Thera’s contribution to society is not limited to only music, cinema, Buddhist philosophy and spiritual harmony. The creative contribution too is immense. The most notable being the restoration of the research based “Jathaka” Stories Recitals project in 2015–16. The “Jathaka Katha” (Jathaka Stories) is one of the most important works of literature in the Theravada Buddhism. With the participation of over 150 Buddhist monks, the Jathaka Stories were recorded in the traditional Jathaka Stories recital form. The project was envisioned as a means of preserving the traditional recital of Jathaka Stories in its original style, for posterity. The restoration work is a 500 plus hour voice recording project that was overlooked by Venerable Bibiladeniye Mahanama Thera.\n\nVenerable Bibiladeniye Mahanama Thera is also the music director from the Sri Lankan end, on the Television drama series “You Are Always with Me”, jointly produced by the People’s Republic of China and the Democratic Socialist Republic of Sri Lanka. It is the first television drama series co-produced between Sri Lanka and China and was directed by Cui Yali.\n\nEven at this young age, he holds various positions in global associations working that work on environmental and animal welfare, as well as multi-religious and welfare organisations. The Thera is also the founder of the Share the Love Foundation of Ceylon and Sandhara Spiritual Buddhist Aesthetics and Arts Centre.",
  "last_revision_date": "2026-01-23T08:36:17Z",
  "genres": [
    860,
    1172
  ]
}