{
  "name": "Big Star",
  "description": "'''Big Star''' was an American [[Rock music|rock]] band formed in [[Memphis, Tennessee|Memphis]], Tennessee in 1971 by [[Alex Chilton]] (vocals, guitar), [[Chris Bell (American musician)|Chris Bell]] (vocals, guitar), [[Jody Stephens]] (drums), and [[Andy Hummel]] (bass). They have been described as the \"quintessential American [[power pop]] band\", and \"one of the most mythic and influential [[cult following|cult acts]] in all of rock & roll\". In its first era, the band's musical style drew influence from 1960s acts such as [[the Beatles]] and [[the Byrds]], pioneering a style that foreshadowed the [[alternative rock]] of the 1980s and 1990s. Before they broke up, Big Star created a \"seminal body of work that never stopped inspiring succeeding generations\" according to ''[[Rolling Stone]]''. Three of Big Star's studio albums are included in ''Rolling Stone''<nowiki/>'s lists of the \"[[Rolling Stone's 500 Greatest Albums of All Time|500 Greatest Albums of All Time]]\".\n\nBig Star's debut album, 1972's ''[[Number 1 Record|#1 Record]]'', was met with enthusiastic reviews, but ineffective marketing by [[Stax Records]] and limited distribution stunted its commercial success. Frustration took its toll on band relations: Bell left not long after the first record's commercial progress stalled, and Hummel left to finish his college education after a second album, ''[[Radio City (album)|Radio City]]'', was completed in December 1973. Like ''#1&nbsp;Record'', ''Radio City'' received critical acclaim upon release, but label issues again thwarted sales—[[Columbia Records]], which had assumed control of the Stax catalog, likewise effectively vetoed its distribution.\n\nAfter a third album, recorded in the fall of 1974, was deemed commercially unviable and shelved before receiving a title, the band broke up late in 1974. Four years later, the first two Big Star LPs were released together in the UK as a double album. The band's third album was finally issued soon afterward; titled ''[[Third/Sister Lovers]]'', it found limited commercial success, but has since become a cult classic. Shortly thereafter, Chris Bell was killed in a car accident [[27 Club|at the age of 27]]. During the group's hiatus in the 1980s, the Big Star discography drew renewed attention when [[R.E.M.]] and [[The Replacements (band)|the Replacements]], as well as other popular bands, cited the group as an influence. In 1992, interest was further stimulated by [[Rykodisc]]'s [[reissue]]s of the band's albums, complemented by a collection of Bell's solo work.{{rp|13}}\n\nIn 1993, Chilton and Stephens reformed Big Star with recruits [[Jon Auer]] and [[Ken Stringfellow]] of [[the Posies]], and played a concert at the [[University of Missouri]].{{rp|253}} The band remained active, performing tours in Europe and Japan,{{rp|253–260}} and released a new studio album, ''[[In Space]]'', in 2005. Chilton died in March 2010 after suffering from heart problems, with Hummel dying of cancer four months later. These deaths left Stephens as the sole surviving founding member. Big Star was inducted into the [[Memphis Music Hall of Fame]] in 2014.{{cn|date=March 2025}} Since December 2010, several surviving members have appeared in a series of live tribute performances of the album ''[[Third/Sister Lovers]]'', under the billing \"Big Star's ''Third''\". {{As of|2017}}, that project has remained active.",
  "last_revision_date": "2025-06-10T00:15:23Z"
}