{
  "name": "Bill Anderson",
  "description": "'''James William Anderson III''' (born November 1, 1937) is an American [[country music]] singer, songwriter, and television host. His soft-spoken singing voice earned him the nickname \"Whispering Bill\" from music critics and writers. As a songwriter, his compositions have been covered by various music artists since the late 1950s.\n\nAnderson was raised in [[Decatur, Georgia]], and began composing songs while in high school. While in college, he wrote the song \"[[City Lights (Ray Price song)|City Lights]]\", which became a major hit for Ray Price in 1958. His songwriting led to his first recording contract with [[Decca Records]] that year; shortly afterward, Anderson began to have major hits. In 1963, he released his most successful single, \"[[Still (Bill Anderson song)|Still]]\". The song became a major country/pop [[crossover music|crossover]] hit and was followed by a series of top-10 hits. These songs included \"[[I Love You Drops (song)|I Love You Drops]]\", \"[[I Get the Fever]]\", and  \"[[Wild Week-End]]\". His songs were being notably recorded by other artists. In 1964, [[Connie Smith]] had her first major hit with his composition \"[[Once a Day]]\". In 1971, [[Cal Smith]] had a number-one single with Anderson's \"[[The Lord Knows I'm Drinking]]\".\n\nIn the 1970s, Anderson continued having major hits as a recording artist, as well. Songs including \"[[Love Is a Sometimes Thing]]\" and \"[[All the Lonely Women in the World]]\" became major hits. As the decade progressed, his style moved towards the polished [[countrypolitan]] genre of country music, with songs such as \"[[I Can't Wait Any Longer]]\". He was dropped from his record label in the early 1980s and began a brief career in television, which included hosting the game shows ''[[The Better Sex]]'' and ''[[Fandango (game show)|Fandango]].'' Anderson began writing songs again in the early 1990s for the next generation of country performers. Collaborating with other writers, he wrote material that went on to become hits for [[Vince Gill]], [[George Strait]], [[Kenny Chesney]], and [[Steve Wariner]] in the next two decades.\n\nAnderson also continued to record into the 1990s. In 1998, he released his first major label album in over a decade, entitled ''[[Fine Wine (Bill Anderson album)|Fine Wine]].'' He continued to release music through his own TWI record label, including projects of gospel and bluegrass material. His most recent studio album was released in 2020. In his career as both a writer and performer, he has received awards from the [[Academy of Country Music]], [[Country Music Association]], [[Songwriters Hall of Fame]], and the [[Nashville Songwriters Hall of Fame]].",
  "last_revision_date": "2025-10-08T15:22:01Z",
  "genres": [
    138,
    289,
    504,
    802
  ]
}