{
  "name": "Billy Ray Cyrus",
  "description": "'''William Ray Cyrus''' ({{IPAc-en|'|s|aɪ|r|ə|s}} {{respell|SY|rəs}}; born August 25, 1961) is an American singer, songwriter and actor. Having released 16 studio albums and 53 singles since 1992, he is known for his hit single \"[[Achy Breaky Heart]]\", which topped the U.S. [[Hot Country Songs]] chart and became the first single ever to achieve triple platinum status in Australia. It was also the best-selling single in the same country in 1992. Due to the song's music video, the [[line dance]] rose in popularity.\n\nA [[Music recording certification|multi-platinum selling artist]], Cyrus has scored a total of eight top-ten singles on the [[Hot Country Songs|''Billboard'' Hot Country Songs]] chart. His most successful album to date is his debut ''[[Some Gave All]]'', which has been certified 9× multi-platinum in the United States and is the longest time spent by a debut artist and by a country artist at number one on the [[Billboard 200|''Billboard'' 200]] (17 consecutive weeks) and most consecutive chart-topping weeks in the [[SoundScan]] era.\n''Some Gave All'' was also the first debut album to enter at number one on the [[Top Country Albums|''Billboard'' Top Country Albums]] chart. The album has also sold more than 20 million copies worldwide and is the best-selling debut album of all time for a solo male artist. ''Some Gave All'' was also the best-selling album of 1992 in the US with 4,832,000 copies. During his career he has released 36 charted singles, of which 17 charted in the top 40.\n\nIn 2019, Cyrus earned his first number-one single on the US [[Billboard Hot 100|''Billboard'' Hot 100]] as a featured artist on a remix of [[Lil Nas X]]'s song \"[[Old Town Road]]\", which spent a record-breaking nineteen consecutive weeks at the top spot (eighteen of them credited to Cyrus). It also spent a record-breaking twenty consecutive weeks (nineteen of them credited to Cyrus) at the top spot on the [[Hot R&B/Hip-Hop Songs|''Billboard'' Hot R&B/Hip-Hop Songs]] and [[Hot Rap Songs|''Billboard'' Hot Rap Songs]]. The R&B/Hip-Hop record has been broken in May 2023 by [[SZA]]'s \"[[Kill Bill (song)|Kill Bill]]\".\nThanks to \"Old Town Road\", Cyrus won his first two [[Grammy Award]]s, in the categories [[Grammy Award for Best Pop Duo/Group Performance|Best Pop Duo/Group Performance]] and [[Grammy Award for Best Music Video|Best Music Video]].\n\nFrom 2001 to 2004, Cyrus starred on the television series ''[[Doc (2001 TV series)|Doc]]''. The series focused on a country doctor who moved from [[Montana]] to New York City. From 2006 to 2011, he starred as [[Robby Stewart|Robby Ray Stewart]] on the [[Disney Channel]] series ''[[Hannah Montana]]'' with his daughter [[Miley Cyrus]] playing the [[Miley Stewart|title character]]. From 2016 to 2017, he starred as Vernon Brownmule on the [[Country Music Television|CMT]] sitcom ''[[Still the King (TV series)|Still the King]]''.",
  "last_revision_date": "2025-11-05T01:44:43Z",
  "genres": [
    294,
    295
  ]
}