{
  "name": "Birdman (rapper)",
  "description": "'''Bryan Christopher Williams''' (''{{né}}'' '''Brooks'''; February 15, 1969), better known by his stage names '''Birdman''' or '''Baby''', is an American rapper and record executive. He is the public face of [[Cash Money Records]], a record label he co-founded with his older brother, [[Ronald \"Slim\" Williams]], in 1991. Birdman released his [[Birdman (album)|eponymous debut studio album]] in 2002,{{efn|At the time of its release, he was known as Baby, although he changed his stage name to the album's title, ''Birdman'' shortly after.}} and released three follow-up albums—''[[Fast Money (album)|Fast Money]]'' (2005), ''[[5 * Stunna]]'' (2007), and ''[[Priceless (Birdman album)|Priceless]]'' (2009)—to moderate commercial success and mixed critical reception. Along with his solo career, he is a member of the hip hop duo [[Big Tymers]] with producer [[Mannie Fresh]], as well as the supergroup [[Cash Money Millionaires]].\n\nApart from his solo work and five releases as part of Big Tymers, Birdman is best known for his discovery and mentorship of fellow New Orleans rapper [[Lil Wayne]], with whom he released the collaborative album, ''[[Like Father, Like Son (Birdman and Lil Wayne album)|Like Father, Like Son]]'' (2006). As label-head of Cash Money Records, he has been central to the career and commercial success of Wayne, as well as future signees including [[Drake (musician)|Drake]], [[Nicki Minaj]], and [[Tyga]]. Many acts were signed in a joint venture with Wayne's [[Young Money Entertainment]] (branded as \"YMCMB\"),{{efn|Acronym for \"Young Money Cash Money Billionaires\".}} a label that ran as an imprint of Cash Money from its formation in 2005 until 2018. Birdman also founded the spin-off project [[Cash Money Records #Branches|Rich Gang]] in 2014, a loose-knit collective assembled from core signees of both labels; it was joined and soon led by then-upcoming [[Southern hip hop|Southern]] rappers [[Young Thug]] and [[Rich Homie Quan]], as well as other artists not directly signed to the labels.\n\nOne of the wealthiest [[hip-hop]] artists, he placed fifth on the ''[[Forbes]]'' list of wealthiest [[music industry]] figures in 2015, and fourth in 2017, with a net worth of $155 million and $110 million, respectively. Outside of music, Birdman has ventured into various industries, including fashion, [[Alcoholic beverage|spirits]], and oil exploration.",
  "last_revision_date": "2025-07-18T23:19:11Z",
  "genres": [
    478,
    1122,
    1209,
    153
  ]
}