{
  "name": "Black Midi",
  "description": "'''Black Midi''' (stylised as '''black midi''') were an English [[experimental rock]] band from [[London]], formed in 2017. Their most recent line-up consisted of lead vocalists and [[multi-instrumentalist]]s [[Geordie Greep]] and Cameron Picton, along with drummer Morgan Simpson. Between 2017 and 2021, the band also included guitarist Matt Kwasniewski-Kelvin. Following his departure, the trio were frequently joined by multi-instrumentalist Seth Evans and saxophonist Kaidi Akinnibi, both as session musicians and during live performances. Their name is derived from the Japanese [[electronic music]] genre [[black MIDI]], though their own music has no obvious relation to it, instead incorporating styles such as [[math rock]], [[progressive rock]], [[post-punk]], and [[avant-jazz]].\n\nPart of the [[Windmill scene]], the band began on producer [[Dan Carey (record producer)|Dan Carey]]'s record label Speedy Wunderground, through which they released their debut single, \"bmbmbm\", in 2018. They released their debut studio album, ''[[Schlagenheim]]'', produced by Carey, on 21 June 2019, through [[Rough Trade Records]]. It received critical acclaim, entered the top 50 of the [[UK Albums Chart]], and was nominated for the 2019 [[Mercury Prize]]. An anthology album including several recorded jams and spoken-word tracks, ''[[The Black Midi Anthology Vol. 1: Tales of Suspense and Revenge]]'', was released on 5 June 2020 exclusively to [[Bandcamp]]. In January 2021, founding member Matt Kwasniewski-Kelvin went on hiatus from the group for mental health reasons. The band's second studio album, ''[[Cavalcade (Black Midi album)|Cavalcade]]'', was released on 26 May 2021. Their third studio album, ''[[Hellfire (Black Midi album)|Hellfire]]'', was released on 15 July 2022. \n\nThe band entered an indefinite hiatus in August 2024, as each member focused on other work; Greep released his solo album ''[[The New Sound]]'', Picton formed a new group, My New Band Believe, and Simpson began working with jazz musician [[Nala Sinephro]] and rapper [[Little Simz]], appearing on their albums ''[[Endlessness]]'' (2024) and [[Lotus (Little Simz album)|''Lotus'']] (2025) respectively.",
  "last_revision_date": "2026-01-31T08:22:53Z",
  "genres": [
    66,
    430,
    753,
    870,
    969,
    985
  ]
}