{
  "page_title": "Blind Guardian",
  "description": "'''Blind Guardian''' is a German [[power metal]] band formed in 1984 in [[Krefeld]], [[West Germany]]. They are often credited as one of the seminal and most influential bands in the power metal and [[speed metal]] subgenres. Nine musicians have been part of the band's lineup throughout its history, which currently includes singer [[Hansi Kürsch]], guitarists [[André Olbrich]] and [[Marcus Siepen]], and, since 2005, drummer Frederik Ehmke.\n\nBlind Guardian is a key player in the [[German heavy metal|German heavy metal scene]] that emerged in the mid-1980s. The band was formed in 1984 as '''Lucifer's Heritage''' by Kürsch (who also played bass at the time), Olbrich, fellow guitarist Markus Dörk, and drummer [[Thomas Stauch]]. Dörk and Stauch left the following year and were replaced by Christof Theißen and Hans-Peter Frey, respectively, who also departed before the year ended. In 1987, Siepen joined the group, and Stauch returned; this lineup, which lasted 18 years (the longest in the band's history), led the band to change their name to Blind Guardian and release their debut album, ''[[Battalions of Fear]]'', in 1988. They have since released ten more studio albums, including an [[Legacy of the Dark Lands|orchestral album]] released under the name Blind Guardian Twilight Orchestra.\n\nThrough their discography, Blind Guardian has established themselves as a notable and successful band and as pioneers of the power metal movement. In 1996, Kürsch ceased to act as the band's bassist to focus on vocals, with various session musicians filling in, primarily Oliver Holzwarth. However, in 2005, Stauch left the band, expressing disapproval of Blind Guardian's shift toward a more complex [[Progressive metal|progressive]] sound with heavy backing vocals, and was replaced by Ehmke.\n\nMost of Blind Guardian's albums have been well received by fans and critics alike: ''[[Somewhere Far Beyond]]'' (1992), ''[[Imaginations from the Other Side]]'' (1995), and ''[[Nightfall in Middle-Earth]]'' (1998) are particularly regarded as influential works. The music is primarily composed by Kürsch and Olbrich together, while the lyrics, penned by Kürsch, draw inspiration from the works of fantasy authors such as [[J. R. R. Tolkien]], [[Michael Moorcock]], [[Stephen King]], [[George R. R. Martin]], and [[Robert Jordan]], as well as traditional [[legend]]s and [[Epic poetry|epics]]. Over the years, a theme has developed that personifies the band members as traveling storytellers, leading fans to affectionately refer to them as \"The Bards.\" Blind Guardian has been described in one article as one of the \"big four\" bands of power metal, alongside [[Helloween]], [[Sabaton (band)|Sabaton]], and [[DragonForce]].",
  "last_revision_date": "2025-06-04T14:31:08Z"
}