{
  "page_title": "Bloc Party",
  "description": "'''Bloc Party''' are  an English [[Rock music|rock]] band that was formed in [[London, England|London]] in 1999 by co-founders [[Kele Okereke]] (lead vocals, rhythm guitar, piano, sampler) and [[Russell Lissack]] (lead guitar). Their first four albums all featured [[Gordon Moakes]] (bass, keyboards) and [[Matt Tong]] (drums), who have since left the band. Their current lineup also contains Louise Bartle (drums, percussion) and Harry Deacon (bass, synthesizers). Their brand of music, whilst rooted in rock, retains elements of other genres such as [[electronica]] and [[house music]]. \n\nUpon their formation at the 1999 [[Reading and Leeds Festivals|Reading Festival]] by Okereke and Lissack, the band went through a variety of names before settling on Bloc Party in 2003. Moakes joined the band after answering an advert in ''[[NME]]'' magazine, while Tong was picked via an audition. Bloc Party got their break by giving [[BBC Radio 1]] DJ [[Steve Lamacq]] and [[Franz Ferdinand (band)|Franz Ferdinand]]'s [[Alex Kapranos]] a copy of their demo \"[[She's Hearing Voices]]\".\n\nIn February 2005, the band released their debut album ''[[Silent Alarm]]''. It was critically acclaimed and was named Indie Album of the Year at the 2006 [[PLUG Awards]] and ''NME'' Album of the year which both honour [[indie music]]. That year, the record was also certified [[platinum record|platinum]] in Britain. The band built on this success in 2007 with the release of their second studio album, ''[[A Weekend in the City]]'', which reached a peak of number two in the [[UK Albums Chart]] and number twelve in the [[Billboard 200|''Billboard'' 200]]. In August 2008, Bloc Party released their third studio record, ''[[Intimacy (Bloc Party album)|Intimacy]]'' which entered the UK Albums Chart at number eight and number eighteen on the ''Billboard'' 200. \n\nThe band went on a hiatus in October 2009 to focus on [[side project]]s. They reunited in September 2011, and shortly thereafter released their fourth album, ''[[Four (Bloc Party album)|Four]]'', which entered the UK Albums Chart at number three. In 2013, Bloc Party released their third EP titled ''[[The Nextwave Sessions]]'' in August; the band then began an indefinite hiatus to continue with their respective side projects. The band's fifth studio album, ''[[Hymns (Bloc Party album)|Hymns]]'', the first to involve Justin Harris (bass) and Louise Bartle (drums), was released on 29 January 2016. Their sixth studio album, ''[[Alpha Games]]'', was released on 29 April 2022. On 21 July 2023, they released the ''High Life'' EP. Bloc Party have sold over 3 million albums worldwide.",
  "last_revision_date": "2025-06-12T15:35:07Z"
}