{
  "name": "Blondie",
  "description": "'''Blondie''' is an American [[New Wave music|new wave]] band formed in New York City in 1974 by singer [[Debbie Harry]] and guitarist [[Chris Stein]]. The band was a pioneer in the American [[New wave music|new wave]] genre and scene of the mid-1970s.\n\nThe band's first two albums also contained strong elements of [[Punk rock|punk]]. Although successful in the UK and Australia, Blondie was regarded as an [[underground music|underground band]] in the US until the release of their critically acclaimed third album in 1978, ''[[Parallel Lines]]''. Over the next two years, the band released a string of hit singles, including \"[[Heart of Glass (song)|Heart of Glass]]\" (US No. 1), \"[[One Way or Another]]\", \"[[Dreaming (Blondie song)|Dreaming]]\", \"[[Call Me (Blondie song)|Call Me]]\" (US No. 1), \"[[Atomic (song)|Atomic]]\", \"[[The Tide Is High]]\" (US No. 1), and \"[[Rapture (Blondie song)|Rapture]]\" (US No. 1). The band became noted for its eclectic mixture of musical styles, incorporating elements of [[disco]], [[Pop music|pop]], [[reggae]], [[funk]] and early [[hip hop music]].\n\nBlondie disbanded after the release of their sixth studio album, ''[[The Hunter (Blondie album)|The Hunter]]'', in 1982. Harry continued to pursue a solo career with varied results after taking a few years off to care for her partner Stein, who was diagnosed with [[pemphigus]], a rare [[autoimmune]] disease of the skin. The band re-formed in 1997, achieving renewed success and their sixth number one single in the UK with \"[[Maria (Blondie song)|Maria]]\" in 1999, exactly 20 years after their first UK number one single, \"Heart of Glass\".\n\nThe group toured and performed throughout the world during the following years, and was inducted into the [[Rock and Roll Hall of Fame]] in 2006. Blondie has sold over 40 million records worldwide and continues to actively perform. The band's eleventh studio album, ''[[Pollinator (album)|Pollinator]]'', was released on {{nowrap|May 5,}} 2017.  A new studio album, ''High Noon'', is expected to be released in the spring of 2026.",
  "last_revision_date": "2026-01-31T06:22:07Z",
  "genres": [
    321,
    853,
    975,
    1008
  ]
}