{
  "name": "Bluegrass Student Union",
  "description": "__NOTOC__\n'''Bluegrass Student Union''' is the [[Louisville, Kentucky]] [[barbershop quartet]] that won the 1978 [[Barbershop Harmony Society|SPEBSQSA]] International competition.  They distinguished themselves by performing at a high level of proficiency on stage and in the recording studio throughout their 33-year career, and were the second youngest quartet to have won the SPEBSQSA championship, as of that time. The quartet became known for continually improving their art, even after their win.  They credited much of their success to their coaches, Mary Jo Hatton Thompson, Don Clause, Ron Riegler, Gene Stickler and Ed Weber, to their chorus Director, Jim Miller, and to their long-time arrangers, Ed Waesche and Walter Latzko.{{citation needed|date=October 2018}}\n\nBluegrass Student Union's members were Allen Hatton (tenor), Ken Hatton (lead), Dan Burgess (baritone), and Rick Staab (bass).\n\nAllen Hatton later sang tenor with the original version of the Second Edition quartet to win the Cardinal District Quartet Championship for his second time, in 1986.\n\nIn 1984, the Bluegrass Student Union gave a performance of \"[[Java Jive]]\" for President [[Ronald Reagan]] at the [[White House]], with Bill Myers filling in for Staab on bass. Reagan described it as \"my kind of music.\"\n\nKen Hatton later sang lead with the 2000 Cardinal District Champion SENSATIONS quartet, which earned semi-finalist status (20th place) in the 2001 International Quartet Competition.  Ken also sang lead with The Exchange, semi-finalist (20th place) in the 2003 International Quartet Competition of SPEBSQSA, Inc.  Ken's other appearances in the International Quartet Competition include:\n\n*2004 – 23rd place – The Exchange (lead)\n*2011 – 43rd place – The Daddy-Ohs! (baritone)\n\nThe quartet took a hiatus starting in 1992, then reunited to do occasional shows starting in 1999.  They permanently retired in December 2006, although the four friends hold an annual reunion.{{Citation needed|date=November 2021|reason=}}\n\nThe quartet was inducted into the Cardinal District Hall of Fame in 2005 and the Barbershop Harmony Society Hall of Fame in 2012.",
  "last_revision_date": "2024-01-23T21:25:25Z"
}