{
  "name": "BoA",
  "description": "'''Kwon Bo-ah''' ({{Korean|hangul=권보아}}; born November 5, 1986), known professionally as '''BoA''', is a South Korean singer, songwriter, and actress often called the \"Queen of K-pop\".\n\nBorn and raised in [[Gyeonggi Province]], South Korea, BoA was discovered by [[SM Entertainment]] talent agents when she accompanied her older brother, a music video director, to a talent search in 1998. She was trained for two years and made her debut with ''[[ID; Peace B]]'' (2000). BoA has since released twenty studio albums, including ten in Korean, nine in Japanese, and one in English. On television, she appeared as a judge on the reality competition show ''[[K-pop Star]]'' (2011–2013), as an actress on the television drama ''[[Listen to Love]]'' (2016), as a host for the [[Produce 101 (season 2)|second season]] of ''[[Produce 101]]'' (2017), and as a coach for the [[The Voice of Korea (season 3)|third season of The Voice of Korea]] (2020).\n\nWith the release of her debut Japanese studio album, ''[[Listen to My Heart (BoA album)|Listen to My Heart]]'' (2002), BoA became the first South Korean pop star to break through in Japan following the fall of barriers that had restricted the import and export of entertainment between the countries since the end of [[World War II]]. Her Japanese albums ''[[Valenti (album)|Valenti]]'' (2003) and ''[[Best of Soul]]'' (2005) went on to sell over one million copies each according to [[Oricon]]; the latter of which remained the last album to do so by a non-Japanese artist for 16 years. Her [[BoA (album)|self-titled English album]] (2009) became the first record by a K-pop artist to appear on the [[Billboard 200|''Billboard'' 200]], debuting at number 127.\n\nBoA has sold over ten million albums throughout her career and is one of only three female artists with six consecutive number-one studio albums on the [[Oricon Albums Chart]] since her debut, alongside Japanese singers [[Ayumi Hamasaki]] and [[Hikaru Utada]]. She is the recipient of numerous awards in South Korea and Japan, including eight [[MAMA Awards]], six [[SBS Gayo Daejeon|SBS Music Awards]], five [[Japan Record Awards]], and five [[Japan Gold Disc Awards]]. In 2013, [[Mnet (TV channel)|Mnet]] included her in their Legend 100 Artists list of the most influential artists in South Korea.",
  "last_revision_date": "2025-07-16T17:10:06Z",
  "genres": [
    639,
    312,
    610,
    274
  ]
}