{
  "name": "Bob Marley",
  "description": "'''Robert Nesta Marley''' {{Post-nominals|country=JAM|post-noms=[[Order of Merit (Jamaica)|OM]]}} (6 February 1945&nbsp;– 11 May 1981) was a Jamaican singer, songwriter, and guitarist. Considered one of the pioneers of [[reggae]], he fused elements of reggae, [[ska]] and [[rocksteady]] and was renowned for his distinctive vocal and songwriting style. Marley increased the visibility of [[Jamaican music]] worldwide and became a global figure in popular culture. He became known as a [[Rastafari]]an icon, and he infused his music with a sense of spirituality. Marley is also considered a global symbol of Jamaican music and [[Culture of Jamaica|culture]]&nbsp;and identity and was controversial in his outspoken support for democratic social reforms. Marley also supported the legalisation of [[Cannabis (drug)|cannabis]] and advocated for [[Pan-Africanism]].\n\nBorn in [[Nine Mile, Jamaica]], Marley began his career in 1963, after forming the group Teenagers with [[Peter Tosh]] and [[Bunny Wailer]], which became [[Bob Marley and the Wailers|the Wailers]]. In 1965, they released their debut studio album, ''[[The Wailing Wailers]]'', which included the single \"[[One Love/People Get Ready|One Love]]\", a reworking of \"[[People Get Ready]]\". It was popular worldwide and established the group as a rising figure in reggae. The Wailers released 11 more studio albums, and after signing to [[Island Records]], changed their name to Bob Marley and the Wailers. While initially employing louder instrumentation and singing, they began engaging in rhythmic-based song construction in the late 1960s and early 1970s, which coincided with Marley's conversion to Rastafari. Around this time, Marley relocated to London, and the group embodied their musical shift with the release of the album ''[[The Best of The Wailers]]'' (1971).\n\nBob Marley and the Wailers began to gain international attention after signing to Island and touring in support of the albums ''[[Catch a Fire]]'' and ''[[Burnin' (The Wailers album)|Burnin']]'' (both 1973). Following their disbandment a year later, Marley carried on under the band's name. The album ''[[Natty Dread]]'' (1974) received positive reviews. In 1975, following the global popularity of [[Eric Clapton]]'s version of Marley's \"[[I Shot the Sheriff]]\", Marley had his international breakthrough with his first hit outside Jamaica, a live version of \"[[No Woman, No Cry]]\", from the ''[[Live! (Bob Marley & the Wailers album)|Live!]]'' album. This was followed by his breakthrough album in the United States, ''[[Rastaman Vibration]]'' (1976), which reached the Top 50 of the Billboard Soul Charts. A few months later, Marley survived [[Attempted assassination of Bob Marley|an assassination attempt]] at his home in Jamaica, which was believed to be politically motivated. He permanently relocated to London, where he recorded the album ''[[Exodus (Bob Marley and the Wailers album)|Exodus]]'', which incorporated elements of [[blues]], [[soul music|soul]], and [[British rock]] and had commercial and critical success. In 1977, Marley was diagnosed with [[acral lentiginous melanoma]]; he died in May 1981, shortly after baptism into the [[Ethiopian Orthodox Tewahedo Church|Ethiopian Orthodox Church]]. Fans around the world expressed their grief, and he received a [[state funeral]] in Jamaica.\n\nThe greatest hits album ''[[Legend (Bob Marley and the Wailers album)|Legend]]'' was released in 1984 and became the [[List of best-selling albums#20–29 million copies|best-selling reggae album of all time]]. Marley also ranks as one of the [[List of best-selling music artists|best-selling music artists of all time]], with estimated sales of more than 75 million records worldwide. He was posthumously honoured by his country Jamaica soon after his death with a designated [[Order of Merit (Jamaica)|Order of Merit]]. In 1994, Marley was posthumously inducted into the [[Rock and Roll Hall of Fame]]. ''[[Rolling Stone]]'' ranked him No. 11 on its list of the [[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]. and No. 98 on its list of the 200 Greatest Singers of All Time. His other achievements include a [[Grammy Lifetime Achievement Award]], a star on the [[Hollywood Walk of Fame]], and induction into the [[Black Music & Entertainment Walk of Fame]].",
  "last_revision_date": "2025-09-12T04:34:58Z",
  "genres": [
    1023,
    1049,
    1110
  ]
}