{
  "name": "Bobby Pulido",
  "description": "'''José Roberto Pulido Jr.''' (born April 25, 1971), known professionally as '''Bobby Pulido''', is an American singer, songwriter, guitarist, actor, and political candidate. He is acclaimed for pioneering the dissemination of [[Tejano music]] to a youthful audience, subsequently ascending as a [[teen idol]] and becoming one of the most influential Tejano recording artists among [[Mexican Americans|Mexican-American]] teenagers.\n\nIn 1995, Pulido debuted on the music scene as the frontman of his eponymous band. During the same year, he forged a recording contract with [[EMI Latin]] and released his debut album, ''[[Desvelado (Bobby Pulido album)|Desvelado]]''. It peaked at number nine on the United States [[Billboard (magazine)|''Billboard'']] [[Top Latin Albums]] chart and at number three on the US ''Billboard'' [[Regional Mexican Albums]] chart. The [[Recording Industry Association of America]] (RIAA) [[RIAA certification#RIAA Diamante Latin certifications|certified]] the album platinum, denoting shipments of 100,000 units. The titular track propelled Pulido into a celebrated Tejano singer, albeit drawing criticism from veteran musicians who opined that his success in the genre derived from the preexisting musical impact of his father, [[Roberto Pulido]]. \n\nPulido's album ''Enséñame'' (1996), which peaked at number two on the ''Billboard'' Regional Mexican Albums chart, garnered him a nomination for the [[Tejano Music Award for Male Entertainer of the Year]] and the [[Lo Nuestro Award for Regional Mexican New Artist of the Year]]. In 1998, Pulido performed a sold-out performance at the [[Auditorio Coca-Cola]] in [[Monterrey]], the first Tejano artist to achieve this feat. Pulido became the youngest honoree to receive the Orgullo de la Frontera accolade by the Fiestas Mexicanas in February 1999. In 1998, the singer was awarded the Male Entertainer of the Year at the [[Tejano Music Awards]] for three consecutive years. By 2000, the waning popularity of Tejano music resulted in Pulido's subsequent albums failing to make an impact on music charts. \n\nIn 2003, Pulido made his acting debut, assuming the lead role in the [[made for TV movie|made-for-television film]] ''La Decada Furiosa''. He also appeared in the [[telenovela]]s ''[[Fuego en la sangre (telenovela)|Fuego en la sangre]]'' and ''[[Qué pobres tan ricos]]''. Pulido encountered commercial disappointment with his album ''Enfermo de Amor'' (2007), prompting a three-year hiatus, he resurfaced with the release of ''Dias de Ayer'' (2010). Concurrently, Pulido renewed his foray into acting, appearing in the film ''Noches Con Platanito''. In 2024, Pulido unveiled his intention to embark on a farewell tour, culminating in a bid for public office in Texas.{{sfn|Medina|2024}}\n\nOn September 17, 2025, Pulido announced a campaign for the [[United States House of Representatives]] in [[Texas's 15th congressional district]] in the [[2026 United States House of Representatives elections in Texas#District 15|2026 election]]. He is running as a [[Democratic Party (United States)|Democrat]] against incumbent Republican [[Monica De La Cruz]].",
  "last_revision_date": "2025-12-05T02:10:14Z",
  "genres": [
    290,
    867,
    1214
  ]
}