{
  "page_title": "Bono",
  "description": "'''Paul David Hewson''' (born 10 May 1960), known by the nickname '''Bono''' ({{IPAc-en|ˈ|b|ɒ|n|oʊ}} {{respell|BON|oh}}), is an Irish singer-songwriter and activist. He is a founding member, the lead vocalist, and primary lyricist of the [[Rock music|rock]] band [[U2]]. Bono is known for his impassioned vocal style as well as his grandiose songwriting and performance style. His lyrics frequently include social and political themes, and religious imagery inspired by his [[Christianity|Christian]] faith. \n\nBorn and raised in [[Dublin]], Ireland, he attended [[Mount Temple Comprehensive School]] where in 1976 he began dating his future wife, [[Ali Hewson|Alison Stewart]], as well as forming, with schoolmates, the band that became U2. During U2's early years, Bono's lyrics contributed to the group's rebellious and spiritual tone. As the band matured, his lyrics became inspired more by personal experiences shared with the other members. As a member of U2, Bono has received 22 [[Grammy Awards]] and has been inducted into the [[Rock and Roll Hall of Fame]].\n\nAside from his music, Bono is an activist for social justice causes, both through U2 and as an individual. He is particularly active in campaigning to fight [[extreme poverty]] and [[HIV/AIDS in Africa]], for which he co-founded DATA, [[EDUN]], the [[ONE Campaign]], and [[Product Red]]. In pursuit of these causes, he has participated in benefit concerts and lobbied politicians and heads of state for relief. Bono has received numerous honours for his philanthropic efforts, including being named one of the [[Time Person of the Year|''Time'' Persons of the Year]] in 2005, being granted an honorary [[knighthood]] by [[Elizabeth II]] of the United Kingdom in 2007, being made a {{lang|fr|Commandeur}} of the French {{lang|fr|[[Ordre des Arts et des Lettres]]}} (Order of Arts and Letters) in 2013, and receiving the [[Presidential Medal of Freedom]] in the United States in 2025. Bono has also attracted criticism for bypassing African businesses in his activist efforts and for tax avoidance in his personal finances.\n\nOutside the band, he has recorded with numerous artists. He has collaborated with U2 bandmate [[the Edge]] on several projects, including: songs for [[Roy Orbison]], [[Tina Turner]], and [[Martin Garrix]]; and the soundtracks to the musical ''[[Spider-Man: Turn Off the Dark]]'' and a London stage adaptation of ''[[A Clockwork Orange: A Play with Music|A Clockwork Orange]]''. In business, he invested in the refurbishment of the [[Clarence Hotel]] in Dublin, and was managing director and a managing partner of the [[private equity]] firm [[Elevation Partners]], which invested in several companies.",
  "last_revision_date": "2025-06-15T06:00:45Z"
}