{
  "name": "Brigade M",
  "description": "'''Brigade M''' ({{IPA|nl|briˈɣaːdə ˈʔɛm}}) was a Dutch [[punk rock]] band from [[Sassenheim]] in the [[Bollenstreek]] district of [[the Netherlands]] that was heavily associated with the right-wing nationalist [[Rock Against Communism]] movement. During its existence, the driving force behind Brigade M was [[Tim Mudde]].\n\nThe band was founded in 1995 out of the ashes of the [[Hardcore punk|hardcore]] band Opel Kadeath. Initially, the band's set list was limited, and there were only a few concerts held. Only a few years after the founding of the band, Europe had an upsurge in [[Far-right politics|far-right extremism]] that broadened the appeal of the band.\n\nUnder the name \"Dirk\", they began rehearsing in the Muziekhuis in [[Leiden]]. Several [[Left-wing politics|leftist]] groups began to protest against their stay, but Alderman [[Alexander Pechtold]] decided though to let the group continue as there were no legal means to deny them. Brigade M later thanked him by composing the song \"Pechtold Houzee (\"Hail Pechtold!\").\n\n\n\nIn 2003, the two members of Brigade M with the most extreme ideologies were kicked out of the band by Mudde, and afterwards Brigade M became more moderate right. [[National Socialism]] was toned down and [[National Bolshevism]], [[Otto Strasser|Strasserism]], [[metapolitics]], [[nationalism|people's nationalism]], [[Linguistic purism|language purism]], [[Pan-European nationalism|European unity]] and [[Conservatism|conservative]] criticism of society became the fundaments of the band. They also highlighted [[vegetarianism]], [[alcoholism]], [[fast food]], the [[Anti-fascism|antifa]] (most notably with their song \"Lui, laf en lelijk\", better known for the lyrics \"Antifa, ha, ha, ha\") and the [[Arab–Israeli conflict]] (in which they side with the [[Palestinian people|Palestinians]]) in their lyrics, which they themselves called \"radical and nationalistic\".\n\nThe band was dissolved in 2005 after their last CD ''Nationaal Revolutionair,'' claiming that their national-revolutionary ideas didn't get much credence with the nationalistic subcultures in Europe as most nationalists were \"too chauvinist\".{{Citation needed|date=August 2016}}\n\nAfterwards, the band sporadically reformed for concerts during special occasions until 2010.",
  "last_revision_date": "2025-05-29T06:35:39Z",
  "genres": [
    975,
    1026
  ]
}