{
  "name": "Broken Social Scene",
  "description": "'''Broken Social Scene''' is a [[Canadians|Canadian]] [[indie rock]] band and [[musical collective]] including as few as six and as many as nineteen members, formed by [[Kevin Drew]] (vocals, guitar) and [[Brendan Canning]] (vocals, bass) in 1999. Alongside Drew and Canning, the other core members of the band are [[Justin Peroff]] (drums), [[Andrew Whiteman]] (guitar) and [[Charles Spearin]] (guitar).\n\nMost of its members play in various other groups and solo projects, mainly in the city of [[Toronto]]. These associated acts include [[Metric (band)|Metric]], [[Feist (singer)|Feist]], [[Stars (Canadian band)|Stars]], [[Apostle of Hustle]], [[Do Make Say Think]], [[KC Accidental]], [[Emily Haines|Emily Haines & The Soft Skeleton]], [[Amy Millan]], and [[Jason Collett]].\n\nThe group's sound combines elements of all of its members' respective musical projects, and is occasionally considered [[baroque pop]]. It includes grand orchestrations featuring guitars, horns, woodwinds, and violins, unusual song structures, and an experimental, and sometimes chaotic production style from David Newfeld, who produced the second and third albums.\n\nStuart Berman's ''[[This Book Is Broken]]'' (2009) covers the band from its inception to its critical acclaim. In 2010, [[Bruce McDonald (director)|Bruce McDonald]] made ''[[This Movie Is Broken]]'', a movie about the band's [[Harbourfront Centre|Harbourfront]] show during the [[2009 City of Toronto inside and outside workers strike|2009 Toronto strike]]. In 2024, cinematographer Stephen Chung collaborated with his longtime friends in the band to complete and release the film ''It's All Gonna Break'', a project he had set aside in 2007, using new as well as historical footage he had filmed throughout the band's career.\n\nThe collective and their respective projects have had a broad influence on alternative music and indie rock during the early 21st century; in 2021, [[Pitchfork (website)|Pitchfork]] listed the band among the \"most important artists\" of the last 25 years.",
  "last_revision_date": "2025-12-04T21:23:51Z",
  "genres": [
    103,
    424,
    586,
    587,
    962
  ]
}