{
  "name": "Bryan Adams",
  "description": "'''Bryan Guy Adams''' {{Post-nominals|country=CAN|size=100%|CC|OBC|FRPS}} (born November 5, 1959) is a Canadian singer-songwriter, musician, record producer, and photographer. He is estimated to have sold between 75 million and more than 100 million [[album|records]] and [[Single (music)|singles]] worldwide, placing him on the [[list of best-selling music artists]]. Adams was the most played artist on Canadian radio in the 2010s and has had 25 top-15 singles in Canada and over a dozen in the US, UK, and Australia.\n\nAdams released his [[Bryan Adams (album)|eponymous debut album]] when he was 20 years of age. He rose to fame in North America with the 1983 top ten album ''[[Cuts Like a Knife]]''; the album featured its title track and the ballad \"[[Straight from the Heart (Bryan Adams song)|Straight from the Heart]]\", which became his first US top-ten hit. His 1984 Canadian and US number one album, ''[[Reckless (Bryan Adams album)|Reckless]]'' became the first album by a Canadian to be certified diamond in Canada and made Adams a global star; the album's six charting singles included \"[[Run to You (Bryan Adams song)|Run to You]]\" and \"[[Summer of '69]]\", both top ten hits in the US and Canada, and the power ballad \"[[Heaven (Bryan Adams song)|Heaven]]\", a US number one hit. His 1987 album ''[[Into the Fire (album)|Into the Fire]]'', with its US and Canadian top ten song, \"[[Heat of the Night]]\", rose to number two in Canada and the top ten in the US.\n\nIn 1991, Adams released \"[[(Everything I Do) I Do It for You]]\", which reached number one in at least 19 countries. The single was number one for 16 straight weeks in the UK; it is one of the [[List of best-selling singles|best-selling singles]] of all time, having sold more than 15 million copies worldwide. The song was included on Adams' ''[[Waking Up the Neighbours]]'' (1991), a worldwide number one album that sold 16 million copies and was certified diamond in Canada. Another major hit off the album was the Canadian number one and US number two hit \"[[Can't Stop This Thing We Started]]\". Beginning in 1993, Adams' hits were mostly ballads, including the worldwide number one or two hits \"[[Please Forgive Me]]\" (1993); \"[[All for Love (song)|All for Love]]\" (1993); and \"[[Have You Ever Really Loved a Woman?]]\" (1995), the latter two topping the [[Billboard Hot 100|U.S. ''Billboard'' Hot 100]]. \n\nAdams was ranked 48th on the list of all-time top artists on the [[Billboard Hot 100|''Billboard'' Hot 100]]. Adams had won 20 [[Juno Award]]s and a [[Grammy Award for Best Song Written for Visual Media]] amongst 16 Grammy nominations. He has been nominated for five [[Golden Globe Award]]s and three [[Academy Award]]s for his songwriting for films. Adams has been inducted into the [[Hollywood Walk of Fame]], [[Canada's Walk of Fame]], the [[Canadian Broadcast Hall of Fame]], the [[Canadian Music Hall of Fame]] and the Canadian Songwriters Hall of Fame. On May 1, 2010, Adams received the [[Governor General's Awards]] in Performing Arts – Lifetime Artistic Achievement for his 30 years of contributions to the arts.",
  "last_revision_date": "2025-09-15T04:50:02Z",
  "genres": [
    62,
    548,
    932,
    1042,
    1125
  ]
}