{
  "page_title": "Bryan Ferry",
  "description": "'''Bryan Ferry''' (born 26 September 1945) is an English singer and songwriter. He became known as the frontman of the band [[Roxy Music]] and also launched a solo career. His voice has been described as an \"elegant, seductive croon\". He also established a distinctive image and sartorial style: according to ''[[The Independent]]'', Ferry and his contemporary [[David Bowie]] influenced a generation with both their music and their appearances. [[Peter York]] described Ferry as \"an art object\" who \"should hang in the [[Tate]]\".\n\nBorn to a working-class family, Ferry studied fine art and taught at a secondary school before pursuing a career in music. In 1970 he began to assemble Roxy Music with a group of friends and acquaintances in London, and took the role of lead singer and main songwriter. The band achieved immediate international success with the release of [[Roxy Music (album)|their self-titled debut album]] in 1972, containing a rich multitude of sounds, which reflected Ferry's interest in exploring different genres of music. Their second album, ''[[For Your Pleasure]]'' (1973), further cultivated the band's unique sound and visual image that would establish Ferry as a leading cultural icon over the next decade.\n\nFerry began a parallel solo career in 1973 by releasing ''[[These Foolish Things (album)|These Foolish Things]]'', which popularized the concept of a contemporary musician releasing an album covering [[traditional pop|standard songs]] and was a drastic departure from his ongoing work with Roxy Music. His second album, ''[[Another Time, Another Place (Bryan Ferry album)|Another Time, Another Place]]'' (1974), featured on its cover the image Ferry posing by a pool in a white dinner jacket, a persona which Rolling Stone magazine dubbed \"dandy of the bizarre\". Over the next two years, Roxy Music released a trilogy of albums, ''[[Stranded (album)|Stranded]]'' (1973), ''[[Country Life (Roxy Music album)|Country Life]]'' (1974) and ''[[Siren (Roxy Music album)|Siren]]'' (1975), which broadened the band's appeal internationally and saw Ferry take greater interest in the role of a live performer, reinventing himself in stage costumes ranging from [[gaucho]] to military uniforms. In 1983, following the release of their best-selling album ''[[Avalon (Roxy Music album)|Avalon]]'' the previous year, Ferry disbanded Roxy Music to concentrate on his solo career, with his next album, 1985's ''[[Boys and Girls (album)|Boys and Girls]]'', reaching No. 1 in the UK and featuring the hit singles \"[[Slave to Love]]\" and \"[[Don't Stop the Dance]]\", while the next two albums ''[[Bête Noire (album)|Bête Noire]]'' (1987) and ''[[Taxi (Bryan Ferry album)|Taxi]]'' (1993) both went Top 10 in the UK.\n\nAs well as being a prolific songwriter, Ferry has recorded many cover versions, including standards from the [[Great American Songbook]], in albums such as ''[[These Foolish Things (album)|These Foolish Things]]'' (1973), ''[[Another Time, Another Place (Bryan Ferry album)|Another Time, Another Place]]'' (1974), ''[[Let's Stick Together]]'' (1976), ''[[Taxi (Bryan Ferry album)|Taxi]]'' (1993) and ''[[As Time Goes By (Bryan Ferry album)|As Time Goes By]]'' (1999), as well as ''[[Dylanesque]]'' (2007), an album of [[Bob Dylan]] covers. Including his work with Roxy Music, Ferry has sold over 30 million albums worldwide. In 2019, Ferry was inducted into the [[Rock and Roll Hall of Fame]] as a member of Roxy Music.",
  "last_revision_date": "2025-06-14T21:30:01Z"
}