{
  "name": "Buckethead",
  "description": "'''Brian Patrick Carroll''' (born May 13, 1969), known professionally as '''Buckethead''', is an American guitarist. He has received critical acclaim for his innovative and virtuosic electric guitar playing.\n\nBuckethead's extensive solo [[discography]] currently includes 31 studio albums. In 2011, Buckethead began releasing albums in the \"Pike\" series, mini-albums usually around 30 minutes in length, each with a sequential number similar to a [[comic book]]. As of October 2024, Buckethead has released 662 Pike albums, including almost 300 live recordings.\n\nBuckethead has also released seven studio albums under the alias Death Cube K (an [[anagram]] of Buckethead). He has released collaborative albums with [[Brain (musician)|Brain]], [[Travis Dickerson]], [[Melissa Reese]], [[Viggo Mortensen]], [[Shin Terai]], [[DJ Disk]], [[Bootsy Collins]], [[That 1 Guy]] and albums with the bands [[Praxis (band)|Praxis]], [[Cornbugs]], [[Science Faxtion]], [[Guns N' Roses]], [[Colonel Claypool's Bucket of Bernie Brains]], and [[Deli Creeps]], in addition to many other collaborations with bands and artists. Between 2000 and 2004, Buckethead was a lead guitarist of Guns N' Roses, recording on the long-delayed ''[[Chinese Democracy]]'' (2008) album. He also performed with the band on the first legs of the album's [[Chinese Democracy Tour|accompanying tour]].\n\nBuckethead performs wearing a [[KFC]] bucket on his head, sometimes emblazoned with an orange [[bumper sticker]] reading ''FUNERAL'' in block letters. This is accompanied by an expressionless plain white mask inspired by the 1988 [[slasher film]] ''[[Halloween 4: The Return of Michael Myers]]''. He also incorporates [[nunchaku]] and [[Robot (dance)|robot dancing]] into his stage performances. Buckethead stays [[wikt:in character|in character]] in performances and interviews, and does not appear without some sort of mask.\n\nBuckethead was credited by ''[[Guitar World]]'' as \"ushering in [a] new era of virtuosity\" while ranking the release of his 1992 debut album ''[[Bucketheadland]]'' the 45th greatest moment in electric guitar history.  The magazine has also listed him among the \"25 all-time weirdest guitarists\" and the \"50 fastest guitarists of all time\".",
  "last_revision_date": "2025-08-04T20:13:35Z",
  "genres": [
    547,
    459,
    76,
    39,
    954,
    422,
    139,
    48,
    42
  ]
}