{
  "name": "The Bus Station Loonies",
  "description": "'''The Bus Station Loonies''' are a British cabaret [[Punk rock|punk]] band from [[Plymouth]], England. They have been described as a cross between [[Splodgenessabounds]] and [[Crass]]. Original Loonies Tony Popkids (drums) and Chris \"Felcher\" Wheelchair (real name Chris Willsher b.1971 in [[Ilford]], London) (vocals, keyboards, kazoo; ex-drummer with [[Oi Polloi]], [[Disorder (band)|Disorder]], Riot/Clone and DIRT, among others), sharing a mutual love of such U.S. [[Punk rock|punk]] outfits such as [[The Dickies]], still continue with the band today, with the current line-up having been stable for the last 15 years of the band's 30 year existence. \n\nDuring their initial UK tour of April 1996, with contemporary punk bands [[PMT (band)|PMT]] and [[The Filth (UK band)|The Filth]], The Loonies were billed as \"a vicious headbutt between [[Johnny Moped]] and [[Jello Biafra]]\".{{Citation needed|date=January 2011}}\n\nThe band was featured in the UK's [[Channel 4]] documentary, ''Punx Picnic''. The Bus Station Loonies were the first band to set the official world record for the most concerts/gigs performed in 12 hours (25 different shows) on 29 Sept 2001 in and around Plymouth, [[Devon]], UK raising money to buy musical equipment for pupils of the Dame Hannah Rogers (special needs) school in [[Ivybridge]], Devon.\n\nThe band featured in the ''[[Guinness Book of World Records]]'', until 2006, when the record was beaten.\n\nMusic journalist [[Mick Mercer]]'s 1997 book ''The Hex Files: The Goth Bible'', references The Bus Station Loonies for their 18-minute [[reggae]] rendition of [[The Sisters of Mercy]] composition, \"Temple of Love\". In October 2008, said version (from their debut album) was nominated on a live broadcast on [[BBC Radio 6 Music]] as 'one of the best cover versions of all-time' (''The Music Week'' with Julie Cullen and Matt Everitt).\n\nIn Autumn 2010, The Bus Station Loonies completed recording their second full-length album. Entitled ''Midget Gems'' and released on their own Ruptured Ambitions record label it features eighth [[guitarist]] Angus Old (real name Phil Cawse) and the recently recruited ninth guitarist Chris \"The Machine\" Mildren.\n\nThe bands' latest release, ''More Bullshit'' was released in Autumn 2022, and is an official tribute to several bands featured on the [[Crass Records]] ''[[Bullshit Detector]]'' compilation LP series, originally released between 1980 and 1984.\n\nThe band's frontman, Chris Wheelie, is currently involved in a solo project [[Harakiri]] Karaoke, as well as drumming with several other bands (including The Spoils Collective, WAGs to Wytches, Eastfield, Anarcho Folko, HIV and The Positives, The Sexy Offenders and his old band, originally formed in 1989, C.D.S.).",
  "last_revision_date": "2025-03-25T13:30:32Z"
}