{
  "page_title": "Cachao",
  "description": "'''Israel López Valdés''' (September 14, 1918 &ndash; March 22, 2008), better known as '''Cachao''' ({{IPAc-en|k|ə|ˈ|tʃ|aʊ}} {{respell|kə|CHOW|'}}), was a Cuban double bassist and composer. Cachao is widely known as the co-creator of the [[mambo (music)|mambo]] and a master of the [[descarga]] (improvised jam sessions). Throughout his career he also performed and recorded in a variety of music styles ranging from [[classical music]] to [[salsa music|salsa]]. An exile in the United States since the 1960s, he only achieved international fame following a career revival in the 1990s.\n\nBorn into a family of musicians in [[Havana]], Cachao and his older brother [[Orestes López|Orestes]] were the driving force behind one of Cuba's most prolific [[Charanga (Cuba)|charanga]]s, [[Arcaño y sus Maravillas]]. As members of the Maravillas, Cachao and Orestes pioneered a new form of ballroom music derived from the [[danzón]], the [[danzón-mambo]], which subsequently developed into an international genre, [[mambo (music)|mambo]]. In the 1950s, Cachao became famous for popularizing improvised jam sessions known as [[descarga]]s. He emigrated to Spain in 1962, and moved to the United States in 1963, starting a career as a session and live musician for a variety of bands in [[New York City|New York]] during the rise of [[boogaloo]], and later, [[salsa music|salsa]].\n\nIn the 1970s, Cachao fell into obscurity after moving to [[Las Vegas]] and later [[Miami]], releasing albums sporadically as a leader. In the 1990s, he was re-discovered by actor [[Andy García]], who brought him back to the forefront of the [[Latin music (genre)|Latin music]] scene with the release of a documentary and several albums. Before his death in 2008, Cachao had earned a star on the [[Hollywood Walk of Fame]] and several [[Grammy Award]]s. He is ranked number 24 on ''Bass Player'' magazine's list of \"The 100 Greatest Bass Players of All Time\".",
  "last_revision_date": "2025-03-03T18:17:30Z"
}