{
  "name": "Calle Real",
  "description": "'''Calle Real''' is a [[Timba]] band from [[Sweden]] founded in 1999. Calle Real currently has twelve members who play modern timba music with various influences. The music is well arranged and suited for the club scene. There is a definite, heavy and unique groove with a sound that differs from many other bands. The music of this band contains some elements of various musical genres.\n\nThe band was founded towards the end of 1999 by Patricio Sobrado, initially as a trio, playing traditional Cuban music in the style of the Buena Vista Social Club. Since then, new musicians have joined the band while others have moved on. The group has changed its style to timba.\n\nToday, Calle Real consists of the following members:\n\nThomas Sebastian Eby - lead vocals <br>\nPatricio Sobrado - tres, backing vocals & band leader <br>\nKarl Frid - giro, backing vocal & trombone<br> \nGunnar Thullberg - keyboard & guitar <br>\nAndreas Unge - bass <br>\nRickard Valdés - congas & timbales <br>\nHarry Wallin - drums & timbales <br>\nMichel Zitron - backing vocals <br>\nKristian Persson - trombone <br>\nPeter Fredriksson - trombone <br>\nJacek Onuskiewicz - trumpet <br>\n[[Nils Janson]] - trumpet\n\nSeveral of them have spent long periods in Cuba and have studied music, although no one in the band is actually Cuban except Rickard Valdés, who is the son of the legendary pianist [[Bebo Valdés]] and who is half Cuban. The band members are ethnically diverse - Patricio Sobrado of Chilean origin, while trumpet player Jacek Onuskiewicz and the trombone player Cezary Tomaszewski are from Poland. Nevertheless, all of them grew up in Sweden.\n\nIn 2003, the band received an invitation to play at a festival in Cuba. It is a festival that assembles the best traditional music and timba bands in Cuba and which also invites some international acts. The entire performance was filmed, which resulted in a music documentary Spelplats Cuba (A Gig in Cuba), later shown at the Gothenburg Film Festival in 2005 and bought by Swedish Television.\n\nOver the years, Calle Real has also played at Swedish festivals like Folkmusikfestivalen in Umeå, Urkul, Linköping Jazz & Blues as well as the Stockholm Jazz Festival and Göteborgskalaset. They have also performed at several other places around Sweden.\n\nTimba is an afro-Cuban music style which developed from traditional Cuban music and great many inspirations from world music, and often contains a hard beat and a heavy bass. It was initially created during the late 1980s by leading Cuban bands, foremost NG La Banda. It was further developed by groups like Charanga Habanera, Isaac Delgado, Paulito FG and Los Van Van.\n\nThe fact that Calle Real was able to adopt this style is somewhat remarkable despite growing interest in Spanish and Latin-American culture. Most impressive of all is the fact that a group of young Swedish musicians have successfully mastered this complex style of Cuban. \nCalle Real is able to successfully mix many different musical influences without losing the Cuban style.\n\nFor the most part, the members of Calle Real compose and write the music themselves. Though their sound is influenced by other bands, it is nevertheless distinct in style and fresh. When the band  was in Cuba, it received extremely positive reaction, with Cubans believing the music to be new and exciting.\n\nIn 2004 the band received a recording offer from Swedish hip-hop label Redline Records. The band recorded five songs, which eventually led to the group's debut album \"Calle Real con Fuerza\". The album was released in Sweden on 1 March 2006.",
  "last_revision_date": "2024-08-05T08:09:52Z",
  "genres": [
    1054,
    1206
  ]
}