{
  "name": "Calvin Harris",
  "description": "'''Adam Richard Wiles''' (born 17 January 1984), known professionally as '''Calvin Harris''' (and sometimes under the stage name '''Love Regenerator'''), is a Scottish DJ, record producer, singer, and songwriter. His debut studio album, ''[[I Created Disco]]'' (2007) was preceded by the singles \"[[Acceptable in the 80s]]\" and \"[[The Girls (Calvin Harris song)|The Girls]]\", both of which achieved commercial success in Europe, as well as in Australia. His second album, ''[[Ready for the Weekend (album)|Ready for the Weekend]]'' (2009), debuted atop the official album charts in Scotland, as well as in the United Kingdom, and its lead single, \"[[I'm Not Alone (song)|I'm Not Alone]]\", became his first song to reach number one in the UK Singles Charts.\n\nIn 2012 Harris rose to international prominence with the release of his third studio album, ''[[18 Months]]'', which topped the UK Albums Chart and became his first album to chart on the US [[Billboard 200|''Billboard'' 200]], peaking at number 19. In 2014, he released his fourth studio album, ''[[Motion (Calvin Harris album)|Motion]]'', which debuted at number one in his native Scotland, as well as number two in the United Kingdom and number five in the United States. His fifth studio album, ''[[Funk Wav Bounces Vol. 1]]'' (2017) peaked at number two in both the United Kingdom and the United States, also becoming his third consecutive number one-album on the US [[Dance/Electronic Albums]] chart. His sixth studio album, ''[[Funk Wav Bounces Vol. 2]]'' (2022), served as a sequel to his previous release, and achieved commercial success internationally. He holds the [[Official Charts Company]] record for most number one singles in the United Kingdom during the 2010s decade, and in 2013 surpassed [[Michael Jackson]] and his record for the most top ten singles from one album, achieving nine from ''18 Months'', against Jackson's seven.\n\nIn October 2014 Harris became the first artist to place three songs simultaneously on the top 10 of ''[[Billboard (magazine)|Billboard]]''{{'s}} [[Dance/Electronic Songs]] chart. He also became the first UK solo artist to reach more than one billion streams on [[Spotify]]. Harris has received 23 [[Brit Awards|Brit Award]] nominations–winning [[Brit Award for British Producer of the Year|British Producer of the Year]] and [[Brit Award for British Single of the Year|British Single of the Year]] in 2019, as well as five Grammy nominations, including a win for [[Grammy Award for Best Music Video|Best Music Video]] in 2013. In 2013 he also received a [[Ivor Novello Award]], and was named the Top Dance/Electronic Artist at the [[2015 Billboard Music Awards|2015 ''Billboard'' Music Awards]]. He appeared on [[Debrett's]] 2017 list of the most influential people in the United Kingdom, and topped ''[[Forbes]]''{{'}} list of the world's highest-paid DJs for six consecutive years from 2013 to 2018.",
  "last_revision_date": "2026-02-01T01:44:58Z",
  "genres": [
    319,
    395,
    404,
    412,
    884
  ]
}