{
  "name": "Carmen Miranda",
  "description": "'''Maria do Carmo Miranda da Cunha'''{{efn Portuguese name|[[Miranda (surname)|Miranda]]|[[Cunha (surname)|Cunha]]}} {{post-nominals|post-noms=[[Order of Prince Henry|GCIH]], [[Ordem do Mérito Cultural|OMC]]}} (9 February 1909 – 5 August 1955), known professionally as '''Carmen Miranda''' ({{IPA|pt|ˈkaʁmẽj miˈɾɐ̃dɐ}}), was a Portuguese-Brazilian singer, dancer, and actress. Nicknamed \"the Brazilian Bombshell\",{{sfn|Dennison|Shaw|2004|p=112}} she was known for her signature [[fruit hat]] outfits that she wore in her American films.\n\nAs a young woman, Miranda designed clothes and hats in a boutique before making her debut as a singer, recording with composer Josué de Barros in 1929. Miranda's 1930 recording of \"Taí (Pra Você Gostar de Mim)\", written by Joubert de Carvalho, catapulted her to stardom in Brazil as the foremost interpreter of [[samba]].\n\nDuring the 1930s, Miranda performed on Brazilian radio and appeared in five Brazilian ''[[Cinema of Brazil#1930s and 1940s|chanchadas]]'', films celebrating Brazilian music, dance and the country's [[Carnival|carnival culture]]. ''[[Hello, Hello Brazil!]]'' and ''[[Hello, Hello, Carnival!]]'' embodied the spirit of these early Miranda films. The 1939 musical ''[[Banana da Terra]]'' (directed by Ruy Costa) gave the world her \"Baiana\" image, inspired by Afro-Brazilians from the north-eastern state of [[Bahia]].\n\nIn 1939, [[Broadway theatre|Broadway]] producer [[Lee Shubert]], after seeing Miranda perform at [[Urca Casino|Cassino da Urca]] in Rio de Janeiro, offered her an eight-week contract to perform in ''[[The Streets of Paris]]''.  The following year she made her first Hollywood film, ''[[Down Argentine Way]]'', co-starring [[Don Ameche]] and [[Betty Grable]], and her exotic clothing and Brazilian Portuguese accent became her trademark. That year, she was voted the third-most-popular personality in the United States; she and her group, Bando da Lua, were invited to sing and dance for President [[Franklin D. Roosevelt]]. In 1941, she was the first Latin American star to be invited to leave her handprints and footprints in the courtyard of [[Grauman's Chinese Theatre]] and was the first South American honored with a star on the [[Hollywood Walk of Fame]].  In 1943, Miranda starred in [[Busby Berkeley]]'s ''[[The Gang's All Here (1943 film)|The Gang's All Here]]'', which featured musical numbers with the fruit hats that became her trademark. By 1945, she was the highest-paid woman in the United States.\n\nMiranda made 14 Hollywood films between 1940 and 1953. Although she was hailed as a talented performer, her popularity waned by the end of [[World War II]]. Miranda came to resent the stereotypical \"Brazilian Bombshell\" image she had cultivated and attempted to free herself of it with limited success. She focused on nightclub appearances and became a fixture on television variety shows. Despite being stereotyped, Miranda's performances popularized Brazilian music and increased public awareness of Latin culture. Miranda is considered the precursor of Brazil's 1960s [[Tropicalismo]] cultural movement. A [[Carmen Miranda Museum|museum]] was built in Rio de Janeiro in her honor and she was the subject of the documentary ''[[Carmen Miranda: Bananas Is My Business]]'' (1995).\n{{TOC limit|3}}",
  "last_revision_date": "2025-11-20T03:44:35Z",
  "genres": [
    1067
  ]
}