{
  "name": "The Carter Family",
  "description": "'''The Carter Family''' was an [[American folk music]] group that recorded and performed between 1927 and 1956. Regarded as one of the most important music acts of the early 20th century, they had a profound influence on the development of [[bluegrass music|bluegrass]], [[country music|country]], [[Southern Gospel|southern gospel]], [[popular music|pop]], and [[rock music|rock]], as well as the [[Folk & blues revival|American folk revival]] in the 1960s.\n\nThey were the first vocal group to become country music stars, and were among the first groups to record commercially produced country music. Their first recordings were made in [[Bristol, Tennessee]], for the [[Victor Talking Machine Company]] under producer [[Ralph Peer]] on August 1, 1927. This was the day before country singer [[Jimmie Rodgers (country singer)|Jimmie Rodgers]] made his initial recordings for Victor under Peer.\n\nThe success of the Carter Family's recordings of songs such as \"[[Wabash Cannonball]]\", \"[[Can the Circle Be Unbroken (By and By)|Can the Circle Be Unbroken]]\", \"[[Wildwood Flower]]\", \"[[Keep on the Sunny Side]]\", and \"[[I'm Thinking Tonight of My Blue Eyes]]\" made these songs country standards. The melody of the last was used for [[Roy Acuff]]'s \"[[The Great Speckled Bird (song)|The Great Speckled Bird]]\", [[Hank Thompson (musician)|Hank Thompson]]'s \"[[The Wild Side of Life]]\" and [[Kitty Wells]]' \"[[It Wasn't God Who Made Honky Tonk Angels]]\". The song became a hit all over again in these other incarnations.\n\nThe original group consisted of  [[Sara Carter]], her husband [[A. P. Carter]], and her sister-in-law [[Maybelle Carter]]. Maybelle was Sara's first cousin, and was married to A. P.'s brother [[Ezra Carter]] (Eck). All three were born and raised in [[southwest Virginia]]. They were immersed in the tight harmonies of mountain [[gospel music]] and [[shape note]] singing. The latter dated to the early 19th century and revivals in the South.\n\nThroughout the group's career, Sara Carter sang lead vocals and played rhythm guitar or [[autoharp]]. Maybelle sang harmony and played lead guitar. On some songs A. P. did not perform at all; on some songs he sang harmony and background vocals, and occasionally he sang lead. Maybelle's distinctive guitar-playing style became a hallmark of the group. Her [[Carter Family picking|Carter Scratch]] (a method for playing both lead and rhythm on the guitar) has become one of the most copied styles of guitar playing.\n\nThe group (in all its incarnations, see below) recorded for a number of labels, including RCA Victor (and subsidiary label, Bluebird), ARC group, Columbia, [[Okeh Records|Okeh]] and various imprint labels.",
  "last_revision_date": "2025-10-16T22:13:18Z",
  "genres": [
    139,
    289,
    504,
    879
  ]
}