{
  "name": "Celtic Frost",
  "description": "'''Celtic Frost''' ({{IPAc-en|ˈ|k|ɛ|l|t|ɪ|k|_|f|r|ɒ|s|t}}) was a Swiss [[metal music|heavy metal]] band from [[Zürich]]. They are remembered for their strong influence on the development of several metal subgenres, particularly [[extreme metal]], and for their [[avant-garde metal|avant-garde]] approach to music in general.\n\nIn June 1984, guitarist and vocalist [[Thomas Gabriel Fischer]] and bassist [[Martin Eric Ain]] formed Celtic Frost after disbanding their previous band, [[Hellhammer]], a month earlier. Celtic Frost's debut record, ''[[Morbid Tales]]'', was released in November of that year. This was followed by the full-length studio albums ''[[To Mega Therion (album)|To Mega Therion]]'' (1985) and ''[[Into the Pandemonium]]'' (1987). All three records are considered highly influential landmarks in heavy metal. While each contains elements of avant-garde composition, ''Into the Pandemonium'' is particularly noted for its unique style and experimentation with musical boundaries beyond the heavy metal genre.\n\nCeltic Frost's next album, ''[[Cold Lake (album)|Cold Lake]]'' (1988), featured a new lineup and a dramatic stylistic shift, which was widely criticized for its commercial and flamboyant tone. After releasing ''[[Vanity/Nemesis]]'' (1990), the band temporarily disbanded. Celtic Frost re-formed in 2001 and released the critically acclaimed ''[[Monotheist (album)|Monotheist]]'' (2006), eventually disbanding permanently following Fischer's departure in 2008.\n\nThroughout the band's career, their music incorporated elements from various extreme metal styles. Their early work is often classified as [[thrash metal]] or [[black metal]] with experimental tendencies, while their final album is described as [[doom metal]]. Celtic Frost drew inspiration from early heavy metal bands such as [[Black Sabbath]], [[Judas Priest]], and [[Venom (band)|Venom]], [[gothic rock]] acts like [[Bauhaus (band)|Bauhaus]], [[Siouxsie and the Banshees]], [[Christian Death]], and [[Joy Division]], as well as [[hardcore punk]] groups like [[Discharge (band)|Discharge]] and [[GBH (band)|GBH]].",
  "last_revision_date": "2025-10-16T22:09:51Z",
  "genres": [
    76,
    130,
    360,
    1210
  ]
}