{
  "name": "Chelsea Grin",
  "description": "'''Chelsea Grin''' is an American [[deathcore]] band from [[Salt Lake City]], Utah. Formed in 2007, the group have released two EPs and seven full-length albums. Since 2018, no founding members remain in the band. Despite not being in the original line-up, bassist David Flinn has been the only constant member on all the group's studio albums.\n\nChelsea Grin was originally founded under the name ''Ahaziah''. The lineup for Ahaziah included vocalist Alex Koehler, guitarist Chris Kilbourn, bassist Austin Marticorena and lead guitarist Michael Stafford. Marticorena introduced Andrew Carlston to Chelsea Grin and assisted in rewriting their songs as well as the creation of new material as they changed the name to Chelsea Grin soon after. \nThis writing process led to the tracks on their first release, a [[Chelsea Grin (EP)|self-titled EP]] that was streamed and released online through [[iTunes]],  then released on CD worldwide on July 27, 2008. Early on in the band's career, they released the songs \"Crewcabanger\" and \"Lifeless\" as singles, both of which were received well by listening audiences on [[Myspace]].\n\nThe band later sought to add a third guitarist position which led to the acquisition of Dan Jones and  David Flinn  which followed into the writing of their full-length album ''[[Desolation of Eden]]'' (2010), following up this record was ''[[My Damnation]]'' (2011) before cutting into a 2012 EP titled ''[[Evolve (EP)|Evolve]]''. \n\nIn 2013, Pablo Viveros replaced founding drummer Andrew Carlston and started contributing vocals to their music, allowing lead vocalist Koehler to focus solely on the screamed vocals while Viveros took on the mid to low-ranged growls. Since then, the band released two more full-lengths, ''[[Ashes to Ashes (Chelsea Grin album)|Ashes to Ashes]]'' in 2014 and ''[[Self Inflicted (album)|Self Inflicted]]'' in 2016. As of 2018, the band ended their longtime tenure of featuring three guitarists to now only featuring one. That same year, vocalist Koehler departed from the band and was replaced with former [[Lorna Shore]] vocalist Tom Barber. With this new four-piece lineup, Chelsea Grin officially released their fifth album ''[[Eternal Nightmare (Chelsea Grin album)|Eternal Nightmare]]'' on July 13, 2018.",
  "last_revision_date": "2025-11-02T08:38:37Z",
  "genres": [
    332
  ]
}