{
  "name": "Cherry Poppin' Daddies",
  "description": "The '''Cherry Poppin' Daddies''' are an American [[swing music|swing]] and [[ska]] band established in [[Eugene, Oregon]], in 1989. Formed by singer-songwriter [[Steve Perry (Oregon musician)|Steve Perry]] and bassist [[Dan Schmid]], the band has experienced numerous personnel changes over the course of its 30-year history, with only Perry, Schmid and trumpeter [[Dana Heitman]] currently remaining from the original founding lineup.\n\nThe Daddies' music is primarily a mix of [[swing music|swing]] and [[ska]], contrastingly encompassing both traditional [[jazz]]-influenced variations of the genres as well as contemporary rock and [[punk rock|punk]] hybrids, characterized by a prominent [[horn section]] and Perry's acerbic and [[innuendo]]-laced lyricism often concerning dark or political subject matter. While the band's earliest releases were mostly grounded in punk and [[funk rock]], their later studio albums have since incorporated elements from many diverse genres of [[popular music]] and [[Americana (music)|Americana]] into their sound, including [[rockabilly]], [[rhythm and blues]], [[soul music|soul]] and [[world music]].\n\nInitially drawing both acclaim and controversy as a preeminent regional band, the Daddies gained wider recognition touring nationally within the American ska scene before ultimately breaking into the musical mainstream with their 1997 swing compilation ''[[Zoot Suit Riot (album)|Zoot Suit Riot]]''. Released at the peak of the 1990s [[swing revival]], ''Zoot Suit Riot'' sold over two million copies in the United States while its [[Zoot Suit Riot (song)|eponymous single]] became a radio hit, launching the Daddies to the forefront of the neo-swing movement. By the end of the decade, however, interest in the swing revival had swiftly declined, along with the band's commercial popularity. The resultant failure of their subsequent album ''[[Soul Caddy]]'' contributed to an abrupt hiatus in 2000.\n\nThe Daddies officially regrouped in 2002 to resume part-time touring, eventually returning to recording with the independently released ''[[Susquehanna (album)|Susquehanna]]'' in 2008. Their twelfth album, the swing and jazz-influenced ''At the Pink Rat'', was released in July 2024.",
  "last_revision_date": "2025-05-21T04:24:27Z"
}