{
  "name": "Chicane",
  "description": "'''Nicholas Bracegirdle''' (born 28 February 1971), known professionally as '''Chicane''', is an English musician, DJ,  composer, songwriter, and record producer. Among his works are [[Single (music)|singles]] \"[[Offshore (song)|Offshore]]\", an Ibiza [[Trance music|trance]] anthem included in many compilations in both chill-out and dance versions; \"[[Saltwater (Chicane song)|Saltwater]]\", which featured vocals by [[Clannad (musical group)|Clannad]] member [[Máire Brennan]], and the UK number-one hit \"[[Don't Give Up (Chicane song)|Don't Give Up]]\", featuring vocals by [[Bryan Adams]], which also became a top ten hit on singles charts across Europe and Australia.\n\n''[[Far from the Maddening Crowds]]'', Chicane's debut studio album from 1997, is still considered a seminal release among the [[trance music]] community, and his second studio album, 2000's ''[[Behind the Sun (Chicane album)|Behind the Sun]]'', was [[Music recording sales certification|certified gold]] in the UK. In 2007, after the hindrance of an ultimately unreleased album (''[[Easy to Assemble (album)|Easy to Assemble]]'') in the intervening time, the third artist album ''[[Somersault (Chicane album)|Somersault]]'' was released on Bracegirdle's [[independent record label]], followed shortly after by a tenth anniversary re-release of ''Far from the Maddening Crowds'' which included a new mix of \"Offshore\" (\"Offshore 2007\"). He released his fourth [[studio album]] ''[[Giants (Chicane album)|Giants]]'' in 2010, with the fifth studio album ''[[Thousand Mile Stare]]'' following less than two years later, in spring 2012. The sixth studio album, ''[[The Sum of Its Parts]]'', appeared in early 2015, and his seventh studio album, ''[[The Place You Can't Remember, the Place You Can't Forget]]'', was released in 2018. His eighth studio album, ''[[Everything We Had to Leave Behind]]'', was released in 2021, and his ninth studio album ''Nevertheless'', was released two years later in 2023. His latest album ''Trampolines'' was released in 2024.\n\nIn addition, Bracegirdle also worked with Leo Elstob under the alias Disco Citizens, producing a handful of less radio-friendly, vocal-less tracks with a stronger [[progressive house]] sound. Working with singer [[Vanessa Quinones|Vanessa St. James]] and producer Mr. Joshua, Bracegirdle was part of the Mr. Joshua Presents [[Vanessa Quinones|Espiritu]] project, known for the song \"In Praise of the Sun\", released with both English and French vocals. Bracegirdle contributed with executive production on Tomski's \"14 Hours to Save the Earth\". Nick Bracegirdle has also used the alias, Sitvac, to produce a one-time single, \"Wishful Thinking\".",
  "last_revision_date": "2025-09-16T07:26:49Z",
  "genres": [
    48,
    87,
    397,
    566,
    1224
  ]
}