{
  "name": "Chris Tomlin",
  "description": "'''Christopher Dwayne Tomlin''' (born May 4, 1972) is an American [[contemporary Christian music]] singer, songwriter, and [[worship leader]] from [[Grand Saline, Texas]]. He is signed to [[Universal Music Group|Universal]]'s [[Capitol Christian Music Group]]. Some of his most well-known songs are \"[[How Great Is Our God (song)|How Great Is Our God]]\", \"[[Our God (song)|Our God]]\", \"[[Whom Shall I Fear (God of Angel Armies)]]\" and \"[[Holy Forever]]\".\n\nIn 2006, according to Christian Copyright Licensing International (CCLI), an organization that licenses music to churches, Tomlin was the most often sung contemporary artist in U.S. congregations. Tomlin has produced 21 number-one radio singles, 30 top-ten hits (more than any other Christian artist), and spent over 158 weeks at number-one during his career. He has sold more than 12 million albums with more than 7 Billion career global streams, won a [[Grammy Awards|Grammy]], three [[Billboard Music Awards]], 31 [[GMA Dove Award]]s, is a two-time [[BMI Film & TV Awards|BMI]] Songwriter of the Year honoree, and is an [[American Society of Composers, Authors and Publishers|ASCAP]] Songwriter of the Year. In 2016, he was named one of only four artists to ever receive the Sound Exchange Digital Radio Award for over 1 billion digital radio streams, alongside [[Justin Timberlake]], [[Pitbull (rapper)|Pitbull]], and [[Garth Brooks]]. Tomlin is also the first Christian artist to reach 1 billion streams on [[Pandora (service)|Pandora]] and was presented with their BILLIONAIRE award. Regarded as one of the most successful Christian touring artists today, Tomlin has sold-out venues including [[New York City]]’s [[Madison Square Garden]], [[Nashville, Tennessee|Nashville’s]] [[Bridgestone Arena]], [[Denver|Denver's]] [[Red Rocks Amphitheatre]], and LA’s [[BMO Stadium|Banc of California Stadium]]. His “Good Friday Nashville” concerts have frequently sold out. The event holds\nthe record as the longest running annual charity related concert at Bridgestone Arena.",
  "last_revision_date": "2025-08-30T10:00:16Z",
  "genres": [
    275,
    279
  ]
}