{
  "description": "'''Priscilla Maria Veronica White''' (27 May 1943&nbsp;– 1 August 2015), better known as '''Cilla Black''', was an English singer and television presenter.\n\nChampioned by her friends [[the Beatles]], Black began her career as a singer in 1963. Her singles \"[[Anyone Who Had a Heart (song)|Anyone Who Had a Heart]]\" and \"[[You're My World]]\" both reached number one in the UK in 1964. She had 11 top 10 hits on the [[UK Singles Chart]] between then and 1971 and an additional eight hits that made the top 40. In May 2010, new research published by [[BBC Radio 2]] showed that her version of \"Anyone Who Had a Heart\" was the UK's biggest-selling single by a female artist in the 1960s. \"You're My World\" reached No. 14 in [[CHUM Chart|Canada]] and was also a modest hit in the U.S., peaking at No. 26 on the [[Billboard Hot 100|''Billboard'' Hot 100]].\n\nAlong with a successful recording career in the 1960s and early 1970s, Black hosted her own BBC variety show, ''[[Cilla (1968 TV series)|Cilla]]'' (1968–1976). After a brief time as a comedy actress, she became a prominent television presenter in the 1980s and 1990s, hosting hit entertainment shows such as ''[[Blind Date (British game show)|Blind Date]]'' (1985–2003), ''[[Surprise Surprise (British TV series)|Surprise Surprise]]'' (1984–2001) and ''[[The Moment of Truth (British game show)|The Moment of Truth]]'' (1998–2001). In 2013, Black celebrated 50 years in show business. [[ITV (TV network)|ITV]] honoured this milestone with a one-off entertainment special which aired on 16 October 2013, ''[[The One and Only (TV programme)|The One and Only Cilla Black]]'', featuring Black herself and hosted by [[Paul O'Grady]]. In 2006, the British public ranked Black number 36 in ITV's poll of [[TV's 50 Greatest Stars]].\n\nBlack died on 1 August 2015 aged 72, after a fall in her holiday villa in [[Estepona]], in Spain. The day after her funeral, the compilation album ''[[The Very Best of Cilla Black (2013 album)|The Very Best of Cilla Black]]'' (2013) went to number one on the [[UK Albums Chart]] and the [[New Zealand Albums Chart]]; it was her first number one album. In 2017, a statue of Black commissioned by her sons was unveiled outside [[the Cavern Club]]'s original entrance.",
  "last_revision_date": "2025-05-27T17:44:24Z"
}