{
  "name": "Claudia Leitte",
  "description": "'''Cláudia Cristina Leite Inácio''' ({{IPA|pt-BR|ˈklawdʒɐ ˈlejtʃi|lang}}; born 10 July 1980){{r|birthdate}} is a Brazilian singer and television personality. She rose to fame in late 2002 as the lead vocalist of the [[Axé (music)|Axé music]] group Babado Novo. The group achieved a string of consecutive [[Music recording sales certification|diamond]]-certified hit singles in Brazil and five golden and platinum albums from 2003 to 2007, as granted by the Brazilian Association of Record Producers ([[Associação Brasileira dos Produtores de Discos|ABPD]]).\n\nLeitte embarked on a solo career and released her first solo album ''[[Ao Vivo em Copacabana]]'' (2008), recorded live in front of a crowd of over a million people. The album was awarded gold and triple platinum certifications and established the singer as one of Brazil's greatest stars. The lead single from the album, \"Exttravasa\", hit number one on the Brazilian charts – becoming one of the best-selling singles of the year along with topping radio airplays. 2010 saw the release of Leitte's first studio album ''[[As Máscaras]]'' which topped ''[[Billboard (magazine)|Billboard]]''{{'}}s Brazilian Albums chart and earned her a [[Latin Grammy]] [[Latin Grammy Award for Best Brazilian Contemporary Pop Album|Best Brazilian Contemporary Pop Album]] nomination. Along with [[Pitbull (rapper)|Pitbull]] and [[Jennifer Lopez]], she recorded \"[[We Are One (Ole Ola)]]\", which served as the [[FIFA World Cup official songs|official song]] of the [[2014 FIFA World Cup]].\n\nWith more than 40 million followers on [[Facebook]], [[Instagram]] and [[Twitter]] combined, she is one of the most powerful and popular female acts in Brazil and Latin America, having sold over 10 million records and being the recipient for many awards including a Latin Grammy and three [[World Music Awards]] nominations for 2014 alone. Aside from her musical career, she also served as coach and mentor on the [[The Voice Brasil|Brazilian version]] of television show ''[[The Voice (TV series)|The Voice]]'', ''[[The Voice Kids (Brazilian TV series)|The Voice Kids]]'', and ''[[The Voice + (Brazilian TV series)|The Voice +]]''. On the variations of ''The Voice'' she was featured on, Leitte was the winning coach for two seasons.",
  "last_revision_date": "2025-11-22T20:42:05Z",
  "genres": [
    78,
    698,
    941,
    1035,
    1041
  ]
}