{
  "name": "Cliff Richard",
  "description": "'''Sir Cliff Richard''' (born '''Harry Rodger Webb'''; 14 October 1940) is a British singer and actor. He has total sales of over 21.5&nbsp;million singles in the United Kingdom and, as of 2012, was the third-top-selling artist in [[UK Singles Chart]] history, behind [[the Beatles]] and [[Elvis Presley]]. \n\nRichard was originally marketed as a rebellious [[rock and roll]] singer in the style of Presley and [[Little Richard]]. With his backing group, [[the Shadows]], he dominated the British popular music scene in the pre-Beatles period of the late 1950s to early 1960s. His 1958 hit single \"[[Move It]]\" is often described as Britain's first authentic [[rock and roll]] song. In the early 1960s, he had a successful screen career with films including ''[[The Young Ones (1961 film)|The Young Ones]]'', ''[[Summer Holiday (1963 film)|Summer Holiday]]'' and ''[[Wonderful Life (1964 film)|Wonderful Life]]'' and his own television show at the BBC. Increased focus on his Christian faith and subsequent softening of his music led to a more [[Middle of the road (music)|middle-of-the-road]] image, and he sometimes ventured into [[contemporary Christian music]].\n\nIn [[#Discography|a career]] spanning over 65 years, Richard has amassed several gold and platinum discs and awards, including two [[Ivor Novello]] Awards and three [[Brit Awards]]. More than 130 of his singles, albums, and [[Extended play|EPs]] have reached the UK Top 20, more than any other artist. Richard has had 67 UK top ten singles, the second highest total for an artist (behind Presley). He holds the record, with Presley, as the only act to make the UK singles charts in all of its first six decades (1950s–2000s). He has achieved 14 UK No. 1 singles, and is the only singer to have had a No. 1 single in the UK in each of five consecutive decades. He also had four [[List of UK Singles Chart Christmas number ones|UK Christmas No. 1 singles]], two of which were as a solo artist; \"[[Mistletoe and Wine]]\" and \"[[Saviour's Day (song)|Saviour's Day]]\".\n\nBy the late-1990s, Richard had sold more than 250 million records worldwide, making him one of [[List of best-selling music artists|the best-selling music artists of all time]]. He has never achieved the same popularity in the United States despite eight US Top 40 singles, including the million-selling \"[[Devil Woman (Cliff Richard song)|Devil Woman]]\" and \"[[We Don't Talk Anymore (Cliff Richard song)|We Don't Talk Anymore]]\". In Canada, he had a successful period in the early 1960s, the late 1970s and early 1980s, with some releases certified gold and platinum. He has remained a popular music, film, and television personality at home in the UK as well as Australia, New Zealand, South Africa, Northern Europe and Asia, and retains a following in other countries. When not touring, he divides his time between Barbados and Portugal. In 2019, he relocated to New York.",
  "last_revision_date": "2025-06-07T17:08:57Z",
  "genres": [
    914,
    273,
    1030,
    1022,
    912
  ]
}