{
  "name": "CoCo Lee",
  "description": "'''CoCo Lee''' ({{lang-zh|c=李玟}}; 17 January 1975 – 5 July 2023) was a [[Chinese-American]] singer, songwriter, and actress. She was one of the best-selling artists in Asia and is widely regarded as a significant figure and a [[diva]]. Her career began in 1993 in Hong Kong, and she gained early fame in Taiwan through a series of successful albums, establishing herself as an icon. She released 18 studio albums, 2 live records, and 5 compilations.\n\nLee, who was described as the \"Asian [[Mariah Carey]]\", was noted for her Americanized dance routines. She voiced the lead character of [[Fa Mulan]] in the Mandarin version of the 1998 [[The Walt Disney Company|Disney]] film ''[[Mulan (1998 film)|Mulan]]'' and sang its theme song, \"[[Reflection (song)|Reflection]]\".\n\nLee was the first Chinese singer to have music released globally, making her the first Chinese singer to break into the western market. Her 1999 album ''[[Just No Other Way]]'' was the first ever English-language album recorded by a Chinese singer. Her 2000 single \"[[Do You Want My Love]]\" achieved international success, appearing on the US ''[[Billboard (magazine)|Billboard]]'' Hot Dance Breakouts Chart at No. 4 and entering the top 50 of the US [[Billboard Dance/Club Play|Billboard Dance Club Songs Chart]] while also peaking at No. 14 on the [[ARIA Charts|Australian Singles Chart]] and No. 20 on the [[Recorded Music NZ|Official Chart in New Zealand]].\n\nHer 2000 song \"[[A Love Before Time]]\", from the film ''[[Crouching Tiger, Hidden Dragon]]'', was nominated for the [[Academy Awards|Academy Award]] for [[Best Original Song]], and she performed it at the [[73rd Academy Awards]], becoming the first, and so far only, Chinese artist to perform at the Oscars. Lee was also the first Asian-American singer to sing the [[US National Anthem]] at an [[National Basketball Association|NBA]] game, the first Asian singer to hold a concert at the [[Walt Disney Concert Hall]] in Los Angeles, the first non-mainland Chinese singer to win the Chinese singing reality show ''[[Singer (TV series)|I Am a Singer]]'', and the first Asian brand ambassador for [[Chanel]]. In her final years, Lee struggled with health problems, having been diagnosed with [[Major depressive disorder|depression]] in 2019. She died by [[suicide]] in Hong Kong in 2023, aged 48.",
  "last_revision_date": "2026-01-29T07:29:48Z",
  "genres": [
    191,
    281,
    319,
    564,
    950
  ]
}