{
  "name": "Cocteau Twins",
  "description": "'''Cocteau Twins''' were a Scottish [[rock music|rock]] band active from 1979 to 1997. They were formed in [[Grangemouth]] on the [[Firth of Forth]] by [[Robin Guthrie]] (guitars, [[drum machine]]) and Will Heggie (bass), adding [[Elizabeth Fraser]] (vocals) in 1981. In 1983, Heggie was replaced with multi-instrumentalist [[Simon Raymonde]]. The group earned critical praise for their ethereal, [[Audio signal processing|effects]]-laden sound and the [[soprano]] vocals of Fraser, whose lyrics often eschew any recognisable language. They pioneered the 1980s [[alternative rock|alternative]] subgenre of [[dream pop]] and helped define what would become [[shoegaze]].\n\nIn 1982, the band signed with the record label [[4AD]] and released their debut album ''[[Garlands (album)|Garlands]]''. The addition of Raymonde in 1983 solidified their best-known lineup, which soon produced the No. 29 UK hit \"[[Pearly-Dewdrops' Drops]]\", their highest-charting UK single. The trio crystallised their \"swelling, euphoric\" dream pop style on the 1984 album ''[[Treasure (Cocteau Twins album)|Treasure]]'', which became the band's first UK Top 40 album.\n\nIn 1988, Cocteau Twins signed with [[Capitol Records]] in the U.S. distributing their fifth album ''[[Blue Bell Knoll]]'' through that major label in the country. After the 1990 release of their most commercially successful album, ''[[Heaven or Las Vegas]]'', the band left 4AD for [[Fontana Records]], where they released their final two albums. \n\nAfter nearly 20 years together, the group disbanded in 1997 in part due to issues stemming from the disintegration of Fraser and Guthrie's romantic relationship. In 2005, the band announced that they would reunite to headline [[Coachella Valley Music and Arts Festival|Coachella Festival]] but the reunion was cancelled a month later after Fraser declaring being unable to work again with ex-partner Guthrie.",
  "last_revision_date": "2025-08-04T11:55:30Z",
  "genres": [
    1100,
    411,
    360,
    510,
    942
  ]
}