{
  "name": "Cocteau Twins",
  "description": "'''Cocteau Twins''' were a Scottish [[rock music|rock]] band active from 1979 to 1997. They were formed in [[Grangemouth]] on the [[Firth of Forth]] by [[Robin Guthrie]] (guitars, [[drum machine]]) and Will Heggie (bass), adding [[Elizabeth Fraser]] (vocals) in 1981. In 1983, Heggie was replaced by multi-instrumentalist [[Simon Raymonde]]. The group earned critical praise for their ethereal, [[Audio signal processing|effects]]-laden sound and the [[soprano]] vocals of Fraser, whose lyrics often eschew any recognisable language. They pioneered the 1980s [[alternative rock|alternative]] subgenre of [[dream pop]] and helped define what would become [[shoegaze]].\n\nIn 1982, the band signed with the record label [[4AD]] and released their debut album, ''[[Garlands (album)|Garlands]]''. The addition of Raymonde in 1983 solidified their best-known lineup, which soon produced the No. 29 UK hit \"[[Pearly-Dewdrops' Drops]]\", their highest-charting UK single. The trio crystallised their \"swelling, euphoric\" dream pop style on the 1984 album ''[[Treasure (Cocteau Twins album)|Treasure]]'', which became the band's first UK Top 40 album. In April 1986, they released their fourth album, ''[[Victorialand]]'', becoming their first top ten album in the United Kingdom, and in November 1986 released ''[[The Moon and the Melodies]]'', a collaborative album with American composer [[Harold Budd]]. In 1988, they released the critically acclaimed single \"[[Carolyn's Fingers]]\" which achieved commercial success on the ''[[Billboard (magazine)|Billboard]]'' [[Alternative Airplay]] charts in the United States, reaching number two.\n\nTheir fifth album ''[[Blue Bell Knoll]]'' (1988) continued a period of strong commercial success in both the United Kingdom and the United States, as well as achieving moderate commercial success in Australia. Their sixth album, ''[[Heaven or Las Vegas]]'' (1990) became their most commercially successful album in the United Kingdom, reaching number seven on the national albums charts and being certified Silver by the [[British Phonographic Industry]] (BPI). A critically acclaimed album, it was listed as the 90th best album of the 1990s by ''Pitchfork'', who complimented Fraser's more direct vocals and the album's complex songwriting. It was also included in the 2008 edition of ''[[1001 Albums You Must Hear Before You Die]]'', and in ''[[The Guardian]]''{{'s}} online edition of a similar list.\n\nBy 1993, the band had left 4AD for [[Fontana Records]], and released their seventh album ''[[Four-Calendar Café]]'' (1993). Despite their considerable commercial success in the United States by this point, they made their debut American television appearance performing the single \"[[Bluebeard (song)|Bluebeard]]\". ''Four-Calendar Café'' became their highest charting album on the ''Billboard'' 200 in the United States, reaching number seventy-eight. They released their eighth and final album ''[[Milk & Kisses]]'' in April 1996, supported by two singles – \"[[Tishbite (song)|Tishbite]]\" and \"[[Violaine]]\". After nearly 20 years together, the group disbanded in 1997 in part due to issues stemming from the disintegration of Fraser's and Guthrie's romantic relationship.",
  "last_revision_date": "2025-11-14T18:47:03Z",
  "genres": [
    363,
    412,
    510,
    954
  ]
}