{
  "name": "Coil",
  "description": "'''Coil''' were an English [[experimental music]] group formed in 1982 in London and dissolved in 2005. Initially envisioned as a solo project by musician [[John Balance]] (of the band [[Psychic TV]]), Coil evolved into a full-time project with the addition of his partner and Psychic TV bandmate [[Peter Christopherson]] (formerly of pioneering [[industrial music]] group [[Throbbing Gristle]]). Coil's work explored themes related to [[the occult]], [[sexuality]], [[alchemy]], and drugs while influencing genres such as [[gothic rock]], [[neofolk]] and [[dark ambient]]. [[AllMusic]] called the group \"one of the most beloved, mythologized groups to emerge from the British [[post-industrial music|post-industrial]] scene.\"\n\nAfter the release of their 1984 debut EP ''[[How to Destroy Angels (Coil EP)|How to Destroy Angels]]'', Coil joined [[Some Bizzare Records]], through which they released two full-length albums, ''[[Scatology (album)|Scatology]]'' (1985) and ''[[Horse Rotorvator]]'' (1986). In 1985, the group began working on a series of soundtracks, among them the [[The Unreleased Themes for Hellraiser|rejected score]] for the first ''[[Hellraiser]]'' film. After departing from Some Bizzare, Coil established their own record label, [[Threshold House]], through which they produced and released ''[[Love's Secret Domain]]'' (1991). Financial difficulties slowed the group's work in the early 1990s before they returned to the project on releases such as ''[[Astral Disaster]]'' (1999), and the ''Musick to Play in the Dark'' series  composed of ''[[Musick to Play in the Dark Vol. 1|Vol. 1]]'' (1999) and ''[[Musick to Play in the Dark Vol. 2|Vol. 2]]'' (2000), as well as releasing several projects under aliases such as Black Light District, ELpH, and Time Machines.\n\nBalance and Christopherson were the only constant members; other contributors throughout the band's career included [[Stephen Thrower]], [[Danny Hyde]], [[Drew McDowall]], [[William Breeze]], [[Thighpaulsandra]] and [[Ossian Brown]]. With involvement from these members, the group also started several smaller independent vanity labels, including [[Eskaton]] and [[Chalice (record label)|Chalice]]. The group's first live performance in 16 years occurred in 1999, and began a series of mini-tours that would last until 2004. Following the accidental death of John Balance on 13 November 2004, Christopherson formally announced that Coil as a creative entity had ceased to exist, ending the Coil discography with ''[[The Ape of Naples]]'' (2005). Posthumous releases and compilations of unreleased material have since followed this. Christopherson died in 2010.",
  "last_revision_date": "2025-11-27T21:19:54Z",
  "genres": [
    77,
    401,
    601
  ]
}