{
  "name": "Cold Blank",
  "description": "'''Cold Blank''' is an American, Los Angeles–based electronic [[house music]] DJ/production project, created by American DJ/producer '''Christopher Gaspar'''. Formerly a collaboration along with DJ/producer '''Manuel Luquin''', they parted ways in late 2013.\n\nWith early beginnings stemming from the underground party scene in Los Angeles, the former duo launched their company Burn The Fire in 2007 to brand their events and pop-up parties that helped pave the way for the explosion of [[Electronic dance music|EDM]] before they began working together on production. In autumn of 2009, the Burn The Fire brand evolved into a record label and talent agency. The label's catalog features high-profile and international guest artists including [[Sean Tyas]], Lazy Rich, [[Joachim Garraud]], [[Fukkk Offf]], [[Sharooz]], Reid Speed, and many more.\n\nCold Blank saw early success with several singles and remixes on top labels such as [[Dim Mak Records]] and [[Ultra Music]] that climbed to the top of multiple digital music distributor charts including a remix of [[Cypress X Rusko]] feat. [[Damian Marley]] that climbed up to #1 on Beatport's Top 100 [[Hip Hop]] chart. Since 2008, Cold Blank has toured extensively worldwide including dates in South Korea, Brazil, Italy, Britain, France, Spain, Australia, New Zealand, Canada, and Mexico.\n\nIn late 2012, the former duo released '''''The Agenda''''', Cold Blank's first [[studio album]] which was released on 6 August 2012 through Burn The Fire Records. Notable collaborators on the album include [[Andy Taylor (guitarist)|Andy Taylor]] (formerly of [[Duran Duran]]) and [[Moving Units|Blake Miller]], with press coverage ranging from [[MTV|MTV Music]]'s \"MTV Hive\", ''DJ Times'', and [[Artistdirect]]. In addition, Cold Blank was nominated in the ‘Top 100 DJs In America’ poll by DJ Times magazine, America's first magazine dedicated to DJs and DJ culture.",
  "last_revision_date": "2024-04-10T05:00:54Z",
  "genres": [
    371,
    367,
    861,
    565,
    37,
    387,
    388
  ]
}