{
  "name": "Cold Engines",
  "description": "'''Cold Engines''' is an American rock band from [[Boston]], Massachusetts, United States, composed of Dave Drouin (guitar and vocals), Aaron Zaroulis (drums and vocals), Eric Reingold (bass and vocals) and Geoff Pilkington (percussion). The band was founded in 2014 by Boston [[session guitarist]] and songwriter, Dave Drouin and has since released eleven studio albums. Cold Engines was awarded 'Rock Act of the Year' at the 2016 [[New England Music Awards]] and was nominated for 'Song of the Year' at the 2017 NEMA awards for the single, \"Show You Crazy.\" Critics note the group's use of intricate vocal harmonies and describe their sound as a blend of rock fueled [[Rhythm and blues|R&B]] and [[Soul music|soul]] music. Cold Engines is known by fans for their virtuosic live performances and have supported touring American rock bands [[Blues Traveler]], [[Rustic Overtones]], and [[Los Lobos]]. In 2021 Cold Engines released a series of full-length studio albums. On January 1, came their sixth record, “The Last Resort” a rock opera based on the [[Paul Verhoeven]] directed 1990 the Sci-Fi film, [[Total Recall (1990 film)|Total Recall]]. This concept album was received favorably with press making note of its urgency and lyrical depth. In May 2021 Cold Engines released \"One Of Us Now\" which critics noted as having a lush and romantic vocal aesthetic. The following record, Couyon, was released on June 4, 2021, and quickly became a fan favorite for its variety of instrumentation, colorful rhythms and passionate vocal performances. The band explored new territory with their next release, Gargantua, a heavy metal influenced concept album based on the story of an interplanetary soldier trapped in orbit around a supermassive black hole. With their final album of 2021, Cold Engines changed gears again with Flower Covered Hills. Acoustic instruments were featured in this album which was noted for its honesty and sweetness as well as its dreamy and cinematic qualities.",
  "last_revision_date": "2024-04-11T21:30:02Z",
  "genres": [
    827,
    314,
    1020,
    1106,
    40,
    1119,
    575
  ]
}