{
  "name": "Corazón Serrano",
  "description": "'''Corazón Serrano''' is a [[Peruvian cumbia]] group founded on February 24, 1993, in the village of Bellavista de Cachiaco, [[Pacaipampa District|Pacaipampa district]], [[Ayabaca province]], [[Department of Piura|Piura]]. Directed by the Guerrero Neyra brothers, it is recognized by the newspaper ''[[El Comercio (Peru)|El Comercio]]'' as one of the country's most streamed musical acts. As of 2025, its lead vocalists are Yrma Guerrero, Lesly Águila, Susana Alvarado, Ana Lucia Urbina, Kiara Lozano, Milagros Díaz, Briela Cirilo, and Cielo Fernández. Edwin Guerrero serves as vocalist, director, and general producer, supported by Dani Daniel as host, and a band featuring Dany Morales, Jhon Chumo, Pedro Arroyo, Jorge León, Alexander Hurtado, Frank Pasapera, and Henry Patiño.\n\nInitially formed by brothers Lorenzo and Edwin Guerrero with vocalists Yrma and Edita, the group developed its career in northern Peru from 1994 onward. However, it was in 2010 that Corazón Serrano began a steady ascent, adopting styles from [[Ecuador]] and [[Colombia]]. The inclusion of Lesly Águila and the success of \"Tu ausencia\" – initially intended for male vocalist Renzo Palacios – significantly expanded its popularity across [[Lima]] and much of [[Peru]]. With the subsequent addition of Thamara Gómez (2011) and Estrella Torres (2013), the orchestra released major hits such as \"Díganle\" and \"Cómo se olvida\" (feat. Thamara), \"Vete\" (feat. Lesly), and \"Cuatro mentiras\" (feat. Estrella). Despite the passing of key member Edita Guerrero in early 2014 and the departures of Lesly Águila (2014), Estrella Torres (2015), and Thamara Gómez (2016), the group maintained its activity. In 2018, Lesly Águila returned, and the lineup grew to include up to eight female vocalists, strengthening its presence in neighboring Bolivia and Ecuador. Meanwhile, Lorenzo Guerrero founded the sister group El Encanto de Corazón in 2015, which features several former members of Corazón Serrano, including his daughter Melanie Guerrero.",
  "last_revision_date": "2026-01-19T18:04:50Z",
  "genres": [
    770,
    926
  ]
}