{
  "name": "Corrosion of Conformity",
  "description": "'''Corrosion of Conformity''' (often abbreviated as '''C.O.C.''') is an American [[Heavy metal music|heavy metal]] band from [[Raleigh, North Carolina]], formed in 1982. The band has undergone multiple lineup changes throughout its existence, with lead guitarist Woody Weatherman as the sole constant member. Weatherman, founding bassist [[Mike Dean (musician)|Mike Dean]], founding drummer [[Reed Mullin]] and vocalist/rhythm guitarist [[Pepper Keenan]] (who joined the band in 1989) are widely regarded as its \"classic\" lineup. After a hiatus in 2006, Corrosion of Conformity returned in 2010 without Keenan, who had been busy touring and recording with [[Down (band)|Down]], but announced their reunion with him in December 2014. More lineup changes have happened since then, with John Green replacing Mullin after his death in 2020 and Dean (who first left Corrosion of Conformity in 1987 and rejoined in 1993) departing from the band once again in 2024.\n\nThey started as a [[hardcore punk]] band but later moved towards a slower and [[blues]]-tinged heavy metal sound. To date, the band has released ten studio albums, four EPs, one compilation, and one live album. Their first three studio albums―''[[Eye for an Eye (Corrosion of Conformity album)|Eye for an Eye]]'' (1984), ''[[Animosity (Corrosion of Conformity album)|Animosity]]'' (1985) and ''[[Blind (Corrosion of Conformity album)|Blind]]'' (1991)―attracted the attention of [[Columbia Records]], who signed the band in 1993. Corrosion of Conformity found success with the release of their 1994 fourth studio album, ''[[Deliverance (Corrosion of Conformity album)|Deliverance]]'', which peaked at number 155 on the [[Billboard 200|''Billboard'' 200]] and spawned the hits \"Albatross\" and \"[[Clean My Wounds]]\". Their 1996 follow-up ''[[Wiseblood (Corrosion of Conformity album)|Wiseblood]]'' was also successful, and at the time, it was the band's highest-charting album in the United States, peaking at number 104 on the ''Billboard'' 200. Their latest album, ''[[No Cross No Crown (album)|No Cross No Crown]]'', was released in 2018 and became the band's first album to enter the top 100 on the ''Billboard'' 200, where it peaked at number 67.",
  "last_revision_date": "2025-10-13T19:30:44Z",
  "genres": [
    539,
    1120,
    1140,
    1157
  ]
}