{
  "name": "Cream",
  "description": "'''Cream''' were a [[British rock]] [[Supergroup (music)|supergroup]] formed in London in 1966. The group consisted of bassist [[Jack Bruce]], guitarist [[Eric Clapton]] and drummer [[Ginger Baker]]. Bruce was the primary songwriter and vocalist, although Clapton and Baker contributed to songs. Formed by members of previously successful bands, they are widely considered the first supergroup. Cream were highly regarded for the instrumental proficiency of each of their members.\n\nDuring their brief three-year career, the band released four albums: ''[[Fresh Cream]]'' (1966), ''[[Disraeli Gears]]'' (1967), ''[[Wheels of Fire]]'' (1968), and ''[[Goodbye (Cream album)|Goodbye]]'' (1969). Beginning with ''Disraeli Gears'', the band was joined in the studio by producer and multi-instrumentalist [[Felix Pappalardi]]. Their music spanned rock styles such as [[blues rock]], [[psychedelic rock|psychedelia]], and [[hard rock]]. Throughout their career, they sold more than 15 million records worldwide. The group's third album, ''Wheels of Fire'' (1968), is the first [[Music recording sales certification|platinum-selling]] [[double album]]. They scored international hits with singles such as \"[[Sunshine of Your Love]]\" (1967) and \"[[White Room]]\" (1968).\n\nTensions between Bruce and Baker led to their decision in May 1968 to break up, although the band were persuaded to make a final album, ''Goodbye'', and to tour, culminating in two final farewell concerts at the [[Royal Albert Hall]] on 25 and 26 November 1968 which were filmed and shown in theatres, then in 1977 released as a home video, ''[[Farewell Concert]]''. Bruce died in 2014 followed by Baker in 2019, leaving Clapton as the last living member of the group.\n\nIn 1993, Cream were inducted into the [[Rock and Roll Hall of Fame]]. They were included in both ''[[Rolling Stone's 100 Greatest Artists of All Time|Rolling Stone]]'' and [[VH1]]'s lists of the \"100 Greatest Artists of All Time\", at number 67 and 61 respectively. They were also ranked number 16 on VH1's \"100 Greatest Artists of Hard Rock\".",
  "last_revision_date": "2025-09-07T18:41:18Z",
  "genres": [
    5,
    140,
    532,
    620,
    976
  ]
}