{
  "name": "Curtis Mayfield",
  "description": "'''Curtis Lee Mayfield''' (June 3, 1942 – December 26, 1999) was an American singer-songwriter, guitarist, and record producer. Dubbed the \"[[Honorific nicknames in popular music|Gentle Genius]]\", he is considered one of the most influential musicians of [[soul music|soul]] and socially conscious [[African-American music]]. Mayfield first achieved success and recognition with the vocal group [[the Impressions]] during the [[civil rights movement]] of the late 1950s and the 1960s, and later worked as a solo artist.\n\nMayfield started his musical career in a [[gospel music|gospel]] choir. Moving to the [[North Side, Chicago|North Side]] of Chicago, he met [[Jerry Butler]] in 1956 at the age of 14 and joined the Impressions.  The group's lead singer and primary songwriter, Mayfield became noted as one of the first musicians to bring more prevalent themes of social awareness into soul music. In 1965, he wrote \"[[People Get Ready]]\" for the Impressions, which was ranked No. 24 in ''[[Rolling Stone]]''{{'}}s list of the \"[[500 Greatest Songs of All Time]]\" in 2004. The song received numerous other awards; it was included in the Rock and Roll Hall of Fame's \"500 Songs that Shaped Rock and Roll\", and was inducted into the [[Grammy Hall of Fame]] in 1998.\n\nAfter leaving the Impressions in 1970 in pursuit of a solo career, Mayfield released several albums throughout the decade, including his debut ''[[Curtis (Curtis Mayfield album)|Curtis]]'' (1970) and the [[Super Fly (soundtrack)|soundtrack]] for the 1972 [[blaxploitation]] film ''[[Super Fly (1972 film)|Super Fly]]''. The soundtrack was noted for its socially conscious themes, primarily addressing issues that heavily affected inner city residents and racial minorities such as crime, poverty and [[substance abuse|drug abuse]]. The album was ranked No. 72 in ''Rolling Stone''{{'}}s list of the \"[[Rolling Stone's 500 Greatest Albums of All Time|500 Greatest Albums of All Time]]\" in 2003.\n\nOn August 13, 1990, Mayfield was paralyzed from the neck down during an accident in which lighting equipment fell on him during a live performance at Wingate Field in [[Flatbush, Brooklyn]], New York. Despite this, he continued his career as a recording artist, releasing his final album ''[[New World Order (album)|New World Order]]'' in 1996. Mayfield won a [[Grammy Legend Award]] in 1994 and a [[Grammy Lifetime Achievement Award]] in 1995. He is a double inductee into the [[Rock and Roll Hall of Fame]], as a member of the Impressions in 1991, and again in 1999 as a solo artist. He is also a three-time [[Grammy Hall of Fame]] inductee. He died from complications of [[type 2 diabetes]] at the age of 57 on December 26, 1999.",
  "last_revision_date": "2025-09-16T00:39:02Z",
  "genres": [
    460,
    506,
    965,
    975,
    1033,
    1134
  ]
}