{
  "name": "Daddy Yankee",
  "description": "'''Ramón Luis Ayala Rodríguez''' ({{IPA|es|raˈmon lwis aˈʝala roˈðɾiɣes|lang}}; born February 3, 1976), known professionally as '''Daddy Yankee''' ({{IPA|es|ˈdædi ˈjæŋki}}), is a Puerto Rican rapper, singer, songwriter, and actor who rose to worldwide prominence in 2004 with the song \"[[Gasolina]]\". Dubbed the \"[[Honorific nicknames in popular music|King of Reggaeton]]\", he is often cited as an influence by other Hispanic urban performers. He retired on December 3, 2023, after completing his final stage performance on his \"La Meta\" tour in [[Puerto Rico]].\n\nAyala was born in [[Río Piedras, Puerto Rico|Río Piedras]] and was raised in the Villa Kennedy Housing Projects neighborhood. He aspired to be a professional baseball player and tried out for the [[Seattle Mariners]] of [[Major League Baseball]]. Before he could be officially signed, he was hit by a stray round from an [[AK-47]] rifle while taking a break from a studio recording session with reggaeton artist [[DJ Playero]]. Ayala spent roughly a year and a half recovering from the wound; the bullet was never removed from his hip, and he credits the shooting incident with allowing him to focus entirely on a music career.\n\nIn 2004, Daddy Yankee released his international hit single \"Gasolina\", which is credited with introducing reggaeton to audiences worldwide, and making the music genre a global phenomenon. Since then, he has sold around 30 million records, making him [[List of best-selling Latin music artists|one of the best-selling Latin music artists]]. Daddy Yankee's album ''[[Barrio Fino]]'' made history when it became the top-selling [[Latin music (genre)|Latin music]] album of the decade between 2000 and 2009.\n\nIn 2017, Daddy Yankee, in collaboration with Latin pop singer [[Luis Fonsi]], released the hit single \"[[Despacito]]\". It became the first Spanish-language song to hit number one on the [[Billboard Hot 100|''Billboard'' Hot 100]] since \"[[Macarena (song)|Macarena]]\" in 1996. The single gained global success. The video for \"Despacito\" on [[YouTube]] received its billionth view on April 20, 2017, and became [[List of most-liked YouTube videos|the most-liked video]] on the platform. Its success led Daddy Yankee to become the most-listened artist worldwide on the streaming service [[Spotify]] in June 2017, the first Latin artist to do so. In March 2022, Daddy Yankee announced that he would be retiring from music after the release of his seventh studio album ''[[Legendaddy (album)|Legendaddy]]'' and its supporting tour.\n\nDuring his career, Daddy Yankee earned numerous [[List of awards and nominations received by Daddy Yankee|accolades]], including five [[Latin Grammy Award]]s, two [[Billboard Music Awards|''Billboard'' Music Awards]], 14 [[Billboard Latin Music Awards|''Billboard'' Latin Music Awards]], two [[Latin American Music Awards]], eight Lo Nuestro Awards, an [[MTV Video Music Award]], and six ASCAP Awards. He also received a Puerto Rican Walk of Fame star, special awards by ''[[People en Español]]'' magazine, and the Presencia Latina at Harvard University. He was named by [[CNN]] as the \"Most Influential Hispanic Artist\" of 2009, and included in [[Time 100|''Time'' 100]] in 2006.",
  "last_revision_date": "2025-05-27T06:06:40Z",
  "genres": [
    315,
    678,
    1011
  ]
}