{
  "page_title": "Damas Gratis",
  "description": "'''<big>Beginning</big>''' \n\nIn 1999, Pablo Lescano created the musical group Flor de Piedra. The following year, he suffered a motorcycle accident that left him unable to walk for several months. When he was in bed, he began to create what would later be called Damas Gratis. The name is in reference to the ticket office signs: \"Caballeros $10 / Damas Gratis\", alluding to the fact that they were also going to be at the concerts. Lescano started looking for a singer for his cumbia group, as time went by he decided to sing himself. He made his first song called \"Se te ve la Tanga\" in the beginning and later in the same year he composed the others, making up a total of 12 songs for the demo that would later become the first album, Para los Pibes, remastered in 2001.\n\n'''<big>Rise to Fame & Controversy</big>'''\n\nThe music and rhythm of the Damas Gratis group continued to advance until it transcended the limits of tropical music, as reflected in various articles published in the main newspapers of Argentina such as: [[Clarín Group|Clarin]], [[La Nación]],[4] [[El País (Uruguay)|El País]],[5] [[Buenos Aires Herald]] and magazines of the magnitude like [[Rolling Stone]][6] that also dealt with this phenomenon that revolutionized the tropical scene. At a certain point, Damas Gratis and most of the cumbia villera groups were questioned and in a certain way banned due to the strong themes of their lyrics.\n\nAware of this problem, the then president of Argentina, [[Néstor Kirchner]], took action on the matter and prepared a lunch to which Pablo Lescano, the driver Daniel \"La Tota\" Santillán and other personalities from that movement were invited. Someone close to the President suggested that they seek the support of traditional singers and groups of the genre, as a kind of endorsement before the public and the media. [[Néstor Kirchner]] himself pointed out the name of Rodolfo Garavagno, whom he had known since the time of his campaign for President of the Nation, to be in charge of that task. Astutely involved in the matter, Garavagno came to the conclusion that the ideal artist to support the return of Damas Gratis was Koli Arce, the most successful tropical music singer of the last 25 years in Argentina. That's how Lescano and his group returned to television, led by Koli Arce and his Imperial Quintet. To give greater seriousness to the support of this popular performer from Santiago del Estero, Lescano sang two songs as a duet: \"Punto final\" and \"Mujer endemoniada\", emblematic songs of the so-called tropical movement, composed by Rodolfo Garavagno himself.\n\n'''<big>2012 - now</big>'''\n\nIn November 2012, Damas Gratis were awarded the Carlos [[Premios Gardel|Gardel Award]] for \"Best Tropical Group Album\" for ''“Esquivando el Exito”''. The most successful song of this material is ''\"Aqui la tienes\"'', composed by Rodolfo Garavagno and Koli Arce, which was performed as a duet by Pablo Lescano and the international singer Vicentico. With this album and songs of this magnitude (love lyrics), Damas Gratis became, from that moment, the most successful Argentine tropical music group.[9] On December 7, they performed their fifth recital at the [[Estadio Luna Park|Stadium of Luna Park]] with tickets completely sold out where with guest musicians they celebrated their years in activity with their audience. In 2018, its popularity returned when it performed at the [[Lollapalooza|Lollapalooza Argentina festival]] where the cumbia genre was presented at this festival for the first time, making one of the band's best performances. At this festival he became very popular thanks to the cover song of ''\"No te creas tan Importante\"'' with ''Viru Kumbierón'', which was one of the most listened to songs in 2018 in Argentina and was heard in several Latin American countries.[10 ]Then with the version ''\"Me vas a Extrañar\"'' with the same artist as the previous song, he reconsolidated his popularity with the public.\n\nThe vocalist participated in films such as [[El bonaerense|El Bonaerense]] (2002)[13] and ''Todoterreno: La Pelicula'' (2009), a film by the rock band ''[[:es:Kapanga|Kapanga]]''.\n\nIn December 2021, Romina Lescano announced her departure from the group through social networks. Hours later, she clarified that this was because during her stay in the band, she received a lot of verbal and psychological abuse on repeated occasions from her brother, Pablo Lescano.",
  "last_revision_date": "2025-02-13T18:24:47Z"
}