{
  "name": "Dance Gavin Dance",
  "description": "'''Dance Gavin Dance''' is an American [[Rock music|rock]] band from [[Sacramento, California]], formed in 2005. It consists of lead guitarist [[Will Swan (musician)|Will Swan]], drummer Matthew Mingus, harsh vocalist Jon Mess, and lead vocalist and rhythm guitarist Andrew Wells. The band formerly included lead vocalists [[Jonny Craig]], [[Kurt Travis]], and [[Tilian Pearson]], and the lineup has changed numerous times since their inception. Swan and Mingus are the only band members who have appeared on every studio album.\n\nThe band released their debut [[Extended play|extended play (EP)]], ''[[Whatever I Say Is Royal Ocean]]'', in 2006 and signed to [[Rise Records]] thereafter. Their debut studio album, ''[[Downtown Battle Mountain]],'' was released in May 2007. Craig and guitarist Sean O'Sullivan left the group and were replaced by [[Kurt Travis]] and Zachary Garren, respectively. They released their album, ''[[Dance Gavin Dance (album)|Dance Gavin Dance]]'', in August 2008. Vocalist Jon Mess and bassist Eric Lodge left the group before the album's release, with Lodge being replaced by Jason Ellis. ''[[Happiness (Dance Gavin Dance album)|Happiness]]'', the group's third studio album, was released in June 2009.\n\nIn 2010, [[Jonny Craig]], Jon Mess and Eric Lodge returned to the band and recorded their fourth studio album, ''[[Downtown Battle Mountain II]]'' (2011). Craig and Lodge departed from the group the following year, which led to bassist Tim Feerick, guitarist Josh Benton, and former [[Tides of Man]] vocalist [[Tilian Pearson]] joining the band. They released their fifth studio album, ''[[Acceptance Speech (Dance Gavin Dance album)|Acceptance Speech]]'' (2013); Benton left the band shortly after the album's release. Their sixth studio album, ''[[Instant Gratification]],'' was released in April 2015. The following year, the group released the live album, ''[[Tree City Sessions]]'', and their seventh studio album, ''[[Mothership (Dance Gavin Dance album)|Mothership]]'', the latter charting at number 13 on the [[Billboard 200|''Billboard'' 200]]. They released their eighth studio album, ''[[Artificial Selection (album)|Artificial Selection]]'', in June 2018, placing at number 15 on the ''Billboard'' 200. In 2020, they released their ninth studio album, ''[[Afterburner (Dance Gavin Dance album)|Afterburner]]'' in April, which placed at number 14 on the [[Billboard 200|''Billboard'' 200]], and ''[[Tree City Sessions 2]]'' in December.\n\nBassist Tim Feerick died in 2022, prior to the release of the band's tenth album, ''[[Jackpot Juicer]]'', leading to Sianvar and [[Royal Coda]] guitarist Sergio Medina taking over on live bass duties. Pearson underwent a brief hiatus from the band in 2022 following sexual assault allegations before parting ways with the band in 2024.\n\nThe band has achieved four top-twenty albums in the US, including one top 10.",
  "last_revision_date": "2025-12-19T16:12:46Z",
  "genres": [
    425,
    746,
    955,
    976
  ]
}