{
  "name": "Daughtry",
  "description": "'''Daughtry''' {{IPAc-en|ˈ|d|ɔː|t|r|i}} is an American [[Rock music|rock]] band formed and fronted by namesake [[Chris Daughtry]], who was a finalist on the [[American Idol (season 5)|fifth season]] of ''[[American Idol]]''. Their [[Daughtry (album)|self-titled debut album]] was released in November 2006 and reached number one on the [[Billboard 200|''Billboard'' 200]]. The album went on to sell more than six million copies in the United States, and has been certified six times platinum by the [[Recording Industry Association of America|RIAA]]. ''Daughtry'' was also named the best selling album of 2007 by ''Billboard'', becoming the fastest-selling debut rock album in [[Nielsen SoundScan]] history. The album produced four top 20 hits on the [[Billboard Hot 100|''Billboard'' Hot 100]], including top five hits \"[[It's Not Over (Daughtry song)|It's Not Over]]\" and \"[[Home (Daughtry song)|Home]]\".\n\nThe band's second album, ''[[Leave This Town]]'', was released in July 2009 and debuted at number one on the ''Billboard'' 200 chart, becoming Daughtry's second number one album in the United States. To date, ''Leave This Town'' has sold over 1.3 million copies in the United States and has been certified platinum by the RIAA. The album's lead single, \"[[No Surprise (Daughtry song)|No Surprise]]\", became the band's fifth top 20 hit on the Hot 100. Their third studio album, ''[[Break the Spell]]'', was released in November 2011 and debuted within the top 10 on the ''Billboard'' 200 chart. The album has been certified Gold by the [[Recording Industry Association of America|RIAA]]. Daughtry's fourth studio album, ''[[Baptized (album)|Baptized]]'', was released in November 2013, and debuted at number six on the ''Billboard'' 200 chart, selling approximately 90,000 units. They released their fifth and sixth albums, ''[[Cage to Rattle]]'' and ''[[Dearly Beloved (Daughtry album)|Dearly Beloved]]'', in July 2018 and September 2021, respectively. To date, Daughtry has sold over 9 million albums and over 25.6 million digital tracks in the U.S.",
  "last_revision_date": "2026-01-31T21:27:31Z",
  "genres": [
    541,
    952,
    963
  ]
}