{
  "page_title": "Dave Dee, Dozy, Beaky, Mick & Tich",
  "description": "'''Dave Dee, Dozy, Beaky, Mick & Tich''' are an English [[rock music|rock]] band active during the 1960s. Formed in [[Salisbury]] in 1964, the band consisted of [[Dave Dee|David Harman]] (Dave Dee), [[Trevor Ward-Davies]] (Dozy), John Dymond (Beaky), Michael Wilson (Mick) and [[Ian Amey]] (Tich). Their novel name, zany stage act and lurid dress sense helped propel them to chart success with a string of hit singles penned by songwriters [[Ken Howard (composer)|Ken Howard]] and [[Alan Blaikley]] including \"[[Hold Tight (Dave Dee, Dozy, Beaky, Mick & Tich song)|Hold Tight!]]\", \"[[Bend It]]!\" and \"[[Zabadak (song)|Zabadak!]]\". Over the course of the band's career, they played several different genres, including [[freakbeat]], [[Mod (subculture)|mod]] and [[pop music|pop]]. Two of their single releases sold in excess of one million copies each, and they reached number one in the [[UK Singles Chart]] with the second of them, \"[[The Legend of Xanadu]]\". Unlike many other British bands of the 1960s who were associated with the [[British Invasion|British invasion of the United States]], Dave Dee, Dozy, Beaky, Mick & Tich had limited commercial US success. They did better in [[Canada]] with 7 songs in the top 100.  \n\nSince their original break-up in 1973, the band has reunited in various formations. All but the original \"Mick\" have since returned to the band, with the remaining four continuing without him. Dave Dee came to gigs occasionally until his death in 2009; following his death, they dropped the \"Dave Dee\" from the band name out of respect. Until the mid-2010s, Dozy and Tich led the band consistently until Tich's retirement in 2014 (and eventual death in 2024) and Dozy's death in January 2015. As of 2024, the band continue to tour, being regular guests on UK based sixties nostalgia circuits, with a lineup featuring the original Beaky.",
  "last_revision_date": "2025-06-15T23:41:40Z"
}