{
  "name": "Dead Artist Syndrome",
  "description": "'''Dead Artist Syndrome''' was a [[Christian rock|Christian]] [[gothic rock]] band formed in 1989 in [[Orange County, California|Orange County]], [[California]]. The group consisted of singer-songwriter Brian Healy and a rotating cast of side men. Healy was dubbed the \"father of Christian goth\" by [[Rozz Williams]], and was an ordained minister. The name of D.A.S. according to Healy is \"Dead Artist Syndrome means greater in death than in life, be it James Dean, Van Gogh or Jesus Christ\". His debut album ''[[Prints of Darkness]]'' was a notable, groundbreaking release. The band had been sporadically active due to health issues, releasing two albums in the 2000s, and another in 2015. In 2006, Dead Artist Syndrome was named \"Outstanding Orange County Band\" by the editors and readers of [[Rock City News]], a [[Los Angeles]] local music paper. For several years Healy was privately in poor health his gallbladder exploded while recording vocals resulting in emergency surgery, and a neurological disorder his wife Marie Tullai Healy described as \"a combination of Michael J. Fox and the late Foster Brooks everybody thought he was drunk, Brian was falling down he broke his arm, slurring his speech trying to complete his record, next thing we know he's in a wheelchair, finally in 2012 they discovered the cause and he had brain surgery and is 100% back to his old self and had no idea any of this was going on, inside his head everything was fine\". Healy said on his Facebook page 'He's back\" and is actively recording, producing others and hosting Frontline Records Rewind Broadcast and podcast Healy died January 12, 2020, of a brain hemorrhage.{{Primary source inline|date=January 2020}}\n\nDead Artist Syndrome has included members of [[Undercover (band)|Undercover]], [[The Choir (alternative rock band)|The Choir]], [[Lifesavers Underground|L.S.U.]], [[The 77's]], and [[Jeff Elbel|Ping]] backing Healy.",
  "last_revision_date": "2025-11-17T06:14:01Z",
  "genres": [
    254,
    512
  ]
}