{
  "name": "Death Grips",
  "description": "'''Death Grips''' is an American [[experimental hip-hop]] band formed in 2010 in [[Sacramento, California]]. The group consists of producers [[Zach Hill]] (drums), Andy Morin (keyboard), and vocalist Stefan Burnett, also known as [[MC Ride]]. Though he is not the group's frontman, Hill has been credited with being the driving creative force behind the project. Drawing from [[rap music|rap]], [[punk rock]], [[electronic music|electronic]], [[noise music|noise]], and [[industrial music|industrial]] styles, the band's innovative and often difficult-to-categorize sound earned them critical acclaim and a [[cult following]], while their aggressive performance style and cryptic interactions with their fans and the media gained widespread notoriety.\n\nThe group released the mixtape ''[[Exmilitary]]'' in April 2011 and their debut studio album, ''[[The Money Store (album)|The Money Store]]'', a year later; both received critical praise. Shortly after signing to [[Epic Records]] in 2012, the group leaked their second album, ''[[No Love Deep Web]]'', for free download in breach of their contract and were dropped from the label. They subsequently launched the label Third Worlds in association with [[Harvest Records]], and released their third album, ''[[Government Plates]]'', in 2013. Following several broken performance commitments, the group announced their disbanding in July 2014 along with the release of their fourth album, a [[double album]] titled ''[[The Powers That B]]''. The group leaked the first disc of this double album, ''Niggas on the Moon'', in 2014. In early 2015, before releasing the second disc, ''[[Jenny Death]]'', the group released an instrumental \"soundtrack\" album titled ''[[Fashion Week (album)|Fashion Week]]''. In March 2015, the group revealed that they \"might make some more\" music, and later announced a world tour.\n\nLater in 2015, Death Grips announced their fifth official studio album, ''[[Bottomless Pit (album)|Bottomless Pit]]'', which was released in May 2016. Their sixth studio album, ''[[Year of the Snitch]]'', was released in June 2018. Their fourth EP, ''[[Gmail and the Restraining Orders]]'', was released in June 2019 in celebration of [[Warp Records]]' 30th anniversary. Beyond some previously unreleased material added to their website in 2023, no new music has been  published by the band since. A leaked conversation between a fan and Morin in 2025 suggested that Death Grips had disbanded, but this was later disputed by Hill and Burnett on an Instagram post.",
  "last_revision_date": "2025-09-11T15:13:36Z",
  "genres": [
    38,
    402,
    593,
    987,
    1009
  ]
}