{
  "name": "Deep Purple",
  "description": "'''Deep Purple''' are an English [[Rock music|rock]] band formed in London in 1968. They are considered to be among the pioneers of [[heavy metal music|heavy metal]] and modern [[hard rock]], although their musical style has varied throughout their career. Originally formed as a [[psychedelic rock]] and [[progressive rock]] band, they shifted to a heavier sound with their 1970 album ''[[Deep Purple in Rock]]''. Deep Purple have been referred to as being part of the \"unholy trinity of British hard rock and heavy metal in the early to mid-'70s\", alongside [[Led Zeppelin]] and [[Black Sabbath]]. Listed in the 1975 ''[[Guinness World Records|Guinness Book of World Records]]'' as \"[[Loudest band|the globe's loudest band]]\" for a 1972 concert at London's [[Rainbow Theatre]], they have sold over 100&nbsp;million records worldwide. Deep Purple have also generated several successful spinoff bands, including [[Rainbow (rock band)|Rainbow]], [[Whitesnake]], and [[Gillan (band)|Gillan]].\n\nDeep Purple were founded by vocalist [[Rod Evans]], guitarist [[Ritchie Blackmore]], bassist [[Nick Simper]], keyboardist [[Jon Lord]] and drummer [[Ian Paice]]. After three studio albums, the \"Mark I\" line-up came to an end in 1969 when Evans and Simper were dismissed from the band and replaced by [[Ian Gillan]] and [[Roger Glover]] respectively, forming the classic \"Mark II\" line-up of Deep Purple. Following the orchestral collaboration ''[[Concerto for Group and Orchestra]]'' (1969), the Mark II line-up recorded four studio albums – ''Deep Purple in Rock'' (1970), ''[[Fireball (album)|Fireball]]'' (1971), ''[[Machine Head (album)|Machine Head]]'' (1972) and ''[[Who Do We Think We Are]]'' (1973) – and a live album – ''[[Made in Japan (Deep Purple album)|Made in Japan]]'' (1972) – that cemented their popularity and played a key role in shaping the emerging genres of hard rock and heavy metal. Gillan and Glover both left the band in 1973 and were replaced by [[David Coverdale]] and [[Glenn Hughes (musician)|Glenn Hughes]] respectively. The \"Mark III\" line-up recorded two studio albums – ''[[Burn (Deep Purple album)|Burn]]'' and ''[[Stormbringer (album)|Stormbringer]]'' (both 1974) – before Blackmore parted ways with the band in 1975 due to musical differences. He was replaced by [[Tommy Bolin]], though after just one studio album with the \"Mark IV\" line-up – ''[[Come Taste the Band]]'' (1975) – Deep Purple disbanded in July 1976 and Bolin died from a drug overdose five months later.{{rp|191}}\n\nThe \"Mark II\" line-up reunited in 1984, and recorded two studio albums – ''[[Perfect Strangers (Deep Purple album)|Perfect Strangers]]'' (1984) and ''[[The House of Blue Light]]'' (1987) – before Gillan was fired from Deep Purple in 1989, due to creative and personal differences within the band. He was replaced by [[Joe Lynn Turner]], who appeared on one album with Deep Purple – ''[[Slaves and Masters]]'' (1990) – before his dismissal from the band in 1992. After Gillan returned for their next album, ''[[The Battle Rages On...]]'' (1993), Blackmore left Deep Purple once again in 1993, and was replaced temporarily by [[Joe Satriani]] and then permanently by [[Steve Morse]].{{rp|271}} The \"Mark VII\" line-up (consisting of Paice, Lord, Gillan, Glover and Morse) lasted for nearly a decade, to which the band recorded two studio albums – ''[[Purpendicular]]'' (1996) and ''[[Abandon (album)|Abandon]]'' (1998) – before Lord retired from Deep Purple in 2002 and was replaced by [[Don Airey]], leaving Paice as the only remaining original member. The \"Mark VIII\" line-up of Paice, Gillan, Glover, Morse and Airey was the longest line-up in the band's history, spanning twenty years and six studio albums. Their first line-up change in twenty years took place in 2022, when Morse left Deep Purple after twenty-eight years as their guitarist and was replaced by [[Simon McBride]].\n\nDeep Purple were ranked number 22 on [[VH1]]'s ''Greatest Artists of Hard Rock'' programme, and a poll on radio station [[Planet Rock (radio station)|Planet Rock]] ranked them fifth among the \"most influential bands ever\". The band received the Legend Award at the 2008 [[World Music Awards]]. Deep Purple were inducted into the [[Rock and Roll Hall of Fame]] in 2016.",
  "last_revision_date": "2025-11-18T04:38:39Z",
  "genres": [
    533,
    548,
    970
  ]
}