{
  "name": "Def Leppard",
  "description": "'''Def Leppard''' are an English [[Rock music|rock]] band formed in [[Sheffield]] in 1977. Since 1992, the band has consisted of [[Rick Savage]] (bass, backing vocals), [[Joe Elliott]] (lead vocals), [[Rick Allen (drummer)|Rick Allen]] (drums), [[Phil Collen]] (guitar, backing vocals), and [[Vivian Campbell]] (guitar, backing vocals). They established themselves as part of the [[new wave of British heavy metal]] of the early 1980s. Their greatest commercial success came between the early 1980s and mid-1990s.\n\nWith a line-up of Savage, Elliott, Allen and guitarists [[Steve Clark]] and [[Pete Willis]], the band's first album, 1980's ''[[On Through the Night]]'', reached the Top 15 in the UK but received little notice elsewhere.  Their second album, 1981's ''[[High 'n' Dry]]'', was produced by [[Robert John \"Mutt\" Lange|Mutt Lange]], who helped them to define their melodic hard rock style. The album's most popular track \"[[Bringin' On the Heartbreak]]\" became one of the first rock videos played on [[MTV]] in 1982, but the album reached only the Top 30 and 40 in the UK and US. Willis was replaced by Collen in 1982. Their next studio album, ''[[Pyromania (album)|Pyromania]]'', was released in January 1983, with \"[[Photograph (Def Leppard song)|Photograph]]\" and \"[[Rock of Ages (Def Leppard song)|Rock of Ages]]\" both topping the US Rock Tracks chart and reaching the top 20 of the Hot 100. Reaching No. 2 on the US album chart, ''Pyromania'' was certified [[RIAA certification|Diamond]] in the US. It reached the top 20 in the UK but did not sell much elsewhere. The band's fourth album, the more pop-oriented ''[[Hysteria (Def Leppard album)|Hysteria]]'' (1987), topped the UK, US, Canadian and Australian charts, and remained on the charts for over two years, from 1987 to 1989. It has been certified 12× platinum for sales in the US, selling over 30 million copies worldwide to date, making it one of the [[List of best-selling albums|best-selling albums]] of all time. It spawned six Top 20 US singles, including the US [[Billboard Hot 100|''Billboard'' Hot 100]] No. 1 \"[[Love Bites (Def Leppard song)|Love Bites]]\". Singles also included \"[[Pour Some Sugar on Me]]\" (US No. 2), \"[[Hysteria (Def Leppard song)|Hysteria]]\", \"[[Armageddon It]]\" (US No. 3), \"[[Animal (Def Leppard song)|Animal]]\" (at No. 6, the biggest UK hit), and \"[[Rocket (Def Leppard song)|Rocket]]\" (a Top 15 hit in many countries).\n\nClark died in 1991, with the band recording their next studio album, ''[[Adrenalize]]'', as a four-piece. The album reached No. 1 on the UK, US and Australian charts in 1992. It contained several hits, including the ''Billboard'' chart-topper \"[[Let's Get Rocked]]\", which became their biggest hit in several countries, including No. 2 in the UK. The third single, \"[[Have You Ever Needed Someone So Bad]]\", was a Top 10 song in the US, UK and Canada. ''Adrenalize'' went on to sell over eight million copies worldwide. Campbell joined the band soon after the album's completion. Their 1993 album, ''[[Retro Active]]'', contained the [[Acoustic music|acoustic]] Top 5 hit \"[[Two Steps Behind]]\". Their greatest-hits album ''[[Vault: Def Leppard Greatest Hits (1980–1995)|Vault]]'', released in 1995, featured the UK No. 2 hit \"[[When Love & Hate Collide]]\" and reached the Top 10 in several countries, going 5× platinum in the US. Beginning with ''[[Slang (album)|Slang]]'', Def Leppard released five albums between 1996 and 2008, with most usually reaching the Top 15 in several countries, including the UK, US and Canada. Their [[Def Leppard (album)|self-titled album]], released in 2015, reached the Top 10 in several countries. Their newest studio album, ''[[Diamond Star Halos]]'', was released in May 2022 and reached the Top 10 in the US, UK and Australia.\n\nAs one of the [[List of best-selling music artists|world's best-selling music artists]], Def Leppard have sold more than 100 million records worldwide, and have two albums with [[Recording Industry Association of America|RIAA]] [[RIAA certification|diamond certification]]: ''Pyromania'' and ''Hysteria'', making them one of only five rock bands with two original studio albums selling more than 10 million copies in the US. The band were ranked No.&nbsp;31 in [[VH1]]'s \"100 Greatest Artists of Hard Rock\" and No.&nbsp;70 in \"100 Greatest Artists of All Time\". They were inducted into the [[Rock and Roll Hall of Fame]] in 2019.",
  "last_revision_date": "2025-06-16T01:26:54Z",
  "genres": [
    528,
    61,
    489,
    542,
    936
  ]
}