{
  "name": "Despina Vandi",
  "description": "'''Despina Malea''' ({{langx|el|Δέσποινα Μαλέα}}; born 22 July 1969), known as '''Despina Vandi''' ({{lang|el|Δέσποινα Βανδή}}), is a Greek singer. Born in [[Tübingen]] near [[Stuttgart]], Germany, Vandi's family returned to [[Kavala]], Greece when she was six years old.\n\nAfter moving to [[Athens]] in the early 1990s, Vandi signed with [[Minos EMI]] and released two albums ''[[Gela Mou]]'' (1994) and ''[[Esena Perimeno]]'' (1996). She then began an exclusive collaboration with [[songwriter]]/[[music producer|producer]] [[Phoebus (songwriter)|Phoebus]] and achieved commercial success with her third album, ''[[Deka Endoles]]'' (1997), followed by the multi-platinum ''[[Profities]]'' (1999), as she established a more \"pop\" stage performance style and image, becoming one of the most prominent artists of the laïko/pop genre.\n\nHer single \"[[Ipofero]]\" (2000) became the best-selling single of all-time in Greece. Following Phoebus' departure from Minos EMI, Vandi followed him to the newly formed independent label [[Heaven Music]] and released ''[[Gia (album)|Gia]]'' (2001), which became and remains her biggest commercial success, as well as one of the best-selling albums of all time in Greece and Cyprus. Vandi also released the album abroad and the self-titled single \"[[Gia (song)|Gia]]\", topping the US ''[[Billboard (magazine)|Billboard]]'' [[Hot Dance Airplay]] and making her the first Greek artist to top a ''Billboard'' chart. She returned with ''[[Stin Avli Tou Paradeisou]]'' (2004), which was certified multi-platinum and became her fourth album to achieve six-figure sales. In 2007 ''[[10 Hronia Mazi]]'', a ten-year celebration of her collaboration with Phoebus was released, followed by her eighth studio album ''[[C'est La Vie (Despina Vandi album)|C'est La Vie]]''. In 2012 she released the album ''[[Allaxa]]'', which was certified 2× platinum sales and has been her first double platinum record since 2005.\n\nVandi has won three [[IFPI Greece|Arion Music Awards]], ten MAD Video Music Awards, seven Pop Corn Music Awards, and a [[World Music Award]], becoming the first Greek artist recording in Greece to ever win the award. On 14 March 2010, [[Alpha TV]] ranked Vandi the fourth top-certified Greek female artist in the nation's phonographic era (since 1960), with 11 records having been certified platinum or multi-platinum and three gold by the [[IFPI Greece|International Federation of the Phonographic Industry of Greece]]. According to Heaven Music, as of 2007, Vandi has sold one million records in Greece. In the aftermath of her success, Vandi gained the title of the \"queen\" of Greek music. From 2013 to 2015, she was one of the four artists/coaches participating in the Greek version of ''[[The Voice (TV series)|The Voice]]'' called ''[[The Voice of Greece]]''. And she was one of the four artists/coaches in Rising Star in 2016.{{citation needed|date=July 2020}}",
  "last_revision_date": "2025-10-11T06:33:33Z",
  "genres": [
    314,
    418,
    700,
    935,
    937
  ]
}