{
  "name": "Dewa 19",
  "description": "'''Dewa 19''' (pronounced in Indonesian as ''Dewa Sembilan Belas'') is an Indonesian [[Rock music|rock]] band from [[Surabaya]], [[East Java]], led by singer-songwriter [[Ahmad Dhani]]. Along with [[God Bless (band)|God Bless]] and [[Slank]], they are dubbed as one of the greatest rock bands in the history of Indonesian popular music. The band was formed in 1986. There have been a number of changes to the lineup that ended in their disbandment in 2011, but then they regrouped in 2019 for comeback reunion shows.\n\nThe current line-up consists of Ahmad Dhani, Andra Ramadhan (both as the remaining original members), Yuke Sampurna and Agung Yudha. Having no lead vocalists in the current line-up, starting in 2019, the band's shows continuously feature guest vocalists [[Ari Lasso]], [[Once Mekel]] (both were previously Dewa 19's members as lead vocalists), Virzha, and Marcello Tahitoe. The band may feature either one, some, or up to four vocalists at a time.\n\nDewa 19 has achieved mainstream success during through the 1990s with Ari Lasso as the lead vocals, and even greater success in the 2000s when Once Mekel was recruited as the new lead vocalist, and the release of \"Bintang Lima\" which introduced the band's new musical direction. The release is the 7th [[list of Indonesian all time best selling albums|Indonesian all time best selling album]] with sales of nearly 2 million copies.\n\nIn 2025, Hai magazine named Dewa 19 as the richest band in Indonesia with revenues reaching more than 14 billion a year. In the midst of the success, the group had stumbled several times over legal issues, including issues of copyright infringement and feud with Islamic organizations.\n\nThroughout their career, Dewa 19 has sold over 7 millions album in Indonesia only and has received many awards, both BASF Awards and [[AMI Awards]]. They have also won the LibForAll Award in the United States for their contributions to peace efforts and [[religious tolerance]]. In 2008, Dewa 19 (as a band) and [[Ahmad Dhani]] (individually, founding member) are included in the list of \"The Immortals: The 25 Greatest Indonesian Artists of All Time\" by [[Rolling Stone Indonesia]] magazine.",
  "last_revision_date": "2025-10-05T15:38:48Z",
  "genres": [
    42,
    62,
    532,
    931,
    934,
    966,
    1044,
    1126
  ]
}