{
  "name": "Dexter Gordon",
  "description": "'''Dexter Gordon''' (February 27, 1923 – April 25, 1990) was an American [[jazz]] tenor saxophonist, composer, and bandleader. He was among the most influential early [[bebop]] musicians. Gordon's height was {{convert|6|ft|6|in|cm}}, so he was also known as \"Long Tall Dexter\" and \"Sophisticated Giant\". His studio and performance career spanned more than 40 years.\n\nGordon's sound was commonly characterized as being \"large\" and spacious and he had a tendency to play behind the beat. He inserted musical quotes into his solos, with sources as diverse as \"[[Happy Birthday to You|Happy Birthday]]\" and well-known melodies from the operas of [[Richard Wagner|Wagner]]. Quoting from various musical sources is not unusual in jazz improvisation, but Gordon did it frequently enough to make it a hallmark of his style. One of his major influences was [[Lester Young]]. Gordon, in turn, was an early influence on [[John Coltrane]] and [[Sonny Rollins]]. Rollins and Coltrane then influenced Gordon's playing as he explored [[hard bop]] and modal playing during the 1960s.\n\nGordon had a genial and humorous stage presence. He was an advocate of playing to communicate with the audience, which was his musical approach as well. One of his idiosyncratic rituals was to recite lyrics from each ballad before playing it. In an interview pianist Dave Bass recalled, \"Dexter would get up to the microphone, holding his horn horizontally, and he'd say 'You must remember this, a kiss is still a kiss, a sigh is just a sigh.' It was a little bit of a shtick, but it was how he approached a song, and I remember that.\"\n\nA photograph by [[Herman Leonard]] of Gordon taking a smoke break at the [[Royal Roost]] in 1948 is one of the iconic images in jazz photography. Cigarettes were a recurring theme on covers of Gordon's albums.\n\nGordon was nominated for an [[Academy Awards|Academy Award]] for [[Academy Award for Best Actor|Best Actor in a Leading Role]] for his performance in the [[Bertrand Tavernier]] film ''[[Round Midnight (film)|Round Midnight]]'' ([[Warner Bros]], 1986), and he won a Grammy for Best Jazz Instrumental Performance, Soloist, for the soundtrack album ''[[The Other Side of Round Midnight]]'' ([[Blue Note Records]], 1986). He also had a cameo role in the 1990 film ''[[Awakenings]]''. In 2018, Gordon's album [[Go (Dexter Gordon album)|''Go'']] (Blue Note, 1962) was selected by the [[Library of Congress]] for preservation in the [[National Recording Registry]] for being \"culturally, historically, or aesthetically significant\".",
  "last_revision_date": "2026-01-07T11:41:35Z",
  "genres": [
    114,
    540,
    637,
    1194
  ]
}