{
  "page_title": "Diamond Rio",
  "description": "'''Diamond Rio''' is an American [[country music]] band from [[Nashville, Tennessee]]. The band consists of Marty Roe (lead vocals, guitar), Jimmy Olander (lead guitar, banjo), Dan Truman (keyboards), Dana Williams (bass guitar, vocals), Micah Schweinsberg (drums), and Carson McKee (fiddle, mandolin, vocals). The band was founded in 1982 as an attraction for the [[Opryland USA]] theme park in [[Nashville, Tennessee]], and was originally known as the Grizzly River Boys, then the Tennessee River Boys. It was founded by vocalists Matt Davenport, Danny Gregg, and [[Ty Herndon]], the last of whom became a solo artist in the mid-1990s. After undergoing several membership changes in its initial years, the band held the same membership from 1989 to 2023, which consisted of Roe, Olander, Truman, Williams, Brian Prout (drums), and Gene Johnson (fiddle, mandolin, vocals). After the latter two retired in 2022, they were respectively replaced by Schweinsberg and McKee.\n\nDiamond Rio was signed to [[Arista Nashville]] in 1991 and debuted with the single \"[[Meet in the Middle]]\", which made them the first band ever to send a debut single to No.&nbsp;1 on the ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs]] charts. The band charted 32 more singles between then and 2006, including four more that reached No.&nbsp;1: \"[[How Your Love Makes Me Feel]]\" (1997), \"[[One More Day (Diamond Rio song)|One More Day]]\" (2001), \"[[Beautiful Mess (Diamond Rio song)|Beautiful Mess]]\" (2002), and \"[[I Believe (Diamond Rio song)|I Believe]]\" (2003).\n\nDiamond Rio has recorded nine studio albums, four Greatest Hits compilations, and an album of Christmas music. Three of the band's albums have achieved [[RIAA]] platinum certification in the United States. In addition, Diamond Rio has received four Group of the Year awards from the [[Country Music Association]], two Top Vocal Group awards from the [[Academy of Country Music]], and one [[Grammy Award]]. The band is known for its vocal harmonies, varied instrumentation, and near-exclusive use of only its own band members on recordings instead of [[session musician]]s. Their sound was originally defined by mainstream country, [[bluegrass music|bluegrass]], and [[rock music|rock]] influences, but later albums drew more influence from Christian country music and [[country pop]].",
  "last_revision_date": "2025-03-06T20:15:35Z"
}