{
  "name": "Die Kassierer",
  "description": "'''Die Kassierer''' (\"The Cashiers\"), also '''Die mächtigen Kassierer''' (\"The Mighty Cashiers\"), are a satirical [[punk rock|punk]] band from [[Bochum]]-[[Wattenscheid]], Germany. The group was founded in 1985 by [[Wolfgang Wendland]] (vocals), Nikolai Sonnenscheiße (guitar), Volker Kampfgarten (drums, jazz guitar) and Mitch Maestro (bass guitar). \n\nThe lyrics of ''Die Kassierer's'' songs are mainly about drugs, sex, violence, strange phenomena{{snd}}such as aliens{{snd}}and the region the band comes from. Generally their lyrics are extremely [[satire|satirical]] and therefore often misunderstood.\n\n''Die Kassierer'' have been criticized for making what has been considered aggressive and socially as well as sexually disorienting music, but up to now only the album ''Habe Brille'' (I got glasses) has been officially indexed as harmful by the \"Bundesprüfstelle für jugendgefährdende Medien\" ([[Federal Department for Media Harmful to Young Persons]]). This indexing was due to the original album's pornografic cover. Shortly after the indexing the cover was changed, so that the LP was acceptable for sale in Germany again. Further attempts to label other LPs of ''Die Kassierer'' have been blocked by the courts because their songs were deemed satirical and socially critical enough to qualify as art.\n\nIn honor of the 20th anniversary of the band in 2005 nineteen artists, including the [[Donots]], Die Lokalmatadore, Hennes Bender, Emscherkurve 77 and [[Mambo Kurt]] recorded songs of ''Die Kassierer'' for a tribute album, also called \"Kunst\". [[Bela B.]] and [[Rodrigo González (musician)|Rodrigo González]] from [[Die Ärzte]] played under the pseudonym ''2 fickende Hunde'' (2 Fucking Dogs). 4 years before ''Die Kassierer'' had played a song for the Die Ärzte- tribute sampler \"GötterDÄmmerung\". They had transformed the song \"Du willst mich küssen\" (You want to kiss me) into \"Du willst mich fisten\" (You want to fist me).",
  "last_revision_date": "2024-09-28T09:27:04Z",
  "genres": [
    973,
    975
  ]
}