{
  "page_title": "Dimitrios Semsis",
  "description": "'''Dimitrios Semsis''', also known as '''Dimitrios Salonikios''' ({{langx|el|Δημήτρης Σέμσης}}; 1883 – 13 January 1950), was a Greek violinist born Dimitrios Koukoudeas (Δημήτριος Κουκουδέας) in [[Strumica]], in the [[Salonica Vilayet]] of the [[Ottoman Empire]] (present-day [[North Macedonia]]).\n\nAt the end of the 19th century, he joined the band of a circus, which was traveling all over the [[Balkans]]. In 1908, he married his first wife Sonhoula Bochor Hanne, and became his daughter Enriquette, cousin of Eskenazi Rosa, in the year about 1910. Later, he joined other traveling bands and played in several places, such as [[Turkey]], [[Syria]], [[Egypt]], [[Sudan]] and elsewhere.\n\nAfter the end of [[World War I]], as [[Strumica]] remained in the kingdom of [[Serbia]], Dimitrios Semsis' family moved to [[Thessaloniki]] (1919). In 1923, he married Dimitra Kanoula and, they had four children. At the beginning of 1927, he moved to [[Athens]]. By that time, he had taken the nickname \"Salonikios\", probably because some agents from recording companies thought that his origin was from Thessaloniki.\n\nAt the end of the 1920s, Semsis was the Recording Director of HMV and Columbia. He participated in hundreds of recordings of folk and smyrnaic songs between 1924 and 1931. He presented his first songs in 1928 and became the Director of Arts of His Master's Voice in 1931 until his death. He composed over 100 songs.\n\nIn the 1930s, Dimitrios was recording with [[Roza Eskenazi]], with great success. He often accompanied her to the taverns with Tompoulis, Lampros Savvaidis, and Lampros Leonaridis. His compositions were being recorded by the greatest artists of that time, such as [[Rita Abatzi|Rita Ampatzi]], [[Stelios Perpiniadis]], and [[Stratos Pagioumtzis]]. He composed  folk, smyrnaic, and amane songs.\n\nDimitrios Semsis recorded hundreds of discs and plenty of them are re-released nowadays.{{When|date=January 2011}} In 1972, in an interview, Roza Eskenazi said that Dimitrios was playing \"the best violin in the world\".{{Citation needed|date=January 2011}}\n\nAfter a short period of illness, he died of cancer in Athens on 13 January 1950.{{citation needed|date=October 2017}}",
  "last_revision_date": "2025-01-29T14:27:38Z"
}