{
  "name": "DJ laz",
  "description": "'''Lazaro Mendez''', better known by his stage name '''DJ Laz''' (born December 2, 1971) is an American [[rapper]] and [[DJ]]. He hosted his weekday radio show in Miami on [[WPOW]] 96.5 FM, branded \"Power 96\", for 22 years until he left the company in April 2012. Beginning July 4, 2012, the new ''DJ Laz Morning Show'' began after arbitration on the newly reformatted [[WXDJ|WRMA]] DJ106.7 a bilingual dance/rhythmic formatted station.\n\nHe is best known for his limp which came from his childhood [[Polio|poliomyelitis]]. He is also known for albums ''DJ Laz'' and ''[[Category 6 (album)|Category 6]]'', which charted on U.S. ''[[Billboard (magazine)|Billboard]]'' album charts and the singles \"Journey Into Bass\" (1994) and \"[[Move Shake Drop]]\" (2008), which peaked at #56 on the [[Billboard Hot 100|''Billboard'' Hot 100]].\n\nDJ Laz is also known for his show's prominent appearance on Fox's television show, ''[[Dish Nation]]''.\n\nOn Tuesday, September 11, 2012, the ''DJ Laz Morning Show'' aired a pre-recorded interview with President [[Barack Obama]]. Many Obama critics quickly bashed Obama for making no mention to the [[September 11 attacks]] in 2001, despite the fact that the interview was pre-recorded. The White House later made it clear that the call was indeed pre-recorded and was supposed to have been played on Monday, September 10.\n\nOn May 5, 2014, DJ Laz was in command of a boat that was stuck on a sand bar in Biscayne Bay. When bystanders got out to push the boat, DJ Laz increased power to the engine and killed a 23-year-old man who had been trying to help, as he was caught by the boat's propeller. DJ Laz was never given a sobriety test and there was no further investigation.\n\nDJ Laz hosted the Morning Show for 97.3 in Miami from August, 2014 until November, 2019. He left in advance of an acquisition, and can currently be found on Sirius XM on Pitbull's Globalization Channel 13.\n\nIn 2021, DJ Laz joined Miami's new 1990s station [[WMIA-FM|Totally 93.9]], hosting weekday afternoons.",
  "last_revision_date": "2025-11-18T19:44:07Z",
  "genres": [
    564,
    770,
    775
  ]
}