{
  "name": "DJ Miko",
  "description": "'''DJ Miko''' was an Italian dance act fronted by keyboardist Monier Quartararo Gagliardo (born 8 February 1973{{cn|date=June 2020}}) and British performer Louise Anne Gard from [[Tunbridge Wells]]. They mainly released dance [[Cover version|cover]] versions of past pop and rock [[Hit record|hits]] and are primarily known for their 1993 hit cover of [[4 Non Blondes]]' \"[[What's Up? (4 Non Blondes song)|What's Up]]\". During the group's active years, DJ Miko released one album and twelve singles.\n\nThe project was managed by the [[Milan]]-based record company Dig It International, for which Gagliardo already worked as an in-house producer, and released on its Hotline Records label. As with all other releases on Hotline Records, [[SAIFAM]] in [[Verona]] was responsible for the music production. Following the closure of Dig It International in 1997, the project was fully absorbed by SAIFAM.\n\nDJ Miko has made many appearances on the [[Eurodance]] [[compilation album]] ''[[Dancemania]]'' series, specifically its sub-series albums including ''[[Dancemania Speed]]'' and ''[[Dancemania Covers]]'' since 1999, and on [[Konami]]'s [[Bemani]] series of rhythm music [[Video game|video games]] with three covers.\n\nOver their career, the DJ Miko project has employed various studio vocalists. Their debut single \"What's Up\" was recorded by singer Maria Caprì from Milan. The follow-up, \"Rhythm\", featured lead vocals by [[Ann Lee (singer)|Annerley Gordon]] and background vocals by Cristina Dori. The singles \"Clementine\" (1997) through \"Shout\" (2000) were all sung by [[List of Girlschool band members#Jackie Bodimead|Jackie Bodiemead]], a studio vocalist at SAIFAM. \"Forever Young\" (2001), the final single released on vinyl, was sung by Italian studio singer and vocal coach Melody Castellari. In recent years, SAIFAM has occasionally used the names of its successful projects from the past, including DJ Miko, as aliases for dance cover versions on its many compilation album series.",
  "last_revision_date": "2026-01-13T01:42:09Z",
  "genres": [
    425,
    624
  ]
}