{
  "description": "'''Donald S. Joyce''' (February 9, 1944 – July 22, 2015) was an American musician who was a member of the experimental [[music group]] [[Negativland]]. He also hosted a weekly [[radio]] program called ''[[Over the Edge (radio)|Over the Edge]]'' on the [[Berkeley, California]], radio station [[KPFA]], for more than 30 years.\n\nJoyce was born in [[Keene, New Hampshire]]. Originally a visual artist, he earned a master's degree in painting from the [[Rhode Island School of Design]] before moving to the [[San Francisco Bay Area|Bay Area]], where he lived most of his life. Joyce began his Bay Area radio career in the 1970s at [[KALX]], where he worked as an on-air programmer, and produced station IDs, promotional spots and other continuity. At KALX, he produced a weekly summer replacement program for the news called ''The Alternative News'', featuring fictional news stories. The last episode of ''The Alternative News'' included the eco-revolutionary character Thunderman, which led to his producing a multipart serial called ''Thunderteam'' for [[KPFA]].{{cn|date=February 2024}}\n\nWhile working at KPFA hosting a more mainstream type music show, he encountered Ian Allen and other members of Negativland. Don was a master at tape editing and he began developing his [[sound collage]] techniques using radio and television broadcasts captured on tape and blending them into layered mixes, each with a unique theme. Heavily influenced by [[Bob and Ray]] and the [[Firesign Theater]], Joyce developed a number of continuing characters whom he would portray in the more theatrical episodes of ''[[Over the Edge (radio)|Over The Edge]]''.\n\nIn 1984, he coined the phrase [[culture jamming]]. Using his alter ego, cultural reviewer Crosley Bendix, he presented an explanation of culture jamming and its importance on the 1984 album [[Over the Edge Vol. 1: JAMCON'84]]:\n\n<blockquote>As awareness of how the media environment we occupy affects and directs our inner life grows, some resist. The skillfully reworked billboard . . . directs the public viewer to a consideration of the original corporate strategy. The studio for the cultural jammer is the world at large.</blockquote>",
  "last_revision_date": "2024-12-21T20:31:53Z"
}