{
  "name": "Don Caballero",
  "description": "'''Don Caballero''' (often shortened by members as 'Don Cab') was an American [[math rock]] band from [[Pittsburgh]], [[Pennsylvania]].\n\nAlthough the band has had numerous lineup changes with co-founder [[Damon Che]] (drums and percussion) being the only constant member, the band's classic lineup consisted of Che, [[Ian Williams (musician)|Ian Williams]] (guitar), Pat Morris (bass guitar), and Mike Banfield (guitar).\n\nFormed in 1991 as a trio, the band released two singles in 1992. Williams joined the band the same year during the production of their debut album ''[[For Respect]]'' which was released in 1993 to positive reviews. Morris shortly left after the album's release and was replaced by bassists Matt Jencik, George Draguns from 1993 to 1996 respectively. In 1995, the band under the lineup of Jencik, Williams, Banfield, and Che released their second album ''[[Don Caballero 2]]'' to critical acclaim. After the release of ''Don Caballero 2'', the group went on hiatus for two years.\n\nThe core lineup reformed in 1997 to release ''[[What Burns Never Returns]]'' to further critical acclaim. The following year, Morris departed again and was replaced by bassist Eric Emm. Banfield soon followed in 1999 and the band became a trio for the second time since its original inception. In 2000, Don Caballero released their fourth album ''[[American Don]]'' which featured a less aggressive sound than their previous albums. ''American Don'' received critical acclaim with critics considering it to be among their best work. The band split the same year due to tensions between Williams and Che. In 2003, Che reformed the band with guitarists Jeff Ellsworth and Gene Doyle along with bassist Jason Jouver. They released ''[[World Class Listening Problem]]'' in 2006 and ''[[Punkgasm]]'' in 2008 both to mixed reviews. In 2009, the band disbanded for the final time.\n\nConsidered pioneers of the 90's underground [[math rock]] movement along with bands [[Slint]], [[Chavez (band)|Chavez]], and [[Shellac (band)|Shellac]], they developed a [[cult following]] during their career and are considered to be widely influential.",
  "last_revision_date": "2026-01-27T22:37:57Z",
  "genres": [
    753,
    963,
    968,
    971
  ]
}