{
  "name": "Dottie West",
  "description": "'''Dottie West''' (born '''Dorothy Marie Marsh'''; October 11, 1932 – September 4, 1991) was an American [[Country music|country]] singer and songwriter. She also had several credits as an actress. A distinguished figure in the country genre, West was among several people who helped to elevate the platform of female country artists. She was also known for mentoring up-and-coming artists and being the first woman to win a country music accolade from the [[Grammy Awards]].\n\nWest's exposure to country music in childhood influenced her continued music education at [[Tennessee Tech|Tennessee Polytechnic Institute]]. After marrying, the family moved to Ohio, where West made her first appearances singing on regional television. Her aspirations to write and record country led to West getting a [[Starday Records]] recording contract in 1959. West and her family then moved to [[Nashville, Tennessee]], where she continued recording and releasing unsuccessful singles for Starday. In 1963, West signed with [[RCA Records|RCA Victor]], where she had first success. Her self-penned \"[[Here Comes My Baby (Dottie West song)|Here Comes My Baby]]\" (1964) became a top-10 US country song and won her a Grammy. Writing and co-writing her own material, West had more top-10 [[Nashville Sound]]-influenced singles such as \"[[Would You Hold It Against Me]]\", \"[[Paper Mansions]]\", and \"[[Rings of Gold]]\".\n\nWest continued recording for RCA through 1976, having a [[Crossover music|crossover pop]] single with 1973's \"[[Country Sunshine (song)|Country Sunshine]]\". The latter was also a [[Coca-Cola]] commercial [[jingle]] that was played routinely on television. Moving to [[United Artists Records]] (which later bought [[Liberty Records]]), West had her peak success in her middle age. In the late 1970s, she recorded two albums with [[Kenny Rogers]]. Their first duet, \"[[Every Time Two Fools Collide (song)|Every Time Two Fools Collide]]\" (1978), became her first chart-topping single and was followed by four more top-10 songs. The newfound success led to her own solo career reigniting. In 1980, West had her first chart-topping solo single with \"[[A Lesson in Leavin']]\", which was followed by several more top-20 songs.\n\nIn the early 1980s, West began an acting career, appearing on television shows such as ''[[The Love Boat]]'' and films such as ''[[The Aurora Encounter]]''. She signed a new recording contract with Permian Records, and her last album was released there in 1984. West continued appearing on television and touring. Her increased spending habits, though, led to her filing for [[bankruptcy]] in 1990. Her personal possessions were sold in a public auction by the [[Internal Revenue Service]], and she was forced to sell her home. While in the midst of planning a career comeback, West was killed in a car accident in 1991. Following her death, her life was made into a television movie, ''[[Big Dreams and Broken Hearts: The Dottie West Story]]'', and she was inducted into the [[Country Music Hall of Fame]].",
  "last_revision_date": "2025-07-05T21:59:16Z",
  "genres": [
    289,
    290,
    801
  ]
}