{
  "name": "Double Trouble",
  "description": "'''Double Trouble''' is an American [[blues rock]] band from [[Austin, Texas]], which served as the backing band for singer-guitarist [[Stevie Ray Vaughan]]. The group was active throughout the 1980s and contributed to reviving [[blues]] music, inspiring many later blues and [[Rock music|rock]] acts. Formed in [[Austin, Texas]] in 1978, the group went through several early line-up changes before settling on a [[power trio]] consisting of Vaughan, [[Chris Layton]] (drums), and [[Tommy Shannon]] (bass).  They became a four-piece by 1985 after adding [[Reese Wynans]] (keyboards). Whilst with Vaughan they were billed '''Stevie Ray Vaughan and Double Trouble'''. Rooted in blues and rock music, the group worked in various genres ranging from [[ballad]]s to [[Soul music|soul]], often incorporating [[jazz]] and other musical elements.\n\nInitially a five-piece lineup with Vaughan, [[Lou Ann Barton]] (vocals), Fredde Walden (drums), Jackie Newhouse (bass) and Johnny Reno (saxophone), they built their reputation playing clubs around [[Texas]] over a four-year period. Molded into a trio (Vaughan, Layton, Shannon), their musical potential was encouraged by producer [[John H. Hammond]], who got the band a recording contract with [[Epic Records]]. They gained popularity after their debut album, ''[[Texas Flood]]'', became a critical and commercial success in 1983. By the mid-1980s, they had become an international act, touring extensively around the world until August 1990, when Vaughan was [[Death of Stevie Ray Vaughan|killed in a helicopter crash]] after departing [[East Troy, Wisconsin]].\n\nVarious posthumous releases featuring Vaughan have been issued since his death, overseen by his brother [[Jimmie Vaughan|Jimmie]]. Since Vaughan's death, Double Trouble has continued in various capacities, releasing a studio album in 2001 and acting as a [[session musician|session band]] for blues and local Austin musicians. The band has sold over 11.5 million albums in the United States, receiving platinum certifications for all four of their studio albums featuring Vaughan. They have won four [[Grammy Award]]s including [[Grammy Award for Best Contemporary Blues Album|Best Contemporary Blues Performance]] for their album ''[[In Step]]'' (1989). Double Trouble were inducted alongside Vaughan into the [[Rock and Roll Hall of Fame]] in 2015.",
  "last_revision_date": "2025-11-28T03:07:39Z",
  "genres": [
    140,
    388,
    604,
    1217
  ]
}