{
  "name": "Earl Scruggs",
  "description": "'''Earl Eugene Scruggs''' (January 6, 1924&nbsp;– March 28, 2012) was an American musician noted for popularizing a three-finger [[banjo]] picking style, now called \"[[Scruggs style]]\", which is a defining characteristic of [[bluegrass music]]. His three-finger style of playing was radically different from the traditional way the five-string banjo had previously been played. This new style of playing became popular and elevated the banjo from its previous role as a background rhythm instrument to featured solo status. He popularized the instrument across several genres of music.\n\nScruggs played in [[Bill Monroe]]'s band, the Blue Grass Boys. \"Bluegrass\" eventually became the name for an entire genre of country music. Despite considerable success with Monroe, performing on the [[Grand Ole Opry]] and recording classic hits such as \"[[Blue Moon of Kentucky]]\", Scruggs resigned from the group in 1948 because of their exhausting touring schedule. Fellow band member [[Lester Flatt]] resigned as well, and he and Scruggs later paired up in the duo [[Flatt and Scruggs]]. Scruggs's banjo instrumental \"[[Foggy Mountain Breakdown]]\" was recorded in December 1949 and released in March 1950. The song became an enduring hit. The song experienced a rebirth of popularity to a younger generation when it was featured in the 1967 film ''[[Bonnie and Clyde (film)|Bonnie and Clyde]]''. The song won two [[Grammy Award]]s and, in 2005, was selected for the Library of Congress' [[National Recording Registry]] of works of unusual merit.\n\nFlatt and Scruggs brought bluegrass music into mainstream popularity in the early 1960s with their country hit \"[[The Ballad of Jed Clampett]]\", the theme music for the television sitcom ''[[The Beverly Hillbillies]]''—the first Scruggs recording to reach number one on the [[Billboard charts]]. Over their 20-year association, Flatt and Scruggs recorded over 50 albums and 75 [[Single (music)|singles]]. The duo broke up in 1969, chiefly because, while Scruggs wanted to switch styles to fit a more modern sound, Flatt was a traditionalist who opposed the change and believed doing so would alienate a fan base of bluegrass purists. Although each of them formed a new band to match their visions, neither of them ever regained the success they had achieved as a team.\n \nScruggs received four Grammy awards, a [[Grammy Lifetime Achievement Award]] and a [[List of recipients of the National Medal of Arts|National Medal of Arts]]. He became a member of the [[International Bluegrass Music Hall of Fame]] and was given a star on the [[Hollywood Walk of Fame]]. In 1985, Flatt and Scruggs were inducted together into the [[Country Music Hall of Fame]] and named, as a duo, number 24 on [[CMT (U.S. TV channel)|CMT]]'s \"40 Greatest Men of Country Music\". Scruggs was awarded a [[National Heritage Fellowship]] by the [[National Endowment for the Arts]], the highest honor in the [[Folk music|folk]] and traditional arts in the United States. Four works by Scruggs have been placed in the [[Grammy Hall of Fame]]. After Scruggs's death in 2012 at age 88, the [[Cleveland County Courthouse (Shelby, North Carolina)|Earl Scruggs Center]] was founded in Shelby, North Carolina, near his birthplace with the aid of a federal grant and corporate donors. The center is a $5.5 million facility that features the musical contributions of Scruggs and serves as an educational center providing classes and field trips for students.",
  "last_revision_date": "2026-01-10T13:27:49Z",
  "genres": [
    140,
    513,
    978
  ]
}