{
  "name": "Eason Chan",
  "description": "'''Eason Chan Yick-shun''' ({{lang-zh|s=陈奕迅|t=陳奕迅|first=t|p=Chén Yìxùn}}; born 27 July 1974) is a Hong Kong singer and actor. He is one of the most popular and influential singers in both Cantopop and Mandopop. Besides holding the record for winning the \"Ultimate Male Singer – Gold\" award (10 times) and \"My Favorite Male Singer\" award (9 consecutive years) at the \"Ultimate Song Chart Awards Presentation\" in HK, he is also holding the record for being nominated for and winning prestigious [[Golden Melody Awards]] \"[[Golden Melody Award for Best Male Mandarin Singer|Best Male Mandarin Singer]]\" (9 times and 3 times respectively) in Taiwan. Chan was ranked sixth in the [[Forbes China Celebrity 100|2013 ''Forbes'' China Celebrity Top 100 List]]. Chan was ranked third in [[Spotify]] Global Top Mandopop Artists of the Years 2023 and 2024. By December 2024, Chan's monthly listeners in Spotify was over 4 million.\n\nChan is a frequent winner of Asia's music awards. He has won a number of prestigious [[Golden Melody Award]]s in Taiwan. In 2003, he won Best Mandarin Male Singer and Best Mandarin Album for \"''Special Thanks To...''.\" In 2009, he won Best Mandarin Album for \"''Don't Want to Let Go\"''. Chan won his second Best Mandarin Male Singer award in 2015, for the album \"''Rice and Shine\"''.  In 2018, Chan was named Best Mandarin Male Singer for the third time – the most of any singer (tied with [[Johnny Yin]]) – for the album \"''C'mon In~\"''.\n\nChan has kicked off over 300 concerts all around the world since 1999. He successfully held world tours in different regions, including Hong Kong, Macau, Taiwan, mainland China, Southeast Asia, Europe, North America and Australia. He was the first Chinese singer who held tour in London's [[The O2 Arena|O2 Arena]], and the first HK singer who held solo concerts in Beijing's [[Beijing National Stadium|National Stadium]] (Bird's Nest). In 2014, Chan's net worth was HK$100 million. In 2020, Chan was on Forbes Asia’s inaugural 100 Digital Stars list. Chan was the most-streamed artist in Hong Kong on the [[Spotify]] music streaming platform from 2016 to 2021. Since joining [[Universal Music Group|UMG]], Chan has amassed over 75 billion streams across various platforms by 2023.",
  "last_revision_date": "2025-07-14T13:33:58Z",
  "genres": [
    554,
    716,
    1020,
    919,
    204
  ]
}