{
  "name": "Eazy-E",
  "description": "'''Eric Lynn Wright''' (September 7, 1964{{sfn|Westhoff|2017|p=284|ps=: \"Though most obituaries list his birth year as 1963, that is likely not accurate. The funeral program gave his birth year as 1964, as do most official court documents. That would make him thirty at his death, rather than thirty-one as was widely reported\"}} &ndash; March 26, 1995), known professionally as '''Eazy-E''', was an American rapper who propelled [[West Coast hip-hop|West Coast rap]] and [[gangsta rap]] by leading the group [[N.W.A]] and its label, [[Ruthless Records]]. Wright  is often referred to as the \"Godfather of Gangsta Rap\".\n\nBorn in [[Compton, California]], Wright had several legal troubles before founding Ruthless in 1987. After a short solo career with frequent collaboration with [[Ice Cube]] and [[Dr. Dre]], they (along with [[Arabian Prince]]) formed N.W.A together that same year, and [[DJ Yella]] and [[MC Ren]] were later recruited. The group debuted with the split/compilation album ''[[N.W.A. and the Posse]]'' (1987), which was followed by their debut studio album, ''[[Straight Outta Compton]]'' (1989). Controversial upon release, ''Straight Outta Compton'' is now ranked among the greatest and most influential albums ever. The group released its second and final studio album, ''[[Niggaz4Life]]'', in 1991, and soon after disbanded.\n\nDuring N.W.A's splintering, largely by disputes over money, Eazy-E became embroiled in bitter rivalries with Ice Cube and Dr. Dre, who had departed for solo careers in 1989 and 1991, respectively. Resuming his solo career Eazy-E released two EPs, yet he remained more significant behind the scenes, signing and nationally debuting the rap group [[Bone Thugs-n-Harmony]] from 1993 to 1994.\n\nIn 2016, Wright (posthumously) along with [[Ice Cube]], [[Dr. Dre]], [[MC Ren|Mc Ren]], and [[DJ Yella]], as members of the musical group, N.W.A were inducted into the [[Rock and Roll Hall of Fame]].",
  "last_revision_date": "2026-01-29T09:23:54Z",
  "genres": [
    484,
    491,
    1300
  ]
}