{
  "name": "EC8OR",
  "description": "'''EC8OR''' (pronounced ''Ecator'', a contraction of \"Eradicator\") is a German [[digital hardcore]] band founded in 1995 by [[Patric Catani]] and Gina V. D'Orio and signed by [[Alec Empire]]'s [[Digital Hardcore Recordings]] record label. The music was in the same vein of [[Atari Teenage Riot]]'s style of early [[Breakcore]] and hardcore techno with a punk edge, which led to EC8OR been overlooked by fans of digital hardcore recordings, but EC8OR employed more low-res ideas as the first album was entirely composed on [[Amiga 500]] and with a microphone.\n\nEC8OR gained considerable attention in North America in 1997, when the [[Beastie Boys]]' pet-label [[Grand Royal Records]] released \"All Of Us Can Be Rich...\", a collection of earlier material on [[Digital Hardcore Recordings]].  This led to features and press on the band in [[Rolling Stone]] and [[Alternative Press (music magazine)|Alternative Press]].\n\nThe duo released 5 albums from 1995 to 2000 and have continued to record after the great DHR implosion of the millennium, and still collaborate often, although Patric and Gina are no longer signed to Digital Hardcore Recordings. Patric would later display his dislike of the state the label is currently in, as he said in an interview \"The fact that all the bands surrounding [Atari Teenage Riot] just got used for their sellout idea–to have a whole 'movement' and 'followers'–led to psychological warfare which some people didn't survive. There was no trust anymore at some point and no communication. It was very strange for [artists on the] label to read in the New Music Express or other papers all these weird, made-up stories [about them]. The records were produced with different budgets and went through different channels and distributions.  For me, it was necessary to leave that crap behind.\"\n\nEC8OR is on a permanent hiatus although the duo played a one-off gig in Dresden in 2005, and have recently collaborated under the name '''A*class''', whereas Gina still performs in her other band [[Cobra Killer]] and with former [[Shizuo (band)|Shizuo]] vocalist Annika Trost.",
  "last_revision_date": "2025-12-11T04:09:37Z",
  "genres": [
    355,
    486,
    545,
    607,
    868
  ]
}