{
  "name": "Ed Warby",
  "description": "'''Edward R. Warby''' (born 7 March 1968) is a Dutch musician, best known as the drummer for [[death metal]] band [[Gorefest]] and [[progressive rock]]/[[Progressive metal|metal]] project [[Ayreon]].\n\nHe also appeared in the band [[Agressor]] in 1982 and joined the Eindhoven-based metal band [[Elegy (band)|Elegy]] in 1987. Warby moved to Gorefest in 1992, where he replaced the former drummer just before the recording sessions of \"False\", he had to learn all themes and develop his work in just two weeks, which he managed to achieve in a matter so fast that producer [[Colin Richardson]] nicknamed him ''Fast Eddy''. After Gorefest split up in 1999, he took part in the re-united Gorefest in 2004.\n\nIn 1998, [[Arjen Anthony Lucassen]] asked Warby to perform on his album ''[[Into the Electric Castle]]'', because Arjen was impressed with Warby's works with Gorefest. From that moment on, Warby had performed on Ayreon's every album, except for ''[[Universal Migrator Part 1: The Dream Sequencer]]'' and ''[[Transitus]]''. He also performed on the re-recording of ''[[Actual Fantasy]]'' (the original recording featured a computerized set of drums). He's also a member, since its creation in 2002, of Lucassen's band [[Star One (band)|Star One]] and has also performed in his latest solo album ''[[Lost in the New Real]]''.\n\nHe helped the Dutch pop band [[Krezip]] during the recordings of \"Days Like This\" in 2002. He also helped German band [[Love Like Blood (band)|Love Like Blood]] with three songs of their album \"Snakekiller\", in 1998. In 2005 he played live with the Dutch [[gothic metal]] band [[After Forever]] while their actual drummer André Borgman was recovering from cancer.\n\nIn 2008, Warby began a [[doom metal]] project named The 11th Hour, and released the album ''The Burden of Grief'' in 2009. All guitars, bass, drums, keyboards and clean vocals are performed by Warby, with the additional [[Death growl|growls]] contributed by Rogga Johansson ([[Ribspreader]]). The Burden of Grief is a concept album, \"about a man about to die from a lung disease.\"",
  "last_revision_date": "2024-11-29T12:23:26Z",
  "genres": [
    330,
    331,
    358,
    547,
    946,
    954,
    1168
  ]
}