{
  "name": "Edip Akbayram",
  "description": "'''Ahmet Edip Akbayram''' (29 December 1950 – 2 March 2025) was a Turkish rock music artist, composer and socialist. He was the lead singer of [[Dostlar]], one of the first [[rock bands]] in Turkey. He was excluded throughout his childhood due to [[polio]]. During his artistic career, he was censored and oppressed because of his [[Socialism|socialist]] stance. As a result of a disability in his right leg, he was rejected by some groups and organizers due to limited mobility. He reacted to this by saying: \"I sing with my voice, I don't sing with my foot. Why are you looking at my feet, brother!\"\n\nHe was diagnosed with [[polio]] when he was nine months old. In the [[Siyah Örümcekler]] group they founded in high school, they played and sang [[psychedelic rock]] style compositions they made on the [[Folk music|folk]] songs of [[Pir Sultan Abdal|Pir Sultan]] and [[Karacaoğlan]]. They made their first record ''[[Kendim Ettim Kendim Buldum]]'' during their high school years. The record was released in two different editions under the titles Siyah Örümcekler – Gaziantep Orkestrası and Edip Albayrak – Siyah Örümcekler. After Gaziantep, Adana became their second address where he first took the stage with the orchestra he founded. Later, he started working in a nightclub called Beyaz Saray there.\n\nAfter graduating from high school in 1968, he went to [[Istanbul]] to take the university entrance exam but failed. He passed the university entrance exam in 1971 and was admitted to faculty of dentistry in [[Istanbul University]], which he had always dreamed of. However, his passion for music took over and he gave up this profession and devoted himself to music. After coming to Istanbul, he participated in the [[Golden Microphone]] in 1971. He won the first place with his first composition, ''[[Kükredi Çimenler]]'', inspired by a poem by [[Âşık Veysel|Aşık Veysel]] in 1972. He founded the [[Dostlar]] in 1973 with [[Vecdi Ören]]. Later, he received awards with his singles [[Deniz Üstü Köpürür (single)|''Deniz Üstü Köpürür'']] and [[Garip (single)|''Garip'']], and became an artist whose fame was heard throughout the country. He broke sales records and won the Golden Record with his songs ''[[Aldırma Gönül Aldırma]]'' and ''[[Gidenlerin Türküsü]]'', and has around 250 awards given by various organizations.\n\nThe 80s were difficult years for him and other [[Socialism|socialist]] musicians. Between 1981 and 1988, their compositions were banned from being played on the [[Turkish Radio and Television Corporation]], the only broadcaster of the period. But from the mid–90s onwards, he made a new breakthrough, especially with the album ''[[Türküler Yanmaz]]'', and showed that he continued to walk on his own path without deviating. This album was dedicated to those who lost their lives in the [[Sivas massacre|Sivas Massacre]]. He died on March 2, 2025, due to [[multiple organ failure]].",
  "last_revision_date": "2025-10-08T16:11:46Z",
  "genres": [
    5,
    55,
    532,
    966,
    976
  ]
}