{
  "name": "Edyta Nawrocka",
  "description": "'''Edyta Nawrocka''' is a Polish singer, songwriter, actress, dancer and TV presenter. Born in [[Wałbrzych]] and raised in [[Kołobrzeg]]. She performed dancing roles in stage productions until she decided to get into studio to record her own music. Her single \"See More\" (ft. Adam Tas) went down in history as the most played track in \"DMC\" chart of Muzyczne Radio. Her singles \"Watch Me\" (ft. Ne!tan), \"New Chapter\", \"Escape This World\", \"Red Red Roses\" (ft. Anna Montgomery) got to the top of \"HOUSE 20 PL\" chart of Muzyczne Radio and were played in \"Hot Music Mix\" auditions. She was the first and until now the only artist who recorded music videos in [[Maldives]]. Her video \"See More\" was in 5th place in \"ONET TOP 10\" ranking. Her singles \"Nothing Else\" and \"Come 2 Me\" from upcoming debut album \"Realization\" (ft. P-Turner) got to the top of Talent Pool by [[Spinnin' Records]].\n\nSince 2007 until now she is the news presenter in Telewizja Wałbrzych (WTV Media Group). She is also publicity movies producer and author of official movie relations of hugest Electronic Music Festivals and [[Electronic dance music|EDM]] music reporter. Interviewed [[Armin van Buuren]], [[Fedde Le Grand]], [[Sebastian Ingrosso]], [[Dash Berlin]], [[Nicky Romero]], [[Dimitri Vegas & Like Mike]], [[Felix da Housecat]], [[Sander van Doorn]], Marcel Woods, [[WestBam|Westbam]], [[Remady]] & [[Manu-L]], Curbi, [[D.O.D. (DJ)|D.O.D]] and many others.\n\nIn 2015 her \"Golden Train Song\" achieved more than 300,000 views on the [[Internet]] only. The song was published and broadcast worldwide in international and Polish media: [[NBC]], [[Discovery Channel]], [[Daily Mail]], [[RTL Television|RTL]], [[Die Zeit]], [[TVN Poland]], [[Onet.pl]], [[Radio ZET]], [[Radio Eska]], [[Radio Wrocław]], [[History Poland|History (European TV channel)]], [[Norddeutscher Rundfunk|NDR]], [[Mitteldeutscher Rundfunk|MDR]], [[Deutschlandradio]].\n\nSince 2016 she cooperates with German artist agency Luxus Events.",
  "last_revision_date": "2025-08-17T00:14:37Z",
  "genres": [
    387,
    396,
    789
  ]
}