{
  "name": "Elissa (singer)",
  "description": "'''Elissar Zakaria Khoury''' ({{langx|ar|إليسار زكريا خوري}}; born 27 October 1971), commonly known as '''Elissa''' ({{langx|ar|إليسا}}), is a [[Lebanese people|Lebanese]] singer, actress, television personality and businesswoman. Known for her romantic musical style and emotive vocal performances, she has been dubbed as the \"Queen of Emotions\" by fans and journalists alike. Her musical career began in 1992 when she was featured in the Lebanese talent show [[Studio El Fan]]; later being awarded the silver medal. In 1998, she released her debut studio album ''[[Baddy Doub]]'' through EMI Music Arabia. While the album was a success, the titular song's music video initially received criticism for its racy content. Her second album ''[[W'akherta Maak]]'' (2000) featured the single \"Betghib Betrouh\", a duet with [[Ragheb Alama]] which achieved commercial success and won accolades.\n\nElissa's breakthrough occurred with her 2002 hit single \"Ayshalak\", from the [[Ayshalak|third studio album of the same name]], which was a substantial commercial success. After signing with Saudi Arabian-based record label [[Rotana Music Group|Rotana]], she released the albums ''[[Ahla Dounya]]'' (2004), ''[[Bastanak]]'' (2006), ''[[Ayami Bik]]'' (2007), ''[[Tesada'a Bemeen]]'' (2009), ''[[Asaad Wahda]]'' (2012), ''[[Halet Hob]]'' (2014), ''[[Saharna Ya Leil]]'' (2016), ''[[Ila Kol Elli Bihebbouni]]'' (2018) and ''[[Sahbit Raey]]'' (2020); eventually becoming Rotana's best-selling artist.\n\nElissa is one of the best-selling music artists of the Middle East; selling over 30 million albums throughout her career. She has additionally garnered over 800 million streams on [[Anghami]], making her the most-streamed female artist on the platform, and over 4.5 billion views on [[YouTube]]. In 2005, Elissa became the first Arab artist of Lebanese descent to win the [[World Music Awards|World Music Award]] for \"Best Selling Middle Eastern Artist\" in recognition of the sales for \"Ahla Dounya\", additionally doing so in 2006 and 2010 for \"Bastanak\" and \"Tesada'a Bemeen\", respectively. Throughout her career, she has also endorsed numerous brands such as [[Corum (watchmakers)|Corum]] and [[Pepsi]] and is also an outspoken women's rights activist; raising awareness on specific subjects such as [[Women in Lebanon|women's rights in Lebanon]] and [[breast cancer awareness]] through her music and social media platforms.",
  "last_revision_date": "2025-06-11T12:20:02Z",
  "genres": [
    60,
    1262
  ]
}