{
  "name": "Ella Fitzgerald",
  "description": "'''Ella Jane Fitzgerald''' (April{{nbsp}}25, 1917{{snd}}June{{nbsp}}15, 1996) was an American singer, songwriter and composer, sometimes referred to as the \"First Lady of Song\", \"Queen of Jazz\", and \"Lady Ella\". She was noted for her purity of tone, impeccable [[diction]], phrasing, timing, [[Intonation (music)|intonation]], [[absolute pitch]], and a \"horn-like\" improvisational ability, particularly in her [[scat singing]].\n\nAfter a tumultuous adolescence, Fitzgerald found stability in musical success with the [[Chick Webb]] Orchestra, performing across the country but most often associated with the [[Savoy Ballroom]] in [[Harlem]]. Her rendition of the nursery rhyme \"[[A-Tisket, A-Tasket]]\" helped boost both her and Webb to national fame. After taking over the band when Webb died in 1939, Fitzgerald left it behind in 1942 to start her solo career. Fitzgerald's manager was Moe Gale, co-founder of the Savoy, until she turned the rest of her career over to [[Norman Granz]], who founded [[Verve Records]] to produce new records by Fitzgerald. With Verve, Fitzgerald recorded some of her more widely noted works, particularly her interpretations of the [[Great American Songbook]].\n\nFitzgerald also appeared in films and as a guest on popular television shows in the second half of the twentieth century. Outside her solo career, Fitzgerald created music with [[Louis Armstrong]], [[Duke Ellington]], and [[The Ink Spots]]. These partnerships produced songs such as \"[[Dream a Little Dream of Me]]\", \"[[Cheek to Cheek]]\", \"[[Into Each Life Some Rain Must Fall]]\", and \"[[It Don't Mean a Thing (If It Ain't Got That Swing)]]\". In 1993, after a career of nearly 60 years, Fitzgerald gave her last public performance. Three years later, Fitzgerald died at age 79 after years of declining health. [[List of awards received by Ella Fitzgerald|Her accolades]] included 14 [[Grammy Awards]], the [[National Medal of Arts]], the [[NAACP]]'s inaugural [[NAACP Image Award – President's Award|President's Award]], and the [[Presidential Medal of Freedom]].",
  "last_revision_date": "2026-01-20T20:17:11Z",
  "genres": [
    114,
    141,
    365,
    637,
    1156,
    1194,
    1246
  ]
}