{
  "name": "Elvis Presley",
  "description": "'''Elvis Aaron Presley'''{{efn|name=name|Although some pronounce his surname {{IPAc-en|ˈ|p|r|ɛ|z|l|i}} {{respell|PREZ|lee}}, Presley himself pronounced it {{IPAc-en|ˈ|p|r|ɛ|s|l|i}} {{respell|PRESS|lee}}, as did his family and those who worked with him.{{sfn|Elster|2006|p=391}}<p>The correct spelling of his middle name has long been a matter of debate. The physician who delivered him wrote \"Elvis Aaron Presley\" in his ledger.{{sfn|Nash|2005|p=11}} The state-issued birth certificate reads \"Elvis Aron Presley\". The name was chosen after the Presleys' friend and fellow congregation member Aaron Kennedy, though a single-A spelling was probably intended by Presley's parents to parallel the middle name of Presley's stillborn brother, Jesse Garon.{{sfn|Guralnick|1994|p=13}} It reads Aron on most official documents produced during his lifetime, including his high school diploma, RCA Victor record contract, and marriage license, and this was generally taken to be the proper spelling.{{sfn|Adelman|2002|pp=13–15}} In 1966, Presley expressed the desire to his father that the more traditional biblical rendering, Aaron, be used henceforth, \"especially on legal documents\".{{sfn|Nash|2005|p=11}} Five years later, the Jaycees citation honoring him as one of the country's Outstanding Young Men used Aaron. Late in his life, he sought to officially change the spelling to Aaron and discovered that state records already listed it that way. Knowing his wishes for his middle name, Aaron is the spelling his father chose for Presley's tombstone, and it is the spelling his estate has designated as official.{{sfn|Adelman|2002|pp=13–15}}</p>}} (January 8, 1935 – August 16, 1977) was an American singer and actor. Referred to as the \"'''King of Rock and Roll'''\", he is widely regarded as [[Cultural impact of Elvis Presley|one of the most culturally significant figures of the 20th century]]. Presley's [[sexually provocative]] performance style, combined with a mix of influences across color lines during a [[civil rights movement|transformative era in race relations]], brought both great success and [[Cultural impact of Elvis Presley#Danger to American culture|initial controversy]]. \n\nPresley was born in [[Tupelo, Mississippi]]; his family moved to [[Memphis, Tennessee]], when he was 13. He began his music career in 1954 at [[Sun Records]] with producer [[Sam Phillips]], who wanted to bring the sound of [[African-American music]] to a wider audience. Presley, on guitar and accompanied by lead guitarist [[Scotty Moore]] and bassist [[Bill Black]], was a pioneer of [[rockabilly]], an uptempo, [[Backbeat (music)|backbeat]]-driven fusion of [[country music]] and [[rhythm and blues]]. In 1955, drummer [[D. J. Fontana]] joined to complete the lineup of Presley's classic quartet and [[RCA Victor]] acquired his contract in a deal arranged by [[Colonel Tom Parker]], who managed him for the rest of his career. Presley's first RCA Victor single, \"[[Heartbreak Hotel]]\", was released in January 1956 and became a number-one hit in the US. Within a year, RCA Victor sold ten million Presley singles. With a series of successful television appearances and chart-topping records, Presley became the leading figure of the newly popular [[rock and roll]]; though his performing style and promotion of the then-marginalized sound of African Americans led to him being widely considered a [[moral panic|threat]] to the moral well-being of [[White Americans|white American]] youth.{{sfn|Brown|Broeske|1997|p=55}}\n\nIn November 1956, Presley made his film debut in ''[[Love Me Tender (1956 film)|Love Me Tender]]''. Drafted into [[Military career of Elvis Presley|military service in 1958]], he relaunched his recording career two years later with some of his most commercially successful work. Presley held few concerts, and, guided by Parker, devoted much of the 1960s to making Hollywood films and soundtrack albums, most of them critically derided. Some of Presley's most famous films included ''[[Jailhouse Rock (film)|Jailhouse Rock]]'' (1957), ''[[Blue Hawaii]]'' (1961), and ''[[Viva Las Vegas]]'' (1964). In 1968, he returned to the stage in the acclaimed NBC television comeback special ''[[Elvis (1968 TV program)|Elvis]]'', which led to an extended [[Las Vegas]] concert residency and several highly profitable tours. In 1973, Presley gave the first concert by a solo artist to be broadcast around the world, ''[[Aloha from Hawaii via Satellite|Aloha from Hawaii]]''. Years of substance abuse and unhealthy eating severely compromised his health, and Presley died in August 1977 at his [[Graceland]] estate at the age of 42.\n\nPresley is one of the [[List of best-selling music artists|best-selling music artists]] in history, having sold an estimated 500 million records worldwide.{{refn|group=lower-alpha|name=sales}} He was commercially successful in many genres, including [[Traditional pop|pop]], country, rock and roll, rockabilly, rhythm and blues, [[adult contemporary]], and [[Gospel music|gospel]]. Presley won three [[Grammy Awards]], received the [[Grammy Lifetime Achievement Award]] at age 36, and has been posthumously inducted into [[List of halls of fame inducting Elvis Presley|multiple music halls of fame]]. He holds several records, including the most [[Recording Industry Association of America]] (RIAA)-certified gold and platinum albums, the most albums charted on the [[Billboard 200|''Billboard'' 200]], the most number-one albums by a solo artist on the [[UK Albums Chart]], and the most number-one singles by any act on the [[UK Singles Chart]]. In 2018, Presley was posthumously awarded the [[Presidential Medal of Freedom]].",
  "last_revision_date": "2025-08-18T16:57:57Z",
  "genres": [
    140,
    290,
    505,
    924,
    1027,
    1034,
    1042
  ]
}