{
  "name": "Emmylou Harris",
  "description": "'''Emmylou Harris''' (born April 2, 1947) is an American singer, songwriter, musician, bandleader, and activist. She is considered one of the leading music artists behind the [[country rock]] genre in the 1970s and the [[Americana (music)|Americana]] genre in the 1990s. Her music united both country and rock audiences in live performance settings. Her characteristic voice, musical style and songwriting have been acclaimed by critics and fellow recording artists.\n\nHarris developed an interest in folk music in her early years, which led to her performing professionally. After moving to New York City in the 1960s, she recorded a folk album and performed regionally. She was discovered by [[Gram Parsons]], who influenced her country rock direction. Following his 1973 death, Harris obtained her own recording contract from [[Reprise Records|Reprise]]–[[Warner Bros. Records|Warner Bros.]] Her second album, ''[[Pieces of the Sky]]'' (1975), found both critical acclaim and commercial success. Follow-up 1970s albums further elevated Harris's career, such as ''[[Elite Hotel]]'' (1976), ''[[Quarter Moon in a Ten Cent Town]]'' (1978) and ''[[Blue Kentucky Girl (Emmylou Harris album)|Blue Kentucky Girl]]'' (1979). By 1980, she had acquired four number-one songs on the US and Canadian country charts: \"[[Together Again (Buck Owens song)|Together Again]]\", \"[[Sweet Dreams (Don Gibson song)|Sweet Dreams]]\", \"[[Two More Bottles of Wine]]\" and \"[[Beneath Still Waters (song)|Beneath Still Waters]]\".\n\nHarris had a continued string of commercially and critically successful albums like ''[[Roses in the Snow]]'' (1980), ''[[Evangeline (Emmylou Harris album)|Evangeline]]'' (1981) and ''[[Last Date (Emmylou Harris album)|Last Date]]'' (1982). Her backing group, the Hot Band, helped establish a musical foundation for her concerts and albums. Her 1980s albums spawned the top ten singles \"[[The Wayfaring Stranger (song)|Wayfaring Stranger]]\", \"[[Born to Run (Emmylou Harris song)|Born to Run]]\" and \"[[Last Date (song)|Last Date]]\". The 1985 album ''[[The Ballad of Sally Rose]]'' was among Harris's first self-written projects. The album (along with its follow-ups) failed to sustain the commercial momentum of previous albums. Harris then collaborated with [[Dolly Parton]] and [[Linda Ronstadt]] on ''[[Trio (1987 album)|Trio]]'' (1987). The platinum-selling album was also a critical success that spawned four top ten singles.\n\nIn 1992, Warner Bros. released the live album ''[[At the Ryman]]''. It garnered critical praise and renewed interest in its live venue, the [[Ryman Auditorium]]. Harris was inspired to move in a new musical direction with 1995's ''[[Wrecking Ball (Emmylou Harris album)|Wrecking Ball]]''. She then reunited with Dolly Parton and Linda Ronstadt for ''[[Trio II]]'' (1999). By the 2000s, Harris had signed with [[Nonesuch Records]] and recorded several albums of self-composed material like ''[[Red Dirt Girl]]'' (2000), ''[[All I Intended to Be]]'' (2008) and ''[[Hard Bargain (Emmylou Harris album)|Hard Bargain]]'' (2011). She also found collaborative partnerships, such as with [[Mark Knopfler]] on the internationally successful ''[[All the Roadrunning]]'' (2006). She then collaborated with Rodney Crowell on the critically acclaimed ''[[Old Yellow Moon]]'' (2013) and ''[[The Traveling Kind]]'' (2015). She also became involved in activism during this time, including starting her own [[Animal rescue group|dog rescue]] called Bonaparte's Retreat.\n\nHarris has been estimated to have sold over 15 million records worldwide. She has also earned 13 [[Grammy Awards]], placed 27 singles into the top ten of the US [[Hot Country Songs|country chart]], and several of her albums have received [[Recording Industry Association of America|gold]] certifications in the US. She was inducted into the [[Country Music Hall of Fame]] in 2008 and was ranked among ''[[Rolling Stone]]'''s list of the 200 Greatest Singers of All Time in 2022.",
  "last_revision_date": "2025-06-11T12:35:44Z"
}