{
  "name": "En Vogue",
  "description": "'''En Vogue''' is an American [[girl group]] whose original lineup consisted of singers [[Terry Ellis]], [[Dawn Robinson]], [[Cindy Herron]], and [[Maxine Jones]]. Formed in Oakland, California, in 1989, En Vogue reached No. 2 on the [[Billboard Hot 100|US Hot 100]] with the single \"[[Hold On (En Vogue song)|Hold On]]\", taken from their 1990 debut album ''[[Born to Sing (En Vogue album)|Born to Sing]]''. The group's 1992 follow-up album ''[[Funky Divas]]'' reached the top 10 in both the [[Billboard 200|US]] and [[UK Albums Chart|UK]], and included their second US No. 2 hit \"[[My Lovin' (You're Never Gonna Get It)]]\" as well as the US top-10 hits \"[[Something He Can Feel|Giving Him Something He Can Feel]]\" and \"[[Free Your Mind (song)|Free Your Mind]]\".\n\nIn 1996, \"[[Don't Let Go (Love)]]\" became the group's third, and most successful single, to reach No. 2 in the US, and became their sixth No. 1 on the [[Hot R&B/Hip-Hop songs|US R&B chart]]. Scoring more No. 1 singles on the [[Hot R&B/Hip-Hop songs|US R&B chart]] than any other female group other than [[the Supremes]]. Robinson left the group in 1997 shortly before the release of their third album ''[[EV3]]'', which reached the US and UK top 10. Jones left the group in 2001, and Amanda Cole joined shortly thereafter. However, in 2003, Cole left the group, and [[Rhona Bennett]] joined the group during the recording of their album ''[[Soul Flower]]''. In 2005, the original members briefly united before disassembling again. In 2009, the original members once again reunited for their \"En Vogue: 20th Anniversary\". Shortly after the tour, Robinson and Jones again departed from En Vogue, with Bennett rejoining the group as a trio.\n\nEn Vogue has sold 20 million records worldwide. The group has won seven [[MTV Video Music Awards]], three [[Soul Train Award]]s, two American Music Awards, and received seven [[Grammy]] nominations. They are the first and only female group to be awarded the [[Soul Train Music Awards|Sammy Davis Jr. Award for Entertainer of the Year]]. In December 1999, ''[[Billboard (magazine)|Billboard]]'' magazine ranked the band as the 19th most successful recording artist of the 1990s. They ranked as the second most successful female group of the 1990s. In March 2015, ''[[Billboard (magazine)|Billboard]]'' magazine named the group the ninth most-successful girl group of all time. Two of the group's singles ranks in ''Billboard''{{'}}s most successful girl group songs of all-time list, \"[[Don't Let Go (Love)]]\" (No. 12) and \"[[Hold On (En Vogue song)|Hold On]]\" (No. 23). ''Billboard'' lists them as the third most successful female R&B group of the past 25 years, after TLC and Destiny's Child and seventh most successful group overall.",
  "last_revision_date": "2025-12-14T15:27:07Z",
  "genres": [
    281,
    318,
    467,
    564,
    849,
    949,
    1155
  ]
}