{
  "name": "Eslabon Armado",
  "description": "'''Eslabon Armado''' is   an American [[regional Mexican]] group from [[Patterson, California]], formed in 2017. the group's lineup was originally consisted of [[Pedro Tovar]] (lead vocals), Brian Tovar (bass), & Jesse Vargas (backing vocals and acoustic guitar) until 2020, when Vargas departed to form his own group. Ulises González (acoustic guitar) and Damián Pacheco (twelve-string guitar) later joined in 2022, with González departing in March 2025.\n\nThe group was formed by brothers Pedro and Brian Tovar, along with their friend Gabriel Hidalgo, inspired by their father, who introduced them to [[Sierreño|sierreña music]] from northern [[Mexico]]. Pedro started writing songs at just 10 years old, drawing from his father’s passion and his own love of romantic movies. Despite recording their first album under less-than-ideal garage conditions, Tu Veneno Mortal reached No. 9 on [[Billboard Top Latin Albums|Billboard’s Top Latin Albums]] chart, marking their breakthrough. Their single Con Tus Besos, which Pedro almost left off the album, became their first entry on [[Billboard Hot Latin Songs Year-End Chart|Billboard’s Hot Latin Songs]] chart, proving their raw, traditional sound resonated widely. The name “Eslabon Armado,” meaning “a united chain,” reflects their bond and collaborative spirit from the start of the band.\n\nFor most of their career, the group had a three-piece lineup, consisting of brothers Pedro and Brian Tovar, and their friend Gabriel Hidalgo–all natives of [[Bay Area|Bay Area, California]]–while they attended [[Patterson High School (California)|Patterson High School]]. They graduated to concentrate on the group. They have released seven studio albums and have received several awards and nominations including two [[Billboard Music Awards]], two [[Billboard Latin Music Awards]] and two [[Latin American Music Awards]]. The Tovar Brothers have been the only two constant members. Hidalgo remained until 2021, when he was replaced by González after deciding to leave after moving to [[Los Angeles]] and pursuing other musical projects, with Pacheco joining in 2022.",
  "last_revision_date": "2026-01-03T12:30:56Z",
  "genres": [
    290,
    1050,
    1126
  ]
}