{
  "name": "Everything but the Girl",
  "description": "'''Everything but the Girl''' are an English musical duo formed in [[Kingston upon Hull]] in 1982, consisting of lead singer, songwriter, composer and occasional guitarist [[Tracey Thorn]] and guitarist, keyboardist, songwriter, composer, producer and singer [[Ben Watt]]. The group's early works have been categorized as [[sophisti-pop]] with [[jazz]] influences before undergoing an [[electronic music]] turn following the worldwide success of the 1994 hit single \"[[Missing (Everything but the Girl song)|Missing]]\", remixed by [[Todd Terry]].\n\nThe duo have achieved four top 10 and 12 top 40 singles in the UK and received eight [[gold record|gold]] and two [[platinum record|platinum]] album [[British Phonographic Industry|BPI]] certifications in the UK as well as one gold album [[RIAA]] certification in the US. Their cover of \"[[I Don't Want to Talk About It]]\" reached No. 3 on the [[UK Singles Chart]] in 1988, a feat later matched by \"Missing\", which charted high in several countries and reached No. 2 on the [[Billboard Hot 100|U.S. ''Billboard'' Hot 100]] in 1995. The \"Missing\" remix spent over seven months on the UK Singles Chart, which led to a [[Brit Award]] nomination for Best British Single.\n\nTheir ninth album, ''[[Walking Wounded]]'' (1996), entered the UK albums chart at No. 4, and spawned the top-10 singles \"[[Walking Wounded (Everything but the Girl song)|Walking Wounded]]\" and \"[[Wrong (Everything but the Girl song)|Wrong]]\". The band went inactive in 2000, with Thorn declaring she would no longer perform live. Thorn and Watt, who did not publicise their romantic relationship while active, married in 2009, both released solo albums and said it was unlikely Everything but the Girl would be active again.\n\nHowever, in November 2022, Thorn and Watt announced that they had just completed work on a new Everything but the Girl album. ''[[Fuse (Everything but the Girl album)|Fuse]]'', the band's first new material in 24 years, was released on 21 April 2023. It charted at No. 3 on the [[UK Albums Chart|Official UK Album Chart]], making it the highest charting album of their career. In a 5-star review, ''[[The Guardian]]'' said: \"Still staking out pop's frontier after 40 years. It is audibly made by people with a deep love for and understanding of the music they're inspired by … a comeback worth waiting for.\"",
  "last_revision_date": "2025-06-17T11:51:04Z",
  "genres": [
    436,
    619,
    398,
    1109,
    1206,
    574,
    364,
    356
  ]
}