{
  "name": "Ex-Easter Island Head",
  "description": "'''Ex-Easter Island Head''' (sometimes abbreviated as '''EEIH''') is an English [[experimental music]] collective formed in [[Liverpool]] in 2009. Led by founding member Benjamin D. Duvall, the quartet currently includes Duvall, Benjamin Fair, Jonathan Hering, and Andrew PM Hunt. They perform [[instrumental]] music using prepared tabletop guitars—standard electric guitars modified and laid flat for [[Percussion instrument |percussive]] use—to explore rhythm, texture, and repetition through deliberately limited means.\n\nThe group began with a minimal setup involving two tabletop guitars and has gradually expanded its instrumentation while remaining focused on mechanical and percussive sound sources. Over time, they have incorporated additional [[Prepared guitar |preparations]] and [[Extended technique|playing techniques]], maintaining an emphasis on hands-on, physical methods of sound production. This approach informs both their recorded output and live performances.\n\nTheir music draws on late 20th-century [[avant-garde]] traditions, particularly the repetitive structures of [[Minimalist music|minimalism]] and the raw textures associated with [[no wave]]. These influences shaped the group's early identity as an ensemble focused on performing composed works. Over time, however, they shifted towards a more band-like format, placing greater emphasis on collective interplay and live performance. In discussing the group's approach, writer and comedian [[Stewart Lee]] described them as \"experimental music presented as entertainment\"—a remark that highlights the group's focus on making structurally ambitious music engaging and approachable, both in sound and in performance.\n\nWhile remaining outside the mainstream, Ex-Easter Island Head has established a presence within experimental and alternative music circles. Their releases have featured on year-end lists in ''[[The Wire (magazine)|The Wire]]'', ''[[The Quietus]]'', and ''[[Loud and Quiet]]'', and have received coverage in publications including ''[[Pitchfork (website)|Pitchfork]]'', ''[[Uncut (magazine)|Uncut]]'', and ''[[The Skinny (magazine)|The Skinny]]''. The group's live performances have been reviewed in ''[[The Independent]]'' and ''[[The Guardian]]'', while ''[[Prog (magazine)|Prog]]'' magazine described them as a \"word-of-mouth sensation.\" In a 2024 feature, ''The Guardian'' wrote that the band had spent the past 15 years \"making some of the boldest experiments in [[Music of the United Kingdom|British music]].\"\n\nTheir album ''[[Norther_(album)|Norther]]'' (2024) was placed at number one in ''[[The Quietus]]''{{'}} Albums of the Year list.",
  "last_revision_date": "2025-06-14T10:38:02Z",
  "genres": [
    363,
    753,
    477,
    835,
    47
  ]
}