{
  "name": "Fally Ipupa",
  "description": "'''Fally Ipupa Nsimba''' (born 14 December 1977), known professionally as '''Fally Ipupa''', is a Congolese musician and dancer. Often referred to as the \"Prince of [[Congolese rumba|Rumba]]\", he is known for his [[Tenor|tenor vocals]] and his fusion of contemporary and traditional [[Music of the Democratic Republic of the Congo|Congolese music]] genres, including [[Congolese rumba]], [[soukous]], and [[ndombolo]]. His lyrics often explore themes of romance, suffering, and joy.\n\nBorn to a [[Mongo people|Mongo]] family in [[Kinshasa]], Ipupa made his public musical debut in 1997, at the age of 20, with the Kinshasa-based band Talent Latent. In 1999, he joined [[Koffi Olomide]]'s [[Quartier Latin International]], and in 2006, he signed a record deal with [[Obouo Productions]] for his debut solo studio album, ''[[Droit Chemin]]'', which achieved gold status after selling over 100,000 copies within a month. In 2007, he won the Césaire de la Musique prize for Best Male Performer. In April 2008, Ipupa won the Kundé d'Or for Best Central African Artist, and by May 2009, he ranked as the fifth most searched public figure on [[Yahoo]] France, before releasing his second studio album, ''[[Arsenal de Belles Melodies|Arsenal de Belles Mélodies]]'', on 25 June of that year, which featured chart-toppers such as \"[[Chaise Électrique]]\" (featuring [[Olivia (singer)|Olivia]]) and \"Sexy Dance\" (featuring Krys), which became some of his signature songs. The album quickly sold over 100,000 copies. Ipupa subsequently won two consecutive [[MTV Africa Music Awards 2010|2010 MTV Africa Music Awards]] for [[MTV Africa Music Awards 2010|Best Francophone Artist]] and [[MTV Africa Music Awards 2010|Best Video for \"Sexy Dance\"]]. His third studio album, ''[[Power \"Kosa Leka\"]]'', which spawned the breakout singles \"[[Sweet Life (La vie est belle)|La vie est belle]]\", \"[[Ndoki (song)|Ndoki]]\", and \"Service\", sold over 30,000 copies in a month.\n\nIn 2013, Ipupa won the [[Trace Urban|Trace Urban Music Award]] for Best African Artist and was signed to the French record label [[AZ (record label)|AZ]] by Julien Creuzard. Following Creuzard's departure from AZ to establish [[Elektra France]] in May 2016, Ipupa joined the new label. His fourth studio album, ''[[Tokooos]]'', yielded his highest commercial success and was certified platinum by [[SNEP]], making him one of the first Kinshasa-based Congolese solo artists to achieve that honor. ''Tokooos'' also peaked at number five on the French [[iTunes]] chart. His fifth studio album, ''Control'', released in November 2018, debuted at No. 10 on the French iTunes chart, while the single \"Canne à sucre\" became the first Congolese song by a Kinshasa-based artist to enter SNEP's top 200 most downloaded singles in France, reaching No. 91. Ipupa released his sixth studio album, ''Tokooos II'', in December 2020, followed by ''Tokooos II Gold'' on 25 February 2022. On 16 December that year, he published his seventh studio album, ''Formule 7'', which amassed over three million streams on [[Spotify]] within 24 hours and was certified gold by SNEP.\n\nIn 2014, ''[[Forbes]]'' ranked Ipupa as the sixth richest African musician, and ''[[Jeune Afrique]]'' named him one of the fifty most influential African artists in 2018. He is the most-streamed French-speaking artist on [[Boomplay]] and the most-followed Congolese artist on [[Facebook]], [[Instagram]], and [[YouTube]]. In July 2025, he topped ''[[Billboard (magazine)|Billboard]]'' France's ranking of the most-streamed Congolese artists whose careers originated in either the DRC or the [[Republic of the Congo]]. Ipupa is also known for his humanitarian work: he is the founder of the [[Fally Ipupa Foundation]], which provides aid to [[Social exclusion|marginalized groups]] in the Democratic Republic of the Congo, including victims of sexual violence and disease, as well as orphans.",
  "last_revision_date": "2025-11-18T21:09:42Z",
  "genres": [
    274,
    276,
    807,
    1137
  ]
}