{
  "name": "Far East Movement",
  "description": "'''Far East Movement''' (abbreviated '''FM''') is an American [[Hip hop music|hip hop]] and [[electronic music]] group based in [[Los Angeles]], composed of Kev Nish, Prohgress, J-Splif, Jon Street, Ray Ro, DJ Virman, and Jerm Beats. They signed with [[Martin Kierszenbaum]]'s Cherrytree Records, an imprint of [[Interscope Records]], to release their 2010 single \"[[Like a G6]]\" (featuring [[The Cataracs]] and [[Dev (singer)|Dev]]), which peaked at #1 on the [[Billboard Hot 100|''Billboard'' Hot 100]], making them the first [[Asian Americans|Asian American]] group to reach number one on the chart. Their follow-up single, \"[[Rocketeer (song)|Rocketeer]]\" (featuring [[Ryan Tedder]]), peaked at number seven and led their third album and major label debut, ''[[Free Wired]]'' (2010). It performed moderately on the [[Billboard 200|''Billboard'' 200]], while their fourth album, ''[[Dirty Bass]]'' (2012) saw a steep commercial decline, although its lead single, \"[[Live My Life (song)|Live My Life]]\" (featuring [[Justin Bieber]]) reached number 24 on the ''Billboard'' Hot 100.\n\nThe group's fifth album, ''[[Identity (Far East Movement album)|Identity]]'' (2016) focused on bridging Eastern artists with the group's Western dance music roots. Released independently, the album received positive reviews and spawned the single \"Freal Luv\" (with [[Marshmello]] featuring [[Tinashe]] and [[Park Chanyeol|Chanyeol]]). Far East Movement has also branched out with a number of collaborations on labels [[Ministry of Sound]], [[Dim Mak Records]], and [[Ultra Records]].\n\nIn 2016, Far East Movement's company, Transparent Arts (TA), moved into artist management. TA manages seven artists of various genres, including Korean-American K-pop artist [[Tiffany Young]], rappers [[Dumbfoundead]] and Year of the Ox, DJ producers Yultron and Autolaser, and singer Satica. The artists have garnered millions of social media plays, sold out national tours, and have released tracks through labels Owsla, Spinnin', Armada, and Universal. They launched a joint label, BredNButter, with YouTube channel Trap City. BredNButter's releases have amassed millions of plays in total in a little over a year of existence. They also founded Identity Festival, a festival celebrating Asian American Heritage with the City of Los Angeles on the steps of City Hall which gathered over 10,000 attendees in 2018 with headliners [[Mike Shinoda]] of [[Linkin Park]] and K-pop singer [[Jay Park]].",
  "last_revision_date": "2025-08-14T22:56:40Z",
  "genres": [
    38,
    397,
    405,
    555,
    556,
    930,
    931,
    1178
  ]
}