{
  "name": "Father John Misty",
  "description": "'''Joshua Michael Tillman''' (born May 3, 1981), better known by his stage name '''Father John Misty''', is an American musician. He is known for his satirical lyrics and eccentric performance style.\n\nTillman began his career in [[Seattle]] in the early 2000s. One of his demos reached [[Damien Jurado]], and in 2003 he opened for him on his tour. Tillman began performing and releasing studio albums under the name '''J. Tillman'''. The albums were characterised by their folk sound and intimate lyrics. In 2008 Tillman joined the band [[Fleet Foxes]] as their drummer during the tour for their first record; he went on to play on their second album, ''[[Helplessness Blues]]'' (2011). Tillman left the band soon after the record was completed and started a new solo project, now under the name Father John Misty, releasing his first record, ''[[Fear Fun]],'' in 2012. The album was a radical departure from his previous output, featuring a more marked, [[indie rock]] sound and satirical lyrics. His second album, ''[[I Love You, Honeybear]]'' (2015), received widespread acclaim, and was said to be a [[concept album]] based on Tillman's relationship with his wife, Emma. ''Honeybear'' was followed by another concept album, ''[[Pure Comedy]]'' (2017), exchanging the romantic content of the former for a nihilistic view of [[society]], [[consumerism]], and [[politics]]. His next two records, ''[[God's Favorite Customer]]'' (2018) and ''[[Chloë and the Next 20th Century]]'' (2022), explore [[soft rock]] and [[traditional pop]] respectively.\n\nDuring his career he has been either a permanent or touring member of [[Demon Hunter (band)|Demon Hunter]], [[Saxon Shore (band)|Saxon Shore]], [[Jeffertitti's Nile]], Pearly Gate Music, Siberian, [[Har Mar Superstar]], [[Poor Moon (band)|Poor Moon]], Low Hums, and Jonathan Wilson, and has toured extensively with [[Jesse Sykes]] and [[David Bazan]]. As a record producer and songwriter, Tillman has also made contributions to albums by more mainstream artists such as [[Beyoncé]], [[Lady Gaga]], [[Kid Cudi]], [[Lana Del Rey]], and [[Post Malone]].",
  "last_revision_date": "2025-11-27T22:11:20Z",
  "genres": [
    220,
    441,
    585,
    587,
    970
  ]
}