{
  "name": "Faye Wong",
  "description": "'''Faye Wong''' ({{lang-zh|王菲}}; [[pinyin]]: ''Wáng Fēi''; born 8 August 1969) is a Chinese singer-songwriter and actress. Early in her career, she briefly used the [[stage name]] '''Shirley Wong''' ({{lang|zh|王靖雯}}). Born in [[Beijing]], she moved to British Hong Kong at the age of 18. She debuted with the [[Cantonese]] album ''[[Shirley Wong (album)|Shirley Wong]]'' in 1989 and came to public attention by combining [[alternative pop|alternative music]] with mainstream [[C-pop|Chinese pop]]. Since the late 1990s, Wong has recorded mostly in her native [[Standard Chinese|Mandarin]], with some songs recorded in languages such as English and Japanese.  \n\nOne of the biggest pop stars in the Chinese-speaking world, Wong has also gained followings in Japan and Southeast Asia. In the West, she is perhaps best known for starring in [[Wong Kar-wai]]'s films ''[[Chungking Express]]'' (1994) and ''[[2046 (film)|2046]]'' (2004). Upon her second marriage in 2005, she withdrew from the limelight, though she has sporadically returned to the stage. Often titled \"diva\" or \"heavenly queen\" in Chinese, Wong has gained a reputation for her [[Cool (aesthetic)|\"cool\" personality]]. In ''Encyclopedia of Contemporary Chinese Culture'', Jeroen de Kloet characterised her as \"singer, actress, mother, celebrity, royalty, sex symbol and diva all at the same time\". \n\nIn 2000, Wong was recognised by [[Guinness World Records]] as the best selling [[Cantopop]] female artist, having sold an estimated 9.7 million copies of her albums by March 2000. In 2009, Wong was voted the second most influential Chinese celebrity of the past 60 years in a poll conducted by the [[State Council Information Office]] to commemorate the [[60th anniversary of the People's Republic of China]], receiving seven million votes and ranking behind only [[Teresa Teng]].",
  "last_revision_date": "2025-09-15T14:20:31Z",
  "genres": [
    40,
    361,
    930,
    1042
  ]
}