{
  "name": "Fear Factory",
  "description": "'''Fear Factory''' is an American [[industrial<!-- encompasses their whole discography; don't change to heavy metal --> metal]] band formed in Los Angeles in 1989. It has released ten full-length albums and evolved through a succession of sounds, all in its main style of industrial metal. Over the years, the band has seen frequent changes in its lineup, with lead vocalist [[Burton C. Bell]] the only consistent member for 31 years until his departure in 2020. Guitarist [[Dino Cazares]] is the only remaining original member in Fear Factory's current lineup, albeit had a seven-year sabbatical from the band between 2002 and 2009. The current lineup of Fear Factory consists of Cazares, bassist [[Tony Campos]], vocalist Milo Silvestro and drummer Pete Webber.\n\nSigning to [[Roadrunner Records]] in 1991, Fear Factory released their debut album ''[[Soul of a New Machine]]'' in the following year; it became an underground success and earned the band a growing following through touring. After cycling through a few member changes, the \"classic\" lineup was formed in 1994, with Bell, Cazares and founding drummer [[Raymond Herrera]] joined by bassist [[Christian Olde Wolbers]]. This lineup recorded three albums, including the breakthroughs ''[[Demanufacture (album)|Demanufacture]]'' (1995) and ''[[Obsolete (album)|Obsolete]]'' (1998); both albums, along with worldwide tours, established Fear Factory's reputation as one of the most acclaimed metal bands of the mid-to-late 1990s. The fourth album, and last recorded with the \"classic\" lineup, ''[[Digimortal (album)|Digimortal]]'' (2001), failed to match the success of its predecessors.\n\nIn March 2002, Fear Factory broke up due to internal disputes, but reformed by the following year, with Wolbers replacing Cazares on guitar and [[Byron Stroud]] handling bass duties. Two more albums – ''[[Archetype (Fear Factory album)|Archetype]]'' (2004) and ''[[Transgression (album)|Transgression]]'' (2005) – were released before the band went back on hiatus in 2006. Fear Factory reunited in 2009 with a new lineup that featured Cazares, [[Gene Hoglan]] as the replacement of Herrera, and Bell and Stroud reprising their respective roles; this lineup recorded the band's seventh studio album, ''[[Mechanize]]'' (2010). Wolbers and Herrera—together comprising 50% of the band's legal ownership—disputed the reunited band's legitimacy, and a legal battle began. Despite this, Fear Factory has since released ''[[The Industrialist]]'' (2012), ''[[Genexus (album)|Genexus]]'' (2015), and ''[[Aggression Continuum]]'' (2021).\n\nFear Factory has performed at [[Ozzfest]] four times and the inaugural [[Gigantour]]. Its singles have charted on the US [[Mainstream Rock (chart)|Mainstream Rock]] Top 40 and albums on the ''[[Billboard (magazine)|Billboard]]'' Top 40, 100, and 200. It has sold more than a million albums in the U.S. alone.",
  "last_revision_date": "2025-12-20T02:02:52Z",
  "genres": [
    331,
    519,
    597
  ]
}