{
  "name": "Feeder",
  "description": "'''Feeder''' are a Welsh [[rock music|rock]] band formed in 1994. Their 2002 album ''Comfort in Sound'' is one of the best selling albums to be released on an independent record label in the UK. The album entered at No. 1 on the UK Independent Albums Chart on its week of release, before 23 years later in September 2025 returned to the top spot after the album was re-issued as an extended and remastered anniversary package.\n\nAt the peak of their commercial success, they won two [[Kerrang! Awards|''Kerrang!'' Awards]] in 2001 and 2003 and were inducted into their Hall of Fame in August 2019.\n\nAlthough the band formed in 1994, they performed under an earlier incarnation of \"Reel\", which was formed in 1992 by vocalist and guitarist [[Grant Nicholas]], drummer [[Jon Lee (drummer)|Jon Lee]] and bassist Simon Blight, three of the four members of [[Raindancer]], after the departure of that band's other member, guitarist John Canham. However, Blight left Reel later in 1992, and the band played with many session bassists before hiring [[Taka Hirose]] in 1994 and re-establishing themselves as Feeder; that year, the band signed with [[The Echo Label]].\n\nFeeder garnered media attention in 2001 for their third album, ''[[Echo Park (album)|Echo Park]]'', and its lead single, \"[[Buck Rogers (song)|Buck Rogers]]\", which later became a UK top five [[List of Platinum singles in the United Kingdom awarded since 2000|Platinum-selling single]]. Jon Lee died by suicide at his Miami home in January 2002, after which the remaining members began to record and play with former [[Skunk Anansie]] drummer [[Mark Richardson (musician)|Mark Richardson]]. They released their fourth album, ''[[Comfort in Sound]]'', later that year. Richardson was ultimately made an official member, remaining so until May 2009 when he returned to a reformed Skunk Anansie. Feeder have since worked with a roster of drummers live and in the studio, including Tim Trotter, Damon Wilson, [[Karl Brazil]] and former [[Elviss]] drummer Geoff Holroyde. Between 2010 and 2024, the band charted seven more top 20 albums, with the latest of these being 2024's ''Black / Red'', their fifth consecutive top 10 album. In 2019, the band signed a deal with [[Believe Digital|Believe UK]] to release their tenth studio album, ''[[Tallulah (Feeder album)|Tallulah]]''. The band released their eleventh studio album, titled ''[[Torpedo (album)|Torpedo]]'', in 2022. Their twelfth studio album, a [[double album]] titled ''[[Black/Red]]'', was released in 2024.",
  "last_revision_date": "2025-10-16T00:56:43Z",
  "genres": [
    42,
    174,
    582,
    943,
    945
  ]
}