{
  "name": "Femtanyl",
  "description": "'''Femtanyl''' (stylized in all lowercase) is an American [[electronic music]] act consisting of '''Noelle Mansbridge''' and '''Juno Callendar'''. Their work as been described as [[digital hardcore]] and [[breakcore]]. Their music is popular in online spaces, especially among [[furries]]. They take inspiration from a wide variety of sources including groups like [[Nine Inch Nails]], [[Throbbing Gristle]], [[The Prodigy]], and [[Drain Gang]], as well as modern [[electronic dance music]] and [[pop music]].\n\n\n\nFemtanyl was started as a solo act by Mansbridge in 2023. Early tracks such as \"MURDER EVERY 1 U KNOW!\" and \"GIRL HELL 1999\" gained her enough popularity to sign a distribution deal with release.global, part of the [[Artist Partner Group]]. She released her debut EP, ''Chaser'', in September of the same year. Writing for ''[[Pitchfork (website)|Pitchfork]]'', Kieren Press-Reynolds described the EP as \"a relentless hamster wheel of energy.\" It amassed over 40 million streams in its first year on streaming services.\n\nMansbridge performed her first show in January 2024, which sold out in 2 hours. On August 15th Mansbridge was introduced to Callendar via her manager in order for Callendar to perform as a live drummer. By July 2024, they had sold out multiple shows with over 650 tickets each. Mansbridge released her sophomore EP, ''Reactor'', just over a year later, which featured American rapper [[Danny Brown]]. In 2025, Callendar was officially made a member of Femtanyl. Callendar has described her work as \"electronic music with an emphasis on physicality, aggression and kinetics\".\n\nIn November 2025, Femtanyl appeared on Danny Brown's album ''[[Stardust (Danny Brown album)|Stardust]]''. Femtanyl, alongside [[Underscores (musician) |Underscores]], were supporting acts for Danny Brown's ''Stardust'' tour.  Femtanyl is slated to perform at the [[Primavera Sound 2026|Primevera Sound 26]] festival in Barcelona, Spain. They are planning on releasing their debut album ''Man Bites Dog'' on February 13, 2026.\n\nMansbridge is a [[transgender woman]] residing in Toronto. The cover art of Femtanyl's music often depicts a cat-like mascot named Token that frequently appears disfigured or injured.",
  "last_revision_date": "2026-02-02T23:40:10Z",
  "genres": [
    165,
    355
  ]
}