{
  "description": "'''Fiona Apple McAfee-Maggart''' (born September 13, 1977) is an American singer-songwriter. She released five albums from 1996 to 2020, all of which reached the top 20 on the U.S. [[Billboard 200|''Billboard'' 200]] chart. As of 2021, she has sold over 15 million records worldwide. Apple has received numerous [[List of awards and nominations received by Fiona Apple|accolades]], including three [[Grammy Awards]], two [[MTV Video Music Awards]], and a [[Billboard (magazine)|''Billboard'' Music Video Award]].\n\nThe youngest daughter of the actor [[Brandon Maggart]], Apple was born in New York City and was raised alternating between her mother's home in New York and her father's in Los Angeles. She studied piano as a child and began writing songs when she was eight years old. Her debut album, ''[[Tidal (album)|Tidal]]'' (1996), comprises songs written during her teens, and won [[Grammy Award for Best Female Rock Vocal Performance|Best Female Rock Performance]] at the [[39th Annual Grammy Awards]] for its single \"[[Criminal (Fiona Apple song)|Criminal]]\". Her second album, produced by [[Jon Brion]], ''[[When the Pawn...]]'' (1999), was met with critical acclaim, and received [[RIAA certification|platinum]] certification by the [[Recording Industry Association of America]] (RIAA).\n\nFor her third album, ''[[Extraordinary Machine]]'' (2005), Apple again collaborated with Brion and began recording the album in 2002. Apple, however, was reportedly unhappy with the production and opted not to release the record, leading fans to protest [[Epic Records]], erroneously believing that the label was withholding its release. The album was eventually re-produced without Brion and released in October 2005. The album was certified [[Gold album|gold]], and nominated for a [[Grammy Award for Best Pop Vocal Album]]. In 2012, she released her fourth studio album, ''[[The Idler Wheel...]]'', which received critical praise and was followed by a tour of the United States, also receiving a nomination for [[Grammy Award for Best Alternative Music Album|Best Alternative Music Album]] at the [[55th Annual Grammy Awards]]. Apple's fifth studio album, ''[[Fetch the Bolt Cutters]]'' (2020), won two Grammy Awards: Best Alternative Music Album and [[Grammy Award for Best Rock Performance|Best Rock Performance]] for the lead single \"Shameika.\"",
  "last_revision_date": "2025-06-14T04:47:32Z"
}