{
  "name": "Five Finger Death Punch",
  "description": "'''Five Finger Death Punch''', also abbreviated as '''5FDP''' or '''FFDP''', is an American [[Heavy metal music|heavy metal]] band from [[Las Vegas]], Nevada, formed in 2005. The band originally consisted of vocalist [[Ivan Moody]], rhythm guitarist [[Zoltan Bathory]], lead guitarist Caleb Andrew Bingham, bassist Matt Snell, and drummer [[Jeremy Spencer (drummer)|Jeremy Spencer]]. Bingham was replaced by guitarist [[Darrell Roberts]] in 2006, who was then replaced by [[Jason Hook]] in 2009. Bassist Matt Snell departed from the band in 2010, and was replaced by Chris Kael in 2011. Spencer then departed the band in 2018 due to recurring back issues, and was replaced by Charlie Engen, making rhythm guitarist Bathory the only remaining founding member of the band. In October 2020, British guitarist Andy James became the band's lead guitarist, replacing Jason Hook.\n\nFive Finger Death Punch's debut album ''[[The Way of the Fist]]'' was released in 2007, which achieved rapid success and sold over 500,000 copies in the United States. The 2009 follow-up album ''[[War Is the Answer]]'' further increased their popularity, selling over 1,000,000 copies and being certified Platinum by the [[Recording Industry Association of America|RIAA]], the band's third album, ''[[American Capitalist]]'', was released on October 11, 2011, and achieved Platinum status. The following four albums—''[[The Wrong Side of Heaven and the Righteous Side of Hell, Volume 1]]'' (2013), ''[[The Wrong Side of Heaven and the Righteous Side of Hell, Volume 2]]'' (2013), ''[[Got Your Six]]'' (2015), and ''[[And Justice for None]]'' (2018)—have all been certified Platinum or Gold, making Five Finger Death Punch one of the most successful heavy metal bands of the decade. The band has played international music festivals including [[Mayhem Festival]] in [[Mayhem Festival 2008|2008]], [[Mayhem Festival 2010|2010]], and [[Mayhem Festival 2013|2013]], and [[Download Festival]] in 2009, 2010, 2013, 2015, and 2017. The band released their eighth studio album, ''[[F8 (album)|F8]]'', in 2020 and their ninth album ''[[AfterLife (album)|AfterLife]]'' was released in 2022.\n\nFive Finger Death Punch are the recipients of the [[RadioContraband]] Rock Radio Awards for \"Indie Artist of the Year\" in 2011, 2012, 2013, and 2014. They were also honored with the Radio Contraband Rock Radio Award for Album (''[[American Capitalist]]'') and Song of the Year (\"[[Coming Down (Five Finger Death Punch song)|Coming Down]]\") in 2012 and \"Video of the Year\" for \"[[Wrong Side of Heaven]]\" in 2014.\n\nTo date, Five Finger Death Punch has released nine studio albums, one live album, two [[compilation album]]s, one [[extended play]] (EP), and 33 [[Single (music)|singles]].",
  "last_revision_date": "2025-06-13T23:00:12Z",
  "genres": [
    528,
    38,
    512
  ]
}