{
  "name": "Five Iron Frenzy",
  "description": "'''Five Iron Frenzy''' is an American band which formed in [[Denver, Colorado]], in 1995. Best known for playing [[ska punk]] music characterized by an offbeat sense of humor and prominent [[Christianity|Christian]] themes, Five Iron Frenzy was one of the pioneering figures of the [[Christian ska]] movement which emerged with ska's mainstream revival in the 1990s. Since 2000, the band's music has shifted away from straight ska to include and embrace stronger [[alternative rock]] and [[pop punk]] influences, though it continues to create ska music and feature Christian lyrical themes despite several members' changes in religious beliefs.\n\nFive Iron Frenzy experienced their greatest commercial success during the late 1990s as part of the American ska revival, touring prolifically within both Christian and secular markets, where the band gained a [[cult following]] for their energetic live shows typified by humorous stage antics which often drew attention to various social causes and [[Charitable organization|charities]]. By the early 2000s, Five Iron Frenzy had independently sold a total of almost one million albums, though a number of factors eventually contributed to their break-up in 2003. After an eight-year hiatus, the band reunited in 2011 to resume intermittent touring, launching a coincident [[Kickstarter]] campaign to finance a new album which raised a then record-breaking $207,980. The resultant album, ''[[Engine of a Million Plots]]'', was released in November 2013.\n\nFive Iron Frenzy is often noted for the broad tonal range of their lyricism, covering subject matter both spiritual and secular in manners both serious and satirical. Many of the band's songs are firmly rooted in [[Social Gospel]] convictions, often exploring themes of Christian [[hypocrisy]] and [[Christian fundamentalism|fundamentalism]], [[manifest destiny]] and the [[Genocide of indigenous peoples|injustices]] done to [[Native Americans in the United States|Native Americans]], and faith-based criticisms of [[capitalism]], [[consumerism]], [[nationalism]], [[xenophobia]], [[racism]], [[homophobia]] and even the [[Christian music industry]], as well as more traditional and uplifting songs of [[contemporary worship music|praise and worship]]. The band is also known for their comic songs which rely on droll self-deprecating and [[self-referential humor]], [[surreal humor|absurdist]] [[Non sequitur (literary device)|non-sequiturs]] and frequent references to [[popular culture|pop culture]] and [[geek|geek culture]].",
  "last_revision_date": "2025-10-10T23:19:36Z",
  "genres": [
    42,
    252,
    254,
    935,
    1113
  ]
}