{
  "name": "Fleet Foxes",
  "description": "'''Fleet Foxes''' are an American [[indie folk]] band formed in [[Seattle]], Washington, in 2006. The band currently consists of [[Robin Pecknold]] (vocals, guitar), Skyler Skjelset (guitar, mandolin, backing vocals), Casey Wescott (keyboards, mandolin, backing vocals), [[Christian Wargo]] (bass, guitar, backing vocals), and Morgan Henderson (upright bass, guitar, woodwinds, violin, percussion, saxophone). Founding members Pecknold and Skjelset have been the only constants through the group's history, with the former serving as leader and principal songwriter.\n\nThe band came to prominence in 2008 with the release of their second EP ''[[Sun Giant]]'' and their [[Fleet Foxes (album)|eponymous debut album]] on [[Sub Pop]], both of which met with widespread critical acclaim. Their second album ''[[Helplessness Blues]]'' (2011) earned further praise and became their greatest commercial success to date, reaching number 4 on the [[Billboard 200|''Billboard'' 200]]. Following a three-year break, Fleet Foxes reconvened in 2016 to record their third album ''[[Crack-Up (album)|Crack-Up]]'', which was released the following year on [[Nonesuch Records]]. This was followed by 2020's ''[[Shore (album)|Shore]]'', a ''de facto'' Pecknold solo album made without the involvement of his bandmates and released through the [[Anti- (record label)|Anti-]] label.\n\nThe group's work has been consistently lauded by [[music critics]], who have praised their lyricism and production style and often noted the band's use of refined instrumentation and vocal harmonies. The band's debut album was ranked by ''[[Rolling Stone]]'' among the best of the decade and was also included in the book ''[[1001 Albums You Must Hear Before You Die]]''. The band has been nominated for two [[Grammy Awards]], the first for [[Grammy Award for Best Folk Album|Best Folk Album]] in 2012 for ''Helplessness Blues'' and the second for [[Grammy Award for Best Alternative Music Album|Best Alternative Music Album]] in 2022 for ''Shore''.",
  "last_revision_date": "2025-06-13T17:22:00Z",
  "genres": [
    573,
    219,
    435,
    945
  ]
}