{
  "name": "Florence and the Machine",
  "description": "'''Florence and the Machine''' (stylised as '''Florence + the Machine''') are an English [[indie rock]] band formed in [[London]] in 2007 by lead vocalist [[Florence Welch]], keyboardist [[Isabella Summers]], guitarist Rob Ackroyd, drummer Christopher Lloyd Hayden and harpist Tom Monger. The band's music features dramatic, eccentric production and Welch's powerful vocals. Their sound has been described as a combination of various genres, including [[rock music|rock]] and [[soul music|soul]].  \n\nThe band's debut studio album, ''[[Lungs (album)|Lungs]]'', was released on 3 July 2009, and held the number-two position for its first five weeks on the [[UK Albums Chart]]. On 17 January 2010, the album reached the top position, after being on the chart for twenty-eight consecutive weeks. As of October 2010, the album had been in the top forty in the United Kingdom for sixty-five consecutive weeks, making it one of the best-selling albums of 2009 and 2010. The group's second studio album, ''[[Ceremonials]]'', released in October 2011, entered the charts at number one in the UK and number six in the US. The band's third studio album, ''[[How Big, How Blue, How Beautiful]]'', was released on 2 June 2015. It topped the UK charts, and debuted at number one on the US [[Billboard 200|''Billboard'' 200]], their first to do so. The album reached number one in a total of eight countries and the top ten of twenty. Also in 2015, the band was the headlining act at [[Glastonbury Festival]], making Welch the first British female headliner of the 21st century.\n\nThe [[BBC]] played a part in their rise to prominence by promoting Florence and the Machine as part of ''[[BBC Music Introducing]]''. At the [[2009 Brit Awards]], they received the [[Brit Award for Rising Star|Critics' Choice Award]]. ''Lungs'' won the [[Brit Awards|Brit Award]] for [[2010 Brit Awards|Best British Album]] in 2010, while Florence and the Machine have been nominated for six [[Grammy Awards]] including [[Grammy Award for Best New Artist|Best New Artist]] and [[Grammy Award for Best Pop Vocal Album|Best Pop Vocal Album]].",
  "last_revision_date": "2025-11-06T15:00:44Z",
  "genres": [
    64,
    66,
    105,
    223,
    593,
    594,
    823
  ]
}