{
  "name": "Foo Fighters",
  "description": "The '''Foo Fighters''' are an American [[Rock music|rock]] band formed in [[Seattle]] in 1994. Initially founded as a one-man project by former [[Nirvana (band)|Nirvana]] drummer [[Dave Grohl]], the band comprises vocalist/guitarist Grohl, bassist [[Nate Mendel]], guitarists [[Pat Smear]] and [[Chris Shiflett]], and keyboardist [[Rami Jaffee]]. Guitarist [[Franz Stahl]] and drummers [[William Goldsmith]], [[Taylor Hawkins]], and [[Josh Freese]] are former members.\n\nGrohl created the Foo Fighters to release solo material after Nirvana broke up in 1994, and recorded their [[Foo Fighters (album)|eponymous debut album]] (1995) mostly alone in six days. After the songs drew label interest, he recruited Mendel and Goldsmith, both formerly of [[Sunny Day Real Estate]], and Smear, who had played with Nirvana on tour. The band made their first public performance in February 1995, five months before the album's release. \n\nGoldsmith quit during the recording of their second album, ''[[The Colour and the Shape]]'' (1997), with Grohl re-recording most of the drum parts, and Smear departed soon afterward; they were replaced by Hawkins and Stahl, respectively. The latter had been in [[Scream (band)|Scream]], the band Grohl had drummed for before joining Nirvana. Stahl was fired before the recording of the group's third album, ''[[There Is Nothing Left to Lose]]'' (1999), and the band briefly continued as a trio until Shiflett joined after the completion of ''There Is Nothing Left to Lose''. The group released their fourth album, ''[[One by One (Foo Fighters album)|One by One]]'', in 2002, followed by the two-disc ''[[In Your Honor]]'' (2005), which was split between acoustic songs and heavier material. The Foo Fighters released their sixth album, ''[[Echoes, Silence, Patience & Grace]]'', in 2007.\n\nFor the Foo Fighters' seventh studio album, ''[[Wasting Light]]'' (2011), produced by [[Butch Vig]], Smear returned as a full-time member, after having appeared frequently with the band since 2005. ''[[Sonic Highways]]'' (2014) was released as the soundtrack to [[Foo Fighters: Sonic Highways|the television miniseries]] directed by Grohl. ''[[Concrete and Gold]]'' (2017) was the second Foo Fighters album to top the charts in the United States and the first to feature Jaffee, their longtime session and touring keyboardist, as a full member. Their tenth album, ''[[Medicine at Midnight]]'' (2021), was the last before Hawkins' death in March 2022. He was replaced by Freese from 2023 to 2025. Their eleventh album, ''[[But Here We Are]]'', was released in June 2023.\n\nThe Foo Fighters have won 15 [[Grammy Award]]s, including [[Grammy Award for Best Rock Album|Best Rock Album]] five times, making them among the most successful rock acts in Grammy history. In 2021, the band was announced as recipients of the first \"Global Icon\" award at the [[2021 MTV Video Music Awards]]. They were inducted into the [[Rock and Roll Hall of Fame]] in 2021, their first year of eligibility.",
  "last_revision_date": "2025-07-18T18:39:24Z",
  "genres": [
    930,
    40,
    528
  ]
}