{
  "name": "Foodman",
  "description": "'''Takahide Higuchi''' is a Japanese [[electronic music|electronic]] producer, [[disc jockey]] and painter who works under the pseudonym '''Foodman'''. He has been releasing music since 2011 and is based in [[Yokohama]]. His work first gained traction in the early 2010s when he was recognised as a leading name in Japan's [[footwork (genre)|footwork]] and [[Juke house|juke]] scene; the producer has continued to see his work as rooted in footwork. According to ''[[Resident Advisor]]'', the musician's work blends different electronic genres, including juke and footwork but also [[ambient music|ambient]], [[techno]], [[house music|house]] and [[noise music]], yet dissecting these styles and morphing them together \"then driven to extreme without giving you a second to come up with a definitive genre.\" ''[[The Vinyl Factory]]'' consider him to be an [[experimental music|experimental]] musician.\n\nAn article for ''[[The Japan Times]]'' revealed more influences on Foodman's music. From spending a year on [[Ishigaki Island|Ishigaki]] as a child — where his mother is from — he believes \"the smell, the temperature, the tone of the ''[[sanshin]]'' (a three-stringed Okinawan instrument) played by my grandpa and grandma\" may have resulted in his \"tropical or soft, bright tone\". The same article also states Foodman's first experience of making electronic music was via the 1996 PlayStation title [[Fluid (video game)]].\n\nThe musician has released albums on Orange Milk with artwork designed by owner [[Giant Claw]]. Foodman's 2016 album ''[[Ez Minzoku]]'' features off-kilter footwork rhythms and electronic horns, woodwinds and flutes. It was named one of \"The 20 Best Experimental Albums of 2016\" by ''[[Pitchfork (website)|Pitchfork]]''. The 2017 single \"Nanika\" was hailed by ''Pitchfork'' for its erratic yet dance-based structure. That same year, the producer recorded a [[DJ mix]] for ''[[Vice (magazine)|i-D]]''. In November 2018, he released ''Moriyama'', his first album for the Palto Flats label.",
  "last_revision_date": "2025-05-12T04:39:03Z",
  "genres": [
    398,
    444
  ]
}