{
  "name": "Frank Hayes",
  "description": "'''Frank Hayes''' is an American musician prominent within the [[Science fiction fandom|science fiction/fantasy]] genre and culture known as [[filk]]. He is also an authority on [[information technology]] and, as senior news columnist for ''[[Computerworld]]'' magazine, has contributed numerous writings on the subject for more than two decades.\n\nFrank Hayes began recording and performing in the early 1980s and is best known for his humorous songs. \"Never Set the Cat on Fire\", \"Little Fuzzy Animals\", \"S-100\", \"Cosmos\" (which was played for the astronauts during a shuttle mission) and \"The Grandfather Clock\" have become standards of the genre. His most prominent studio album ''[[Don't Ask (filk album)|Don't Ask]]'' included these tracks&mdash;other tracks on that album had to be withdrawn due to licensing issues, resulting in the release of another album, ''[[Never Set the Cat on Fire (filk album)|Never Set the Cat on Fire]]''.  He has won the OVFF's ([[Ohio Valley Filk Fest]]) [[Pegasus Award]] four times, with nine additional nominations.\n\nIn a March 2006 ''[[Wired (magazine)|Wired]]'' magazine review of his performance at the October 2005 OVFF, he was described as a \"50-year-old singer with thick glasses and a salt-and-pepper goatee\". The article also mentions that the term \"Frank Hayes Disease\" is frequently used among filkers to describe the tendency to forget the tune or lyrics of what you are performing while you are in the process of performing it &mdash; even though you wrote the song in question.\n\nIn his other career, Frank Hayes is a highly regarded expert on computer-based information systems and the myriad aspects of processing and managing technology. His column in ''Computerworld'' magazine has focused on these and associated topics for over twenty years. In 2010, he began a column and writing stories for StorefrontBacktalk.com, a site specializing in retail technology coverage.\n\nFrank Hayes is married to [[Firebird Arts and Music]] founder Teri Lee and lives in [[Portland, Oregon]].\nOn April 4, 2009, Frank was inducted into the [[Filk Hall of Fame]].",
  "last_revision_date": "2024-04-23T03:49:12Z",
  "genres": [
    427
  ]
}