{
  "name": "Frankie Goes to Hollywood",
  "description": "'''Frankie Goes to Hollywood''' were an English pop band that formed in [[Liverpool]] in 1980. They comprised [[Holly Johnson]] (vocals), [[Paul Rutherford (singer)|Paul Rutherford]] (backing vocals), Mark O'Toole (bass), Brian Nash (guitar) and Peter Gill (drums). Johnson and Rutherford were among the first openly gay pop singers, and Frankie Goes to Hollywood made [[gay rights]] and sexuality a theme of their music and performances.\n\nFrankie Goes to Hollywood signed to [[ZTT Records]] in 1983. Their debut album, ''[[Welcome to the Pleasuredome]]'' (1984), produced by [[Trevor Horn]], achieved advance sales of more than a million, and their first three singles, \"[[Relax (song)|Relax]]\", \"[[Two Tribes]]\" and \"[[The Power of Love (Frankie Goes to Hollywood song)|The Power of Love]]\", reached number one on the [[UK singles chart]]. The [[BBC]] briefly banned them from broadcast for their provocative themes, drawing further publicity. In 2014, the music journalist [[Paul Lester]] wrote that \"no band has dominated a 12-month period like Frankie ruled 1984\".\n\nJohnson, Gill and O'Toole received the 1984 [[Ivor Novello Awards|Ivor Novello Award]] for Best Song Musically and Lyrically for \"Two Tribes\". In 1985, Frankie Goes to Hollywood won the [[Brit Award for Best New Artist|Brit Award for British Breakthrough Act]] and were nominated for Best New Artist at the [[27th Annual Grammy Awards|Grammy Awards]] and [[1985 MTV Video Music Awards|MTV Video Music Awards]].\n\nFrankie Goes to Hollywood's second album, ''[[Liverpool (album)|Liverpool]]'' (1986), sold fewer copies, and they disbanded acrimoniously in 1987. Johnson successfully sued ZTT to leave his contract and began a solo career. He declined invitations to reunite and tried to block the band from using the name. In 2004, Frankie Goes to Hollywood reunited without Johnson and Nash to perform at a [[Prince's Trust]] charity concert, with [[Ryan Molloy]] on vocals, and held a tour in 2005. They reunited with Johnson and Nash for the first time since 1987 to perform for the [[Eurovision Song Contest 2023|2023 Eurovision Song Contest]].",
  "last_revision_date": "2025-10-11T08:28:26Z",
  "genres": [
    314,
    352,
    549,
    837
  ]
}