{
  "name": "Frank Zappa",
  "description": "'''Frank Vincent Zappa'''{{refn|group=\"nb\"|Until discovering his birth certificate as an adult, Zappa believed he had been christened \"Francis Vincent Zappa\" after his father, and he is credited as Francis on some of his early albums. However, the name on his birth certificate is \"Frank\".<ref name=\"Occhiogrosso\"/>{{rp|15}}}} (December 21, 1940&nbsp;– December 4, 1993) was an American guitarist, composer, and bandleader. In a career spanning more than 30&nbsp;years, Zappa composed [[Rock music|rock]], [[Pop music|pop]], [[jazz]], [[jazz fusion]], [[orchestra]]l  and ''[[musique concrète]]'' works; he additionally produced nearly all the 60-plus albums he released with his band [[<!--Do not capitalize-->the Mothers of Invention]] and as a solo artist. His work is characterized by [[wikt:nonconformity|nonconformity]], [[Musical improvisation|improvisation]] sound experimentation, [[Virtuoso|musical virtuosity]] and [[satire]] of American culture. Zappa also directed feature-length films and [[music video]]s, and designed album covers. He is considered one of the most innovative and stylistically diverse musicians of his generation.\n\nAs a mostly self-taught composer and performer, Zappa had diverse musical influences that led him to create music that was sometimes difficult to categorize. While in his teens, he acquired a taste for 20th-century classical [[Modernism (music)|modernism]], African-American [[rhythm and blues]], and [[doo-wop]] music. He began writing classical music in high school, while simultaneously playing drums in rhythm-and-blues bands, later switching to electric guitar. His debut studio album with the Mothers of Invention, ''[[Freak Out!]]'' (1966), combined satirical but seemingly conventional [[rock and roll|rock-and-roll]] songs with extended sound collages. He continued this eclectic and experimental approach throughout his career.\n\nZappa's output is unified by a conceptual continuity he termed \"Project/Object\", with numerous musical phrases, ideas and characters reappearing throughout his albums. His lyrics reflected his iconoclastic views of established social and political processes, structures and movements, often humorously so, and he has been described as the \"godfather\" of [[comedy rock]]. He was a strident critic of mainstream education and [[organized religion]], and a forthright and passionate advocate for [[freedom of speech]], [[autodidacticism|self-education]], political participation and the abolition of censorship. Unlike many other rock musicians of his generation, he disapproved of recreational drug use, but supported decriminalization and regulation.\n\nZappa was a highly productive and prolific musician with a controversial critical standing; supporters of his music admired its compositional complexity, while detractors found it lacking emotional depth. He had greater commercial success outside the U.S., particularly in Europe. Though he worked as an [[independent music|independent artist]], Zappa mostly relied on distribution agreements he had negotiated with the major [[record label]]s. He remains a major influence on musicians. His many honors include his posthumous 1995 induction into the [[Rock and Roll Hall of Fame]] and the 1997 [[Grammy Lifetime Achievement Award]].",
  "last_revision_date": "2025-06-14T04:33:49Z"
}