{
  "description": "'''From First to Last''' is an American [[post-hardcore]] band formed in [[Tampa, Florida]] by [[Matt Good]], Scott Oord, and Parker Nelms in November 1999. The current line-up consists of [[Matt Good]] (lead vocals and lead guitar), [[Travis Richter]] (rhythm guitar and unclean vocals), and [[Derek Bloom]] (drums).\n\nThe band released their first EP ''[[Aesthetic (From First to Last EP)|Aesthetic]]'' in 2003, which they recorded with founding member and vocalist Phillip Reardon. Reardon left the band in 2004 due to personal and creative differences. After signing with [[Epitaph Records]], the band recruited [[Sonny Moore]] as their new vocalist.\n\nThe band's first two albums, ''[[Dear Diary, My Teen Angst Has a Bodycount]]'' (2004) and ''[[Heroine (From First to Last album)|Heroine]]'' (2006), were both underground successes, selling a combined total of 304,000 copies in the United States by 2008 even with a lack of radio airplay. The band also cultivated a large following on [[Myspace|MySpace]] during this period, with the band's songs receiving over 20 million streams on the platform by March 2008.\n\nFollowing the departure of Moore in February 2007 to pursue a solo career, the band added permanent bassist Matt Manning, and Good moved to lead vocals/guitar. After signing with [[Suretone Records]], the band issued their third, [[From First to Last (album)|self-titled studio album]] in 2008. It received mixed reviews, and despite receiving a high-profile marketing campaign from said label, the album undersold expectations. The band moved to [[Rise Records]] in late 2009, and not long after, Richter left the band. Their fourth studio album, ''[[Throne to the Wolves]]'', was released in March 2010. In July of the same year, the band took a break.\n\nIn November 2013 the band re-formed with [[Periphery (band)|Periphery]] vocalist Spencer Sotelo as the new lead vocalist, and Richter rejoined the band. They released their fifth album ''[[Dead Trees (Album)|Dead Trees]]'' in April 2015. Sotelo departed the band in July 2016. Former vocalist Sonny Moore rejoined in January 2017. In May 2020, Matt Good admitted that while there are a few tracks that could be on a new album, he is unsure if it will ever come to fruition.",
  "last_revision_date": "2025-05-20T18:52:54Z"
}