{
  "name": "G-Unit",
  "description": "'''G-Unit''' (short for '''Guerilla-Unit''') was an American [[Hip-hop|hip hop]] group formed by longtime friends and [[East Coast hip-hop|East Coast]] [[Rapping|rappers]] [[50 Cent]], [[Tony Yayo]], and [[Lloyd Banks]]. After amassing a string of [[self-released]] mixtapes in the early 2000s, the group released their debut album ''[[Beg for Mercy]]'' in 2003; the album went on to sell over two million copies in the US and was certified [[RIAA certification|double platinum]] by the [[Recording Industry Association of America]] (RIAA).\n \nDuring Tony Yayo's imprisonment in 2003, the group recruited Tennessee-based rapper [[Young Buck]] as a temporary replacement and later an official member. Californian rapper [[The Game (rapper)|The Game]] was also made a member in late 2003 after ''Beg for Mercy'', in an effort to promote him after he was signed to [[Aftermath Entertainment|Aftermath]]/[[Interscope Records|Interscope]]; he was ousted from the group in February 2005 for alleged disloyalty according to 50 Cent. In April 2008, Young Buck was ousted from the group due to his problematic behavior. In July 2008, the group released their second studio and final album, ''[[T·O·S (Terminate on Sight)]]'', featuring the original trio.\n\nIn early 2014, Yayo and 50 Cent both separately stated that G-Unit was no more. However, the group members reconciled and reunited soon thereafter; the group became a quintet, with the rejoining of Young Buck and the addition of [[G-Unit Records]] artist [[Kidd Kidd]]. The group performed at [[Summer Jam (festival)#Summer Jam 2014|Summer Jam 2014]]; they released their first collaborative project in six years, the EP ''[[The Beauty of Independence]]'', in August of the same year.\n\nIn 2018, Kidd Kidd announced that he was leaving both the group and label to become independent; Lloyd Banks and Young Buck followed suit after revolved disputes with 50 Cent. In 2022, 50 Cent confirmed that the group had once again disbanded and stated that there would never be a reunion, citing disaffection with the other members.",
  "last_revision_date": "2025-06-04T18:54:17Z",
  "genres": [
    478,
    534
  ]
}