{
  "page_title": "G.E.M.",
  "description": "'''Gloria Tang Sze-wing'''{{efn|{{lang-zh|link=no|t=鄧詩穎|p=Dèng Shīyǐng|j=Dang<sup>6</sup> Si<sup>1</sup>wing<sup>6</sup>}}; {{IPAc-yue|d|ang|6|-|s|i|1|-|w|ing|6}}}} (born 16 August 1991), known professionally as '''G.E.M.''' ([[backronym]] of '''Get Everybody Moving''') or '''Tang Tsz-kei'''{{efn|{{lang-zh|link=no|t=鄧紫棋|p=Dèng Zǐqí|j=Dang<sup>6</sup> Zi<sup>2</sup>kei<sup>4</sup>}}; {{IPAc-yue|d|ang|6|-|z|i|2|-|k|ei|4}}}}, is a Hong Kong singer, songwriter, and producer. Born in [[Shanghai]] and raised in Hong Kong, G.E.M. is known for her vocal performances, autobiographical songwriting, and musical versatility. She is recognized as a leading figure in Chinese popular music and among the most known artists in the [[Greater China]] region.\n\nG.E.M. debuted under Hummingbird Music in 2008 with the release of her self-titled Cantonese extended play, ''[[G.E.M. (EP)|G.E.M.]]'', which won her the gold award for best newcomer at three major award ceremonies in Hong Kong. Her debut studio album, ''[[18...]]'' (2009), was recorded in both Mandarin and Cantonese and was named one of the top ten best-selling records in the territory in 2009. ''[[Xposed]]'' (2012) was named the best-selling Mandarin album of the year and made her the youngest nominee for [[Golden Melody Award for Best Female Mandarin Singer|Best Female Mandarin Singer]] in the history of the [[Golden Melody Awards]]. In 2014, her appearance on the Chinese singing competition ''[[Singer season 2|I Am a Singer 2]]'' gained her immense popularity in Greater China. \n\nG.E.M. subsequently released her first Mandarin studio album, titled ''[[Heartbeat (G.E.M. album)|Heartbeat]]'' (2015), which produced the singles \"[[Long Distance (G.E.M. song)|Long Distance]]\", \"[[Goodbye (G.E.M. song)|Goodbye]]\", and \"[[Away (G.E.M. song)|Away]]\". The following year, she released the single \"[[Light Years Away (G.E.M. song)|Light Years Away]]\" as the Chinese theme song for the film ''[[Passengers (2016 film)|Passengers]]'', which remains the [[List of most-viewed Chinese music videos on YouTube|most viewed music video by a Chinese artist]] on [[YouTube]]. In March 2019, G.E.M. departed from Hummingbird after 11 years following a highly-publicized contractual dispute, and subsequently launched her own company G-Nation. She found continued success with ''[[City Zoo]]'' (2019) and ''[[Revelation (G.E.M. album)|Revelation]]'' (2022), both of which topped the Hong Kong album charts. Her [[I Am Gloria World Tour]] (2023–2025) grossed over $424 million in revenue across 86 shows, making it among the top-five [[List of highest-grossing concert tours by women|highest-grossing tours by a female artist]] of all-time.    \n\nG.E.M. has won numerous [[List of awards and nominations received by G.E.M|accolades]] throughout her career, including sixteen IFPI Hong Kong Sales Awards, twelve [[RTHK Top 10 Gold Songs Awards]], thirteen Metro Radio Mandarin Music Awards, one [[Golden Melody Awards|Golden Melody Award]], and one [[MTV Europe Music Award]]. In 2016, G.E.M. became the only Asian artist featured on the [[Forbes 30 Under 30|''Forbes'' 30 Under 30]] list, and in 2018, she was included at number 34 on [[100 Women (BBC)|BBC's ''100 Women'']] list of the most influential women in the world.",
  "last_revision_date": "2025-06-15T04:09:46Z"
}