{
  "name": "Gang of Four",
  "description": "'''Gang of Four''' were an English [[post-punk]] band, formed in 1976 in [[Leeds]]. The original members were singer [[Jon King]], guitarist [[Andy Gill]], bass guitarist [[Dave Allen (English musician)|Dave Allen]] and drummer [[Hugo Burnham]]. There have been many different line-ups including, among other notable musicians, [[Sara Lee (musician)|Sara Lee]], [[Gail Ann Dorsey]], [[Mark Heaney]] and [[David Pajo]]. After a brief lull in the 1980s, different constellations of the band recorded two studio albums in the 1990s. Between 2004 and 2006 the original line-up was reunited; Gill toured using the name between 2012 and his death in 2020. In 2021, the band announced that King, Burnham, and Lee would be reuniting for a US tour in 2022 with David Pajo on guitar and Sara Lee returning to the band. They continued to perform live, including at the [[Cruel World Festival]] in [[Pasadena, California]]; headlining Luna Fest in [[Coimbra, Portugal]], and a UK Tour in October 2023. They announced that their \"Long Goodbye\" tour in 2025 would be their last.  For this tour, King and Burnham were joined by [[Ted Leo]] on guitar and [[Gail Greenwood]] on bass.\n\nThe band play a stripped-down mix of [[punk rock]], [[funk]] and [[Dub music|dub]], with a lyrical emphasis on the social and political ills of society. Gang of Four are widely considered one of the leading bands of the late 1970s/early 1980s post-punk movement. Their debut album, ''[[Entertainment!]]'', was ranked by ''[[Rolling Stone]]'' as the fifth greatest punk album of all time and at number 483 in their list of the [[Rolling Stone's 500 Greatest Albums of All Time|500 Greatest Albums of All Time]]. In 2004, the album was listed by [[Pitchfork Media]] as the 8th best album of the 1970s and, in 2020, by ''Pop Matters'' as \"Best Post Punk album ever\". ''Entertainment!'' continues to be influential, and was voted 49th in Rolling Stones' 2023 poll of \"100 Best Debut Albums of All time\". Their early 80s albums (''[[Songs of the Free]]'' and ''[[Hard (Gang of Four album)|Hard]]'') found them softening some of their more jarring qualities, and drifting towards [[dance-punk]] and [[disco]]. David Fricke of ''Rolling Stone'' described Gang of Four as  \"probably the best politically motivated band in rock & roll.\"",
  "last_revision_date": "2025-07-10T04:15:34Z",
  "genres": [
    313,
    935,
    461
  ]
}