{
  "name": "Gary Glitter",
  "description": "'''Paul Francis Gadd''' (born 8 May 1944), better known by his [[stage name]] '''Gary Glitter''', is a British former singer who achieved fame and success during the 1970s and 1980s. His career ended after his 1999 conviction of downloading [[child pornography]]. He was also convicted of [[child sexual abuse]] in 2006 and a series of sexual offences (including attempted [[rape]]) in 2015.\n\nAfter performing under the name Paul Raven during the 1960s, Gadd changed his stage name to Gary Glitter in the early 1970s and had a sustained solo career with his hits \"[[Rock and Roll (Gary Glitter song)|Rock and Roll (Parts 1 and 2)]]\", \"[[Do You Wanna Touch Me]]\", \"[[I Love You Love Me Love]]\", \"[[I'm the Leader of the Gang (I Am)]]\", and \"[[Hello, Hello, I'm Back Again]]\". He became known for his energetic live performances and [[glam rock]] persona of glitter suits, make-up, and platform boots. He has sold over 20 million records and had 26 hit [[Single (music)|singles]], which spent a total of 180 weeks in the [[UK Singles Chart]], with 12 reaching the top 10 and three of those charting at number one.{{better source needed|reason=Need to run a search to get the info. Use a URL that gives this information immediately|date=April 2024}} ''[[Touch Me (Gary Glitter album)|Touch Me]]'' (1973) is Glitter's best-selling album, peaking at No. 2 on the [[UK Albums Chart]]. As of 2001, he was listed in the top 100 most successful UK chart acts. His popularity waned during the late 1970s, and was followed by a successful comeback as a solo artist in the 1980s; his 1984 song \"[[Another Rock and Roll Christmas]]\" was one of the most played Christmas songs of all time. In 1998, his recording of \"Rock and Roll\" was listed as one of the top 1,001 songs in music history. He also released seven studio albums and at least 15 albums of compilations and live performances.\n\n[[BBC News]] described Gadd's fall from grace as \"dramatic\" and \"spectacular\". He was arrested in 1997 and convicted and imprisoned in 1999 for downloading thousands of child pornography images and videos. He was acquitted of a charge of sexual activity with an underage girl in the 1970s. He later faced criminal charges and deportation from several countries in connection with both actual and suspected child sexual abuse. He was deported from Cambodia on suspected child sexual abuse charges in 2002 and settled in Vietnam, where a court found him guilty of obscene acts with minors in 2006. After serving his sentence, he was deported to the UK and was placed on the [[Violent and Sex Offender Register|Sex Offenders' Register]] for life. After the [[Jimmy Savile sexual abuse scandal]], Gadd was arrested again in 2012, as part of [[Operation Yewtree]]. He was released on bail, and was charged in 2014 with historical child sex offences. In 2015, he was found guilty of one count of attempted rape, one count of unlawful sexual intercourse with a girl under 13, and four counts of [[indecent assault]]; he was sentenced to 16 years in prison. He was released on licence in February 2023 after serving half of his sentence in prison, but recalled to prison in March of the same year after breaching the conditions of his licence. His parole bid was denied in June 2025. In 2015, Gadd was described by music journalist [[Alexis Petridis]] as a \"public hate figure\". Episodes of the music show ''[[Top of the Pops]]'' featuring his performances are no longer repeated.",
  "last_revision_date": "2026-01-21T12:47:19Z",
  "genres": [
    357,
    504,
    541,
    951,
    1059
  ]
}