{
  "page_title": "Gary Hobbs",
  "description": "'''Gary Lee Hobbs''' (born January 5, 1960) is an American singer-songwriter, record producer, and actor. Called \"[[Tejano music]]'s [[Vince Gill]]\", he has been widely recognized for his resonant [[baritone]] vocals, characterized by their emotive quality, and is considered a pioneer within the genre. Hobbs played a significant role in the expansion of Tejano music during the 1990s and became one of the most popular Tejano singers of the 1980s and 1990s.\n\nHobbs started playing piano and guitar at seven or eight and played the trumpet in high school. He played with local groups before forming the Hot Sauce band with Brando Mireles, recording songs for Hacienda Records, and taking the role of lead vocalist in 1983. At the 1984 Mike Chavez Music Awards, Hobbs received the award for Most Promising Vocalist. His songs, \"Mentiras\" and \"Las Miradas\", achieved commercial success and critical acclaim. By the late 1980s, Hobbs became one of the most popular Tejano singers following \"La Miradas\" ascending to number one on the Tejano Singles chart in 1991 and signed with [[EMI Latin]]. ''Ta Vas a Acordar'' (1993), was certified gold for reaching sales of 50,000 units, and its titular track peaked at number one on ''[[Radio & Records|Radio y Musica]]''{{'}}s Tejano Singles chart for nine weeks, the second-most weeks a song spent atop the chart in 1995. In a strategic endeavor to promote Hobbs in Mexico, EMI Latin rebranded his band from Hot Sauce to Grupo Mezquite in August 1994. ''Te Vas a Acordar'' ended 1994 as the 13th best-selling [[Regional Mexican Albums|Regional Mexican Album]] in the United States.\n\nHobbs released ''Soy el Mismo'' in 1995, while it received a mixed response from [[Music journalism|music critics]], it peaked at number seven on the US [[Billboard (magazine)|''Billboard'']] [[Top Latin Albums]] chart and number three on the US ''Billboard'' Regional Mexican Albums chart. \"Por Favor Corazon\" peaked at number 18 on the [[Hot Latin Songs]] chart and number 15 on the [[Regional Mexican Songs]] chart, and ended 1995 as the second-best Tejano single on ''Radio y Musica'', while \"Tu Me Haces Sentir\" ended the year as the 13th-best Tejano single of 1995. Following the release of ''Corazon Ardiente'' (1996), Hobbs became a spokesperson for [[Coca-Cola]]. During a period of decline in the popularity of Tejano music and decreasing sales within the genre, Hobbs created his own record label and studio, Faith Digital Recording Studio and AMMX. After his contract expired with EMI Latin in 1998, Hobbs signed with [[Sony Discos]]. The singer received the [[Broadcast Music Incorporated|BMI]] Songwriters Award in 1998 for \"Buscando Un Amor\" and \"Corazon Ardiente\" and in 1999 for \"Comprendeme\".\n\nBy 2001, Hobbs became independent and released subsequent albums through his AMMX label. At the [[Tejano Music Awards|2020 Tejano Music Awards]], Hobbs won [[Tejano Music Award for Male Entertainer of the Year|Male Entertainer of the Year]], after years of being nominated. On August 31, 2021, Hobbs launched his podcast ''Hanging With Gary'', with co-host Johnny Davila. On April 20, 2022, Hobbs signed with [[Freddie Records]], citing the label's ability to secure radio airplay for their artists as his reason, and released ''Sin Fin'' that December. In 2019, Hobbs received recognition from the [[Texas State Legislature]], represented by [[Poncho Nevarez]], for his contributions to Tejano music. In recognition of his humanitarian contributions, Hobbs was awarded the Humanitarian Award by the Tejano Entertainers and Musicians Association Awards (TEMA) in 1999.",
  "last_revision_date": "2025-05-30T04:43:46Z"
}