{
  "name": "Genesis",
  "description": "'''Genesis''' were an English [[rock music|rock]] band formed at [[Charterhouse School]], in [[Godalming]], [[Surrey]], in 1967. The band's longest-lasting and most commercially successful line-up consisted of keyboardist [[Tony Banks (musician)|Tony Banks]], bassist/guitarist [[Mike Rutherford]] and drummer/singer [[Phil Collins]]. In the 1970s, during which the band also included singer [[Peter Gabriel]] and guitarist [[Steve Hackett]], Genesis were among the pioneers of [[progressive rock]]. Banks and Rutherford have been the only constant members throughout the band's history.\n\nThe band were formed by Charterhouse pupils Banks, Rutherford, Gabriel, guitarist [[Anthony Phillips]] and drummer [[Chris Stewart (author)|Chris Stewart]]. Their name was provided by former Charterhouse pupil and pop impresario [[Jonathan King]], who arranged for them to record several singles and their debut album ''[[From Genesis to Revelation]]'' in 1969. After splitting from King, the band began touring, signed with [[Charisma Records]] and shifted to progressive rock with their succeeding album ''[[Trespass (album)|Trespass]]'' (1970). Phillips departed after the album's recording, with Banks, Rutherford and Gabriel recruiting Collins and Hackett before recording ''[[Nursery Cryme]]'' (1971). Their live shows began to feature Gabriel's theatrical costumes and performances. ''[[Foxtrot (album)|Foxtrot]]'' (1972) was their first charting album in the UK and ''[[Selling England by the Pound]]'' (1973) reached number three, featuring their first UK hit \"[[I Know What I Like (In Your Wardrobe)]]\". The [[concept album]] ''[[The Lamb Lies Down on Broadway]]'' (1974) was promoted with a transatlantic tour and an elaborate stage show, before Gabriel left the group.\n\nCollins took over as lead singer, and as a four-piece the group released ''[[A Trick of the Tail]]'' and ''[[Wind & Wuthering]]'' (both 1976) with continued success. Hackett left the band in 1977, reducing the band to a three-piece of Banks, Rutherford and Collins. Their ninth studio album, ''[[...And Then There Were Three...]]'' (1978), contained the band's first major hit \"[[Follow You Follow Me]]\". Their next five studio albums – ''[[Duke (album)|Duke]]'' (1980), ''[[Abacab]]'' (1981), ''[[Genesis (Genesis album)|Genesis]]'' (1983), ''[[Invisible Touch]]'' (1986) and ''[[We Can't Dance]]'' (1991) – saw the band embracing a more [[Pop music|pop]]-oriented sound and were all commercially successful. Collins left Genesis in 1996 and was replaced by singer [[Ray Wilson (musician)|Ray Wilson]], who appeared on their final studio album ''[[Calling All Stations]]'' (1997). The album's disappointing critical and commercial reception led the group to disband. Banks, Rutherford and Collins reunited for the [[Turn It On Again: The Tour|Turn It On Again Tour]] in 2007 and again in 2021 for [[The Last Domino? Tour]].\n\nWith between 100 million and 150 million albums sold worldwide, Genesis are one of the world's [[List of best-selling music artists|best-selling music artists]]. Their [[Genesis discography|discography]] includes fifteen studio and six live albums. They have won numerous [[List of awards and nominations received by Genesis|awards]], including a [[Grammy Awards|Grammy Award]] for [[Grammy Award for Best Concept Music Video|Best Concept Music Video]] for \"[[Land of Confusion]]\", and have inspired a number of [[tribute band]]s recreating Genesis shows from various stages of the band's career. In 2010, Genesis were inducted into the [[Rock and Roll Hall of Fame]].",
  "last_revision_date": "2025-06-07T22:37:01Z"
}