{
  "name": "Gene Autry",
  "description": "'''Orvon Grover''' \"'''Gene'''\" '''Autry''' (September 29, 1907 – October 2, 1998), nicknamed '''the Singing Cowboy''', was an American actor, musician, singer, composer, rodeo performer, and baseball team owner, who largely gained fame by singing in a [[Crooner|crooning]] style on [[Radio in the United States|radio]], in [[Cinema of the United States|films]], and on [[Television in the United States|television]] for more than three decades, beginning in the early 1930s. During that time, he personified the straight-shooting hero—honest, brave, and true.\n\nAutry was the owner of a television station and several radio stations in Southern California. From 1961 to 1997, he was the founding owner of the [[California Angels]]{{#tag:ref|The franchise was originally known as the Los Angeles Angels from its founding in 1961 until its move to [[Anaheim, California]], in 1966 when it adopted the California moniker. The franchise has adopted several different monikers since Autry's ownership, including Anaheim Angels, Los Angeles Angels of Anaheim, and a return to Los Angeles Angels.|group=Note}} franchise of [[Major League Baseball]] (MLB).\n\nFrom 1934 to 1953, Autry appeared in 93 motion pictures. Between 1950 and 1956, he hosted ''[[The Gene Autry Show]]'' television series. In many of them, he appeared with [[Champion the Wonder Horse|Champion]], his [[Morgan horse]].\n\nAutry was also one of the most important pioneering figures in the history of [[country music]], considered the second major influential artist of the genre's development after [[Jimmie Rodgers]]. His films were the first media vehicle to carry Western music to a nationwide audience.\n\nIn addition to his signature song \"[[Back in the Saddle Again]]\", as well as his recording hit \"[[At Mail Call Today]]\", Autry is still remembered for his association with [[Christmas music]], having debuted the seasonal standards \"[[Rudolph, the Red-Nosed Reindeer (song)|Rudolph, the Red-Nosed Reindeer]]\", \"[[Frosty the Snowman]]\", and \"[[Here Comes Santa Claus]]\".\n\nAutry is a member of both the [[Country Music Hall of Fame]] and the [[Nashville Songwriters Hall of Fame]]. He is the only person to be awarded stars in all five categories on the [[Hollywood Walk of Fame]], for film, television, music, radio, and live performance.\n\nThe town of [[Gene Autry, Oklahoma]], was named in his honor, as was the Gene Autry precinct in [[Mesa, Arizona]].",
  "last_revision_date": "2025-09-15T09:30:27Z",
  "genres": [
    289,
    1274
  ]
}