{
  "name": "George Strait",
  "description": "'''George Harvey Strait Sr.''' (born May 18, 1952) is an American [[country music]] singer, songwriter, actor, music producer, and rancher. \n\nStrait has sold over 120 million records worldwide, making him one of the [[List of best-selling music artists|best-selling music artists]] of all time. He holds the [[RIAA]] record for most certified albums by any artist, with 33 different albums that are certified platinum or gold. Considering singles and albums, he has a total of 20 multi-platinum, 33 platinum and 24 gold certification. According to the RIAA, Strait is the 12th best-selling album recording artist in the United States overall selling over 70 million records across the United States.\n\nHe is credited for pioneering the [[neotraditional country]] style in the 1980s, famed for his authentic cowboy image and roots-oriented sound at a time when the [[Nashville, Tennessee|Nashville]] music industry was dominated by [[country pop]] crossover acts. Given his influence on the genre, Strait has been nicknamed the \"[[Honorific nicknames in popular music|King of Country Music]]\" by writers and music critics. He currently holds the record for the most number one songs on all charts by an artist, in any genre of music. He has been nominated for 16 [[Grammy Awards]], winning his first and only award for [[Grammy Award for Best Country Album|Best Country Album]] in 2009 with his album ''[[Troubadour (George Strait album)|Troubadour]]''.\n\nStrait's career in country music began performing with his band [[Ace in the Hole Band|Ace in the Hole]] in Texas [[honky-tonk]]s in the 1970s, recording tracks for the [[Houston]]-based [[independent record label]] [[D Records]]. While working on ranches across Texas in his 20s during the day, Strait performed with the Ace in the Hole during nights and the weekend. By the late 1970s, Strait caught the interest of former [[MCA Records]] executive Erv Woosley, who became Strait's longtime manager and helped him with signing to MCA Records.\n\nStrait's commercial success began when his first major label single \"[[Unwound (song)|Unwound]]\" was a minor hit in 1981 and scored his first number one country radio hit with \"[[Fool Hearted Memory]]\" in 1982, introducing the neotraditional country style to the mainstream. During the 1980s, seven of his albums reached number one on the country charts. In the 2000s, he was named Artist of the Decade by the [[Academy of Country Music]], elected into the [[Country Music Hall of Fame]], and won his first Grammy award. Strait was named [[Country Music Association Awards|CMA]] Entertainer of the Year in 1989, 1990 and 2013, and [[Academy of Country Music|ACM]] Entertainer of the Year in 1990 and 2014. He has been nominated for more CMA and ACM awards and has more wins in both categories than any other artist.\n\nStrait has been known for his touring career beginning when he designed a 360-degree configuration and introduced festival style tours. His final concert for [[The Cowboy Rides Away Tour]] at [[AT&T Stadium]] drew 104,793 people, setting a new record for the largest indoor concert in North America. In mid-2024, Strait set the record for the largest ticketed concert for a single act in U.S. history, with over 110,905 people at [[Kyle Field]] in [[College Station, Texas]]. He additionally was inducted into the  [[Hollywood Walk of Fame]] in the same year for its class of 2025.",
  "last_revision_date": "2025-08-19T08:54:25Z",
  "genres": [
    813,
    1198,
    1269
  ]
}