{
  "name": "Germaine Franco",
  "description": "'''Germaine Franco''' is an American [[Composer|film composer]], [[Conducting|conductor]], [[songwriter]], [[Arrangement|arranger]], [[record producer]], and [[Percussion instrument|percussionist]]. She is a Grammy-winning and Oscar-nominated composer. Her extensive resume, coupled with her curiosity, and inventiveness, has made her a trailblazer. Franco was the first Latina to win a Grammy for [[Grammy Award for Best Score Soundtrack for Visual Media|Best Score Soundtrack for Visual Media]] with her score for ''[[Encanto]]'' (2021), and the first to receive the [[Annie Award]] for Outstanding Achievement for Music in an Animated Feature with ''[[Coco (2017 film)|Coco]]'' in 2018. In addition, ''Encanto'' received an [[Academy Award for Best Original Score|Academy Award nomination for Best Original Score]], an SCL Award for Outstanding Original Score for a Studio Film, an Annie Award for Best Music in a Feature, a [[Billboard Music Awards|Billboard Music Award]], and a World Soundtrack Awards nomination for Film Composer of the Year in 2022. She is also the first Latina to be nominated for an Academy Award for Best Original Score, as well as the first to join the music branch of the [[Academy of Motion Picture Arts and Sciences|Academy]]. She recently completed work on the Netflix smash hit ''[[The Mother (2023 film)|The Mother]]'' directed by Niki Caro. The film is one of [[Netflix|Netflix's]] most successful releases to date, going No.1 in 82 countries.\n\nIn 2018, [[Univision]] named Franco one of the Top 15 Latinas who are changing the world. Other film and television scores Franco has contributed to include ''[[Coco (2017 film)|Coco]]'' (2017), ''[[Tag (2018 film)|Tag]]'' (2018), ''[[Dope (2015 film)|Dope]]'' (2015), ''[[Vida (TV series)|Vida]]'' (2018), ''[[Dora and the Lost City of Gold]]'' (2019), and ''[[Little (film)|Little]]'' (2019). Her work has been performed at concert halls such as the Walt Disney Concert Hall with The Los Angeles Master Chorale, The Puerto Rico Symphony, The Dallas Symphony Orchestra, The National Symphony Orchestra, and The Chicago Philharmonic, among others.",
  "last_revision_date": "2026-01-21T05:27:11Z",
  "genres": [
    48,
    704,
    1211
  ]
}