{
  "name": "Gims",
  "description": "'''Gandhi Alimasi Djuna''' (born 6 May 1986), known professionally as '''Maître Gims''' and more recently just '''Gims''' (stylized in [[all caps]]), is a [[Democratic Republic of the Congo|Congolese]] singer, rapper, producer, and songwriter. Gims grew up in France and currently lives in France and Morocco. He rose to fame as a member of the [[Hip hop music|hip hop]] group [[Sexion d'Assaut]] and pursued an individual career under the name Maître Gims in 2013. In 2006, he released an [[extended play]], titled ''[[Ceux qui dorment les yeux ouverts]]''. During his career he has worked with several international artists such as [[Sia]], [[Pitbull (rapper)|Pitbull]], [[Lil Wayne]], [[Stromae]], [[Maluma]], [[Sting (musician)|Sting]], and others. He has sold over 5 million records, including 3 million albums since the start of his career. He started his solo career in 2013 with the release of his first album, [[Subliminal (album)|''Subliminal'']] in May on [[Wati B]] and [[Monstre Marin Corporation]], which sold over a million copies and peaked at number two on the French album charts. In December he released a reissue titled ''Subliminal la face cachée''. The album contained songs such as \"[[J'me tire]]\", \"[[Bella (Maître Gims song)|Bella]]\" and \"[[Zombie (Gims song)|Zombie]]\". From its first week of operation, the album certified platinum and would end up being double diamond disc for over 1 million in sales. The album was a great success, charting high in France, Belgium, and Switzerland.\n\nIn August 2015, Gims released his second album, ''[[Mon cœur avait raison]]''. The album was divided into two parts: the red pill, which contains rap songs, and the blue pill, which contains [[Urban contemporary music|pop-urban]] songs. The idea came from the movie ''[[The Matrix]]''. A year later he released a re-release titled ''À contrecœur''. The album contained some of the best songs in his career, such as: \"[[Est-ce que tu m'aimes?]]\", \"[[Laissez passer (song)|Laissez passer]]\", \"[[Brisé (song)|Brisé]]\", \"[[Sapés comme jamais]]\", \"[[Tu vas me manquer]]\", \"[[Je te pardonne]]\", \"[[Ma beauté]]\" and \"[[Tout donner]]\". The album was well received and after having sold nearly 85,800 records in its first week, it was certified platinum. At the end of 2018, more than 700,000 units had been sold in France and 581,000 units had been sold internationally. He released his third album in March 2018, titled ''[[Ceinture noire]]'' on the [[TF1 Group]] and Play Two labels. The album has been reissued several times: ''Transcendence'' reissue was released in April 2019 and an other reissue ''Décennie'' with 4 new titles was released in December 2019. The album entered pole position in Wallonia. 1st place remains for 7 consecutive weeks before dropping to 2nd place. The following week, he climbs back to first place. He entered Flanders 28th. The album contained songs such as \"[[Caméléon (song)|Caméléon]]\", \"[[Miami Vice (song)|Miami Vice]]\", \"[[Hola Señorita]]\", \"[[Reste]]\", \"[[10/10 (Maître Gims song)|10/10]]\" and \"[[Mi Gna#Maître Gims Remix|Mi Gna]]\". His song \"[[La même]]\" was the most played in France in 2018 and it helped Gims become the most played artist of 2018 on French television and radio, as well as the seventh most performed artist in the world on [[Deezer]].\n\nDuring the [[COVID-19 pandemic]] confinement, Gims announces on a live [[Instagram]] a 100% rap album for the month of October 2020. According to some publications on his Instagram, Gims reveals that his album would be an 80% rap album contrary to what had been announced. On 4 December 2020, he released his fourth album titled ''[[Le fléau]]''. In November 2020, In 2020, he won the International Artist of the Year in [[Distinctive International Arab Festivals Awards]] after his featuring in [[Mohamed Ramadan (actor and singer)|Mohamed Ramadan]]'s song \"Ya Habibi\". On 17 September 2020, [[Netflix]] released a documentary about the last ten years of his career titled ''[[Gims: On the Record]]''. A reissue entitled ''Les vestiges du fléau'' was published on 28 May 2021. A second reissue titled ''L'Empire de Méroé'' was released on 3 December 2021. The album contained songs such as \"[[Yolo (Gims song)|Yolo]]\", \"[[Immortel (song)|Immortel]]\", \"[[Jusqu'ici tout va bien]]\", \"[[Belle (Patrick Fiori, Daniel Lavoie and Garou song)#Dadju, Gims and Slimane version|Belle]]\" and \"[[Only You (Gims song)|Only You]]\".\n\nOn 5 October 2022, Gims revealed the new album's title, its release date and its cover. At the same time, the pre-order of the record was made available, accompanied by three tickets, gold, platinum and diamond to be won. In December 2022, he released his fifth album, ''[[Les dernières volontés de Mozart]]'' or ''LDVM (Symphony)''. The album is certified gold with more than 50,000 copies sold in June 2023. In July 2024, the album reached 100,000 copies sold and was certified platinum. The album will have finally had its small success, although it has sold less than his previous projects. In August 2022, he played the song \"Arhbo\" for the ''[[FIFA World Cup Qatar 2022 Official Soundtrack|2022 FIFA World Cup Official Soundtrack]]'' along with [[Ozuna]], which they also performed during the closing ceremony. He has topped the French singles chart five times, including once as a featured artist, most recently in 2024 with \"Spider\", featuring [[Dystinct]]. On 13 September 2024, Gims released a second EP and his first since 2006, titled ''[[Le Nord se souvient]]'' containing the tracks \"Spider\", \"Sois pas timide\", \"Terminal 2F\" and \"Vent du Nord\" as well as three new tracks.",
  "last_revision_date": "2025-11-14T03:11:31Z",
  "genres": [
    25,
    276,
    555,
    807,
    935,
    936
  ]
}