{
  "name": "Glenn Miller",
  "description": "'''Alton Glen''' \"'''Glenn'''\" '''Miller''' (March 1, 1904 – December 15, 1944) was an American [[big band]] conductor, arranger, composer, trombonist, and recording artist before and during [[World War II]], when he was an officer in the [[United States Army Air Forces|US Army Air Forces]]. His civilian band, [[Glenn Miller Orchestra|Glenn Miller and his Orchestra]], was one of the most popular and successful bands of the 20th century and the big band era. \n\nGlenn Miller and his Orchestra was the best-selling recording band from 1939 to 1942. Unlike his military unit, Miller's civilian band did not have a string section, but it did have a [[Slapping (music)|slap bass]] in the [[rhythm section]]. It was also a touring band that played multiple radio broadcasts nearly every day. Its best-selling records include Miller's theme song, \"[[Moonlight Serenade]]\", and the first gold record ever made, \"[[Chattanooga Choo Choo]]\", a song on the soundtrack of Miller's first film, ''[[Sun Valley Serenade]]'', and the number-one song in the United States on [[Attack on Pearl Harbor|December 7, 1941]]. The following tunes are also on that best-seller list: \"[[In the Mood]]\", \"[[Pennsylvania 6-5000 (song)|Pennsylvania 6-5000]]\" (printed as \"Pennsylvania Six-Five Thousand\" on record labels), \"[[A String of Pearls (song)|A String of Pearls]]\", \"[[Moonlight Cocktail]]\", \"[[At Last]]\", \"[[(I've Got a Gal In) Kalamazoo]]\", \"[[American Patrol]]\", \"[[Tuxedo Junction]]\", \"[[Elmer's Tune]]\", \"[[Little Brown Jug (song)|Little Brown Jug]]\", and \"[[Anvil Chorus]]\". \n\nIncluding \"Chattanooga Choo Choo\", five songs played by Miller and His Orchestra were number-one hits for most of 1942 and are on the [[List of Billboard number-one singles of 1942|list of ''Billboard'' number-one singles of 1942]]. In four years, Miller scored 16 number-one records and 69 top-10 hits, more than [[Elvis Presley discography|Elvis Presley]] (40) or [[The Beatles discography|the Beatles]] (35). His musical legacy includes multiple recordings in the [[Grammy Hall of Fame]]. His work has been performed by swing bands, jazz bands, and big bands worldwide for over 75 years.\n\nMiller is considered the father of the modern US military bands. In 1942, he volunteered to join the US military. He entertained troops during World War II, and ended up in the [[United States Army Air Forces|US Army Air Forces]]. Their workload was just as heavy as the civilian band's had been. With a full string section added to a big band, the Major Glenn Miller Army Air Forces Orchestra was the forerunner of many US military big bands.\n\nMiller went [[missing in action]] (MIA) on December 15, 1944, on a flight over the [[English Channel]] from England to France. In keeping with standard operating procedure for the US military services, he was officially declared dead a year and a day later. An Army investigation led to an official finding of death (FOD) for Miller, Norman Baessell, and John Morgan, all of whom died on the same flight. All three officers are listed on the Tablets of the Missing at [[Cambridge American Cemetery and Memorial]] in Cambridge, England. Since his body was not recoverable, Miller was allowed to have a memorial headstone placed at the US Army-operated [[Arlington National Cemetery]]. In February 1945, he was posthumously awarded the [[Bronze Star Medal]].",
  "last_revision_date": "2025-06-16T19:29:47Z"
}