{
  "name": "Gloria Estefan",
  "description": "'''Gloria María Milagrosa Estefan''' ({{IPA|es|ˈɡloɾja esˈtefan}}; {{née|'''Fajardo García'''}}; born September 1, 1957) is a Cuban singer, songwriter, actress, and businesswoman. Estefan is an eight-time [[Grammy Awards|Grammy Award]] winner, a [[Presidential Medal of Freedom]] recipient, and has been named one of the Top 100 greatest artists of all time by both [[VH1]] and ''[[Billboard (magazine)|Billboard]]''. Estefan's record sales exceed 100 million worldwide, making her one of the best-selling female singers of all time. \n\nA [[contralto]], Estefan started her career as lead singer of Miami Latin Boys, which was later renamed [[Miami Sound Machine]]. She and Miami Sound Machine earned worldwide success with their 1985 single \"[[Conga (song)|Conga]]\", which became Estefan's [[signature song]]. The group followed this with a number of hit singles throughout the decade, including \"[[Anything for You (Gloria Estefan and Miami Sound Machine song)|Anything for You]]\", \"[[1-2-3 (Gloria Estefan and Miami Sound Machine song)|1-2-3]]\", \"[[Bad Boy (Miami Sound Machine song)|Bad Boy]]\", and \"[[Rhythm Is Gonna Get You]]\". The group was redubbed as Gloria Estefan and Miami Sound Machine with the release of their 1987 album ''[[Let It Loose (album)|Let It Loose]]'', and in 1989, Estefan rose to solo stardom with her debut solo album ''[[Cuts Both Ways]]''.\n\nIn March 1990, Estefan sustained a life-threatening [[cervical fracture]] of her spine when her tour bus was involved in a crash near [[Scranton, Pennsylvania]]. She underwent an emergency surgery and made a full recovery. The following year, Estefan launched her comeback with a worldwide tour and album, ''[[Into the Light (Gloria Estefan album)|Into the Light]]''. Estefan's 1993 Spanish-language album, ''[[Mi Tierra]]'', won the first of her three [[Grammy Awards]] for [[Best Tropical Latin Album]]. The album was also the first [[Diamond album]] in Spain. Estefan's catalog of international solo hits includes \"[[Don't Wanna Lose You]]\", \"[[Get On Your Feet]]\", \"[[Coming Out of the Dark]]\", \"[[Turn the Beat Around]]\", \"[[You'll Be Mine (Party Time)]]\", and \"[[Heaven's What I Feel]]\".\n\nEstefan has been awarded a star on the [[Hollywood Walk of Fame]] and [[Las Vegas Walk of Fame]] and was a [[Kennedy Center Honors]] recipient in 2017 for her contributions to American cultural life. Estefan won an [[MTV Video Music Award]], was honored with the [[American Music Award]] for Lifetime Achievement and has been named [[Broadcast Music, Inc.|BMI]] Songwriter of the Year. She was inducted into the [[Songwriters Hall of Fame]] and has received multiple [[Billboard Music Award|''Billboard'' Music Awards]]. She is also a recipient of the 2015 Presidential Medal of Freedom.\n\n''Billboard'' has listed Estefan as the third-most successful Latina and 23rd-greatest Latin Artist of all time in the U.S., based on both Latin albums and Latin songs chart. Hailed as the \"[[Honorific nicknames in popular music|Queen of Latin Pop]]\" and \"Mother of Latin Pop\" by the media, she has amassed 38 number one hits across ''Billboard'' charts, including 15 chart-topping songs on the Hot Latin Songs chart.",
  "last_revision_date": "2025-08-05T23:30:44Z",
  "genres": [
    692,
    315
  ]
}