{
  "name": "Grizzly Bear",
  "description": "'''Grizzly Bear''' is an American [[Rock music|rock]] band from [[Brooklyn, New York]], formed in 2002. For most of its tenure, the band has consisted of [[Edward Droste]] (vocals, keyboards, guitar), [[Daniel Rossen]] (vocals, guitar, banjo, keyboards), [[Chris Taylor (Grizzly Bear musician)|Chris Taylor]] (bass, backing vocals, woodwinds, production), and [[Christopher Bear]] (drums, percussion, backing vocals). The band have employed both traditional and electronic instruments, and their sound has been categorized as [[chamber pop]], [[psychedelic folk]], and [[art rock]]. The band is also known for their use of [[vocal harmony]], with all four members contributing vocals and lead vocals alternating between Rossen and Droste.\n\nInitially a solo project for Droste, the first Grizzly Bear album, ''[[Horn of Plenty (Grizzly Bear album)|Horn of Plenty]]'' (2004), was a [[lo-fi]] studio project released on [[Kanine Records]]. The album featured drumming contributions from Bear, who would go on to join the project full-time in 2004. The duo then enlisted both Taylor and Rossen, originally strictly for live performances. Performing as a four-piece, however, the resulting chemistry turned Grizzly Bear into a band of equal collaborators, with Rossen becoming its co-lead vocalist and second principal songwriter and Taylor adopting the role of [[record producer|producer]] and multi-instrumentalist. The band's second studio album, ''[[Yellow House (album)|Yellow House]]'', was released to widespread critical acclaim in 2006 and was the first to feature the full Grizzly Bear band.\n\nPreceded by the single \"[[Two Weeks (Grizzly Bear song)|Two Weeks]]\", the band's third studio album, ''[[Veckatimest]]'' (2009), increased their exposure significantly, reaching #8 on the [[Billboard 200|''Billboard'' 200]] and selling over 220,000 copies. After extensive touring, the band reconvened for the more experimental and expansive album, ''[[Shields (album)|Shields]]'', which was released to further acclaim in 2012. The band's fifth studio album, ''[[Painted Ruins]]'', was released in 2017. Following the album's accompanying tour, the band entered an extended hiatus, with Droste announcing that he had left the band in 2020.\n\nIn May 2025, the band announced a US tour with all four members, alongside a message confirming that the band \"never broke up.\"",
  "last_revision_date": "2025-06-03T23:00:11Z"
}