{
  "page_title": "Grup Vitamin",
  "description": "'''Grup Vitamin''' is a Turkish [[pop music|pop]] and [[pop rock]] band which make [[Parody music|parody songs]]. The Grup Vitamin is composed of Emrah Anul, Selçuk Aksoy and Tolga Sünter. Previously, [[Ercan Saatçi]] and [[İzel Çeliköz|İzel]] were members of the band.\n\nThe band released its debut album, Bol Vitamin in 1990. The band's first cast members were Gökhan Semiz, Ufuk Yıldırım, Ercan Saatçi, İzel Çeliköz, Sertaç Demirtaş, Emrah Anul, Selçuk Aksoy and Murat Uzunal. After release of this album, Murat Uzunal left the band. The same year, İzel left the band. Murat Uzunal released his debut album \"Yangın Var\" in 1992\n\nAfter this unexpected success of the first album, the band released Cezmi in 1991. After conflicts inside the band, it divided into two separate bands. The real Vitamin continued with Gökhan Semiz, Selçuk Aksoy, Emrah Anul and Sertaç Demirtaş. At the same time, Ercan Saatçi and Ufuk Yıdırım started to perform in concerts using the name ''Vitamin''. Debates about which the real ''Vitamin'' is started to exist. Ercan and Ufuk attended a [[morning show]] and [[Lip-synching in music|lip synced]] one of Gökhan's songs. They mentioned the album as their solo album.  Ercan and Ufuk gave up the name, because the Vitamin concept belonged to Gökhan Semiz. He and Ufuk changed their band's name to Uf-Er and release two albums, ''Vitamin Değil Şifa Niyetine'' in 1992 and ''Ebabil Kuştur'' in 1994. Then, this duo stopped doing this kind of music.\n\nThey released Yandık Desene in 1992. Üşüttük followed it in 1993. Between 1992 and 1993, they co-hosted a tv show, ''Eğlence Sırılsıklam'' with dancer Aslıhan Öncü in [[Star TV (Turkey)|STAR]] (Formerly Magic Box Star 1, now Star). Gökhan Semiz, who assumed the leadership of the band released his first solo album, ''Mikrop'' in 1992. At the end of 1993, Sertaç Demirtaş left the band. He formed a duo with Murat Uzunal, former Grup Vitamin member, as \"Sertaç & Murat\"  and released only parody album \"Bizim Çocuklar\" (\"Our Boys\" in Turkish) in 1994. He stopped doing music in 1995. Murat Uzunal released Ispanaklı Yumurta (\"Egg with Spinach\") album in 2002.\n\nThe band, which has 3 members because Sertaç Demirtaş left, released Aşkın Gözyaşları in 1994. Zeytinyağlı Yaprak Dolması followed the next year. Yedigün, a Turkish [[Orange soft drink]] brand, used a  song from this album, ''Takmayacaksın'', and won a crystal apple. Gökhan Semiz died in 1998. Later, the band released its final album, İyi Günler Türkiye in 1998. Then, the band broke up.\n\nIn May 2015, the band was reactivated with all members alive from 1999 and a new vocal (Tolga Sünter) was joined the band who was the composer of the band. Also in 2015 they released a new album \"Endopilazmik Retikulum.",
  "last_revision_date": "2025-06-10T15:38:07Z"
}