{
  "page_title": "Gustavo Cerati",
  "description": "'''Gustavo Adrián Cerati Clarke''' (11 August 1959 – 4 September 2014) was an Argentine musician and singer-songwriter who gained international recognition for being the leader, vocalist, composer, and guitarist of the rock band [[Soda Stereo]]. He is widely considered by critics, specialized press, and musicians as one of the most important and influential artists of [[Latin rock]]. ''[[Billboard (magazine)|Billboard]]'' magazine ranked Cerati as the 33rd best rock singer of all time. In 2012, ''[[Rolling Stone Argentina|Rolling Stone]]'' ranked Cerati in seventh place among the 100 best Argentine rock guitarists. Throughout his solo career, he sold more than 10 million records and won numerous awards, including the [[Latin Grammy Awards|Latin Grammy]], [[Los Premios MTV Latinoamérica|MTV]], [[Konex Award|Konex]], and [[Premios Gardel|Gardel]]. \n\nInfluenced by [[the Beatles]] and [[the Police]], Cerati joined various groups during his adolescence, and in 1982 he founded the Latin rock band Soda Stereo. Leader and main composer of the group, from ''[[Signos (album)|Signos]]'' (1986) his way of making songs began to mature, and his consolidation reached it at the beginning of the 90s with ''[[Canción Animal]]'' (1990), in which he returned to the roots of Argentine rock from the 70's. Parallel to his career with the group, in 1992 he published the album ''[[Colores Santos]]'' as a duet with Daniel Melero, considered one of the first in South America to include [[electronic music]], and the following year he would publish his first as a soloist, ''[[Amor Amarillo]]''. His taste for electronic music led him to incorporate it into his latest works with Soda Stereo. After the separation of the band, he released ''[[Bocanada]]'' (1999) and ''[[Siempre es hoy]]'' (2002), where he showed his interest in the genre more than he freely manifested in his alternate projects Plan V and Ocio. He returned to the rock style with his fourth album, ''[[Ahí vamos]]'' (2006), which received acclaim from the public and critics, and which contains some of his greatest solo hits, such as \"[[Crimen (song)|Crimen]]\" and \"Adiós\". In 2007, he reunited with Soda Stereo after ten years apart on a tour that brought together more than a million viewers. In 2010, he was left in a coma after suffering a stroke, after finishing a concert in which he promoted his latest album, [[Fuerza natural|''Fuerza Natural'']] (2009). Four years later, on 4 September 2014, Cerati died of [[cardiac arrest]] in [[Buenos Aires]] aged 55.\n\nCerati was a prolific session player, he was a guest guitarist on songs by [[Caifanes]], [[Babasónicos]] and [[Los Brujos]], and he collaborated on songs with [[Charly García]], [[Andrés Calamaro]], [[Fito Páez]], [[Shakira]], [[Andy Summers]], [[Roger Waters]] and [[Mercedes Sosa]], among others.",
  "last_revision_date": "2025-06-18T01:14:55Z"
}