{
  "name": "Gwar",
  "description": "'''Gwar''', often stylized as '''GWAR''', is an American [[heavy metal music|heavy metal]] band formed in [[Richmond, Virginia]], in 1984, composed of and operated by a frequently [[List of Gwar members|rotating line-up]] of musicians, artists, and filmmakers collectively known as [[Slave Pit Inc.]] Since the death of frontman [[Dave Brockie]] in 2014, the collective has continued recording and performing without any of its founding artists or musicians.\n\nIdentified by their distinctively grotesque costumes, Gwar's core thematic and visual concept revolves around an elaborate [[science fiction]]-themed mythology which portrays the band members as barbaric medieval Nordic, mythological, biblical or interplanetary warriors, a narrative which serves as the basis for all of the band's albums, live shows and media. With over-the-top violent, sexual, and [[scatological humor]] typically incorporating social and political [[satire]], Gwar has attracted both acclaim and controversy for its music and stage shows, the latter of which notoriously showcase enactments of [[graphic violence]] that result in the audience being sprayed with fake blood, urine, and semen. Such stagecraft regularly leads Gwar to be labeled a \"[[shock rock]]\" band by the media.\n\nSince its formation, Gwar has released 15 studio albums, two live albums, and numerous singles among [[Gwar discography|other recordings]], and has sold over 820,000 records in the United States. Fueled largely by the controversies surrounding their concerts, Gwar experienced brief mainstream notoriety during the first half of the 1990s, receiving regular airplay on [[MTV]] as well as frequent in-character guest appearances on daytime [[talk show]]s, satirizing the topics of [[censorship]] and [[media violence research|media violence]]. Though the band's mainstream popularity declined by the end of the 1990s, Gwar has retained a dedicated [[cult following]]. The band's extensive [[Gwar videography|videography]] consists of both live recordings and long-form feature films, most notably 1992's ''[[Phallus in Wonderland]]'', which earned a [[Grammy Award]] nomination for [[Best Long Form Music Video]]. Gwar has also expanded its brand into other areas such as books, [[comic book]]s [[board game]]s, [[beer]], [[whisky]], [[barbecue sauce]], [[Cannabidiol|CBD]], [[construction of electronic cigarettes#E-cigarette liquid|e-liquid]]s, toy collectibles, and [[sex toy]]s.\n{{TOC limit|3}}",
  "last_revision_date": "2025-12-13T18:29:55Z",
  "genres": [
    272,
    301,
    551,
    1117,
    1223
  ]
}