{
  "page_title": "Hank Williams",
  "description": "'''Hiram''' \"'''Hank'''\" '''Williams'''{{efn|His middle name is often misreported as \"King\", which originated from a misunderstanding that he was named after King [[Hiram I]]. However, this name is not present on his birth certificate or any other documentation Hank signed during his life.}} (September 17, 1923 – January 1, 1953) was an American singer, songwriter, and musician. An early pioneer of country music, he is regarded as one of the most significant and influential musicians of the 20th century. Williams recorded 55 singles that reached the top 10 of the [[Hot Country Songs|''Billboard'' Country & Western Best Sellers chart]], five of which were released posthumously, and 12 of which reached No.1.\n\nBorn and raised in Alabama, Williams learned guitar from African-American [[blues]] musician [[Rufus Payne]]. Both Payne and [[Roy Acuff]] significantly influenced his musical style. After winning an amateur talent contest, Williams began his professional career in Montgomery in the late 1930s playing on local radio stations and at area venues such as school houses, movie theaters, and bars. He formed the [[Drifting Cowboys]] backup band, which was managed by his mother, and dropped out of school to devote his time to his career. Because his alcoholism made him unreliable, he was fired and rehired several times by radio station [[WLWI (AM)|WSFA]], and had trouble replacing several of his band members who were drafted during World War II.\n\nIn 1944, Williams married [[Audrey Williams|Audrey Sheppard]], who competed with his mother to control his career. After recording \"Never Again\" and \"[[Honky Tonkin']]{{-\"}} with [[Sterling Records (US)|Sterling Records]], he signed a contract with [[MGM Records]]. He released the hit single \"[[Move It On Over (song)|Move It On Over]]\" in 1947 and joined the ''[[Louisiana Hayride]]'' radio program. The next year he released a cover of \"[[Lovesick Blues]]\", which quickly reached number one on ''[[Billboard (magazine)|Billboard]]''{{'s}} Top Country & Western singles chart and propelled him to stardom on the [[Grand Ole Opry]]. Although unable to read or [[musical notation|notate music]] to any significant degree, he wrote such iconic hits as \"[[Your Cheatin' Heart]]\", \"[[Hey, Good Lookin' (song)|Hey, Good Lookin']]{{-\"}}, and \"[[I'm So Lonesome I Could Cry]]\". During his final years, he struggled with back pain and substance abuse, exacerbating his relationships with Audrey and the Grand Ole Opry.\n\nWilliams [[Death of Hank Williams|died]] on New Year's Day 1953 at the age of 29, his heart failing in the back seat of a car near [[Oak Hill, West Virginia]], en route to a concert in [[Canton, Ohio]]. Despite his relatively brief career, he is one of the most celebrated and influential musicians of the 20th century, especially in [[country music]]. Many artists have covered his songs and he has influenced [[Chuck Berry]], [[Elvis Presley]], [[Waylon Jennings]], [[Johnny Cash]], [[Bob Dylan]], and [[the Rolling Stones]], among others. He was inducted into the [[Country Music Hall of Fame]] in 1961, the [[Songwriters Hall of Fame]] in 1970, the [[Rock and Roll Hall of Fame]] in 1987, the [[Native American Music Awards]] Hall of Fame in 1999, and gained a star on the [[Hollywood Walk of Fame]]. In 2010, he was posthumously awarded a [[Pulitzer Prize Special Citation]] for his \"craftsmanship as a songwriter who expressed universal feelings with poignant simplicity and played a pivotal role in transforming country music into a major musical and cultural force in American life.\" His life and career were dramatized in the 2016 biopic ''[[I Saw the Light (film)|I Saw the Light]]''.",
  "last_revision_date": "2025-06-14T15:38:55Z"
}