{
  "name": "Haris Alexiou",
  "description": "'''Haris Alexiou''' ({{langx|el|Χάρις Αλεξίου}}, {{IPA|el|ˈxaris aleˈksiu|pron}}; born 27 December 1950) is a Greek singer whose career has spanned over 5 decades. She is one of the most popular singers in Greece. She has worked with important Greek songwriters and composers, has performed at top musical theatres all over the world, and has received several awards. She has recorded over thirty albums and has been featured on albums of other musicians. On 14th March 2010, Alpha TV ranked Alexiou as the first top-certified female artist in Greece in the phonographic era (since 1960). She is the highest selling Greek female artist and third overall, behind [[George Dalaras]] and [[Yiannis Parios]]. Eight of her personal albums released between 1977 and 2003 have totaled 11 million sales, the only Greek female artist to do so. \n\nShe also has an audience in Turkey and her various songs were sung in Turkish especially \"Ola Se Thimizoun\" (Everything reminds me of you) as \"Olmasa Mektubun\" (Without your letter) by [[Yeni Türkü]], [[Erol Evgin]], [[Müslüm Gürses]], Sevda Karababa and [[Pilli Bebek]]; Teli Teli Teli as \"Telli Telli\" (Demoiselle, demoiselle), Pes Mou Pos Ginetai (Tell me, how is it possible?) as \"Maskeli Balo\" (Masquerade) by [[Yeni Türkü]], [[Athena (band)|Athena]] and [[Ata Demirer]]; Mia Pista Apo Fosforo (A floor of phosphorus) as \"Her şeyi yak\" by (Burn everything) [[Sezen Aksu]] and [[Duman (band)|Duman]] and as \"Nefes Almak İstiyorum\" (I want to breathe) by [[Yonca Evcimik]]; Krata Gia To Telos (Keep it to the end) as \"Sebahat Abla\" (Elder sister Sebahat) by [[Müslüm Gürses]]; Fevgo (I'm leaving\") as \"Durma Yağmur\" (Rain don't stop) by [[Gripin]].\n\nShe has lived in [[Athens]] since 1958, when she and her family moved there from Thebes. Her grandmother's family migrated to Thebes in 1924 from [[İzmir|Smyrna]]. Her name was given to a street in Gaziemir, in İzmir province, Turkey.",
  "last_revision_date": "2026-01-23T15:05:35Z",
  "genres": [
    710,
    1037,
    1333
  ]
}