{
  "name": "Harry Thumann",
  "description": "'''Harry Thumann''' (28 February 1952 – 2001) was a [[Germans|German]] [[electronic music|electronic]] [[composer]], [[record producer]] and [[audio engineering|sound engineer]]. He designed and built groundbreaking synthesizers and studio equipment from the early 1960s onwards.\n\nBorn '''Harald Thumann''' in [[Germany]], he started out as a [[drummer]] while getting a thorough grounding in audio engineering in German broadcasting. When touring lost appeal, Thumann put his musical and technical experience to work and started his first [[recording studio]] in a bedroom at the family home. Thumann participated in the development of the [[Solid State Logic SL 4000|SSL 4000]] series of consoles, and took the first one for this studio. Premises for a permanent studio with live-in accommodation were found in [[Germering]] near [[Munich]], and Country Lane Studios were born.\n\nThumann later recognised the potential of [[MIDI]], and used [[Commodore 64]] computers with MIDI cards, controlling a system that evolved into a synthesizer installation including [[Fairlight CMI|Fairlight II]] and Moog 3C modular system. This led to a string of [[album]]s for [[Rondò Veneziano]], which married both acoustic instruments and synthesizers. Thumann released his first solo album ''American Express'' in 1979. It had the hit single \"Underwater\", which was later used in the video game ''[[Grand Theft Auto IV]]''. His second solo album was ''Andromeda'', released in 1983, which contained the highly influential track \"Sphinx\", which later inspired the theme to ''[[Knight Rider (1982 TV series)|Knight Rider]]''.{{citation needed|date=October 2019}} Both albums remain out of print and only released on vinyl. ''American Express'' was given a remastered digital release on iTunes, but ''Andromeda'' remains left out.\n\nThumann had a run of what he called \"dog records\", under the 'Wonder Dog' name, which received some success in Germany and the [[United Kingdom|UK]]  (through [[E&S Music]]). The [[Single (music)|single]], \"Ruff Mix\", peaked at #31 in the [[UK Singles Chart]] in September 1982.\n\nWith the introduction of the Yamaha DMP-7 digital mixer, Thumann built a second control room housing several DMP-7s as an integrated digital console system, interfaced with a rebuilt Neve broadcast console. Country Lane moved into [[audio-visual]] production, and started producing its own [[telefilm]]s.",
  "last_revision_date": "2025-07-17T00:48:40Z",
  "genres": [
    347,
    455,
    607,
    394
  ]
}