{
  "name": "Havana D'Primera",
  "description": "Havana D'Primera is a Cuban [[Timba]] band founded by [[Alexander Abreu]] on October 4, 2007, the date on which they performed their first live performance, at the Cabaret Turquino of the Hotel Habana Libre in Havana. The band is made up of a collective of high-level musicians in the Cuban music scene with a total of 16 members.\n\nSince their inception they have gone on to find international success, and even performed for [[Beyonce]] and [[Jay-Z]] when the couple visited [[Havana]] in 2013.\n\nLead singer and songwriter Alexander Abreu has received several awards for his artistic career: Best Timba Trumpeter in 2000 for the influential website www.timba.com and Best Folk Album for the album La Rumba Soy Yo, in the [[Latin Grammy Awards]] of 2001. In this album he participated as one of the main musicians.\n\nSince its founding, the band has released five studio albums and one live album.\n\n{| class=\"wikitable\"\n|+ Albums\n|-\n! Title !! Modality !! Typography !! Release date !! Label\n|-\n| ''Haciendo Historia'' || CD || Studio álbum || 2009 || [[EGREM]]\n|-\n| ''Pasaporte'' || CD || Studio álbum || 2013 || Páfata \n|-\n| ''La Vuelta al Mundo'' || CD || Studio album || 2015 || Páfata \n|-\n| ''Haciendo Historia LIVE'' || CD/DVD || Live album|| 2016 || Unicornio\n|-\n| ''Cantor del Pueblo'' || CD || Studio álbum || 2018 || Páfata \n|-\n| ''Será Que Se Acabó'' || CD || Studio álbum || 2021 || Páfata & Unicornio\n|}\n\n{| class=\"wikitable\"\n|+ Singles\n|-\n! Title !! Release date !! Label\n|-\n| ''Me Dicen Cuba / Rosa La Peligrosa'' || 2013 || Páfata\n|-\n| ''Trece (Remix)'' || 2015 || Páfata\n|-\n| ''Entre lo Bueno y lo Malo'' || 2018 || Páfata\n|-\n| ''Energías Oscuras (Bachata)'' || 2020 || Páfata\n|-\n| ''Quiero Verte Otra Vez'' || 2020 || Páfata\n|-\n| ''Raza'' || 2020 || Páfata & [[EGREM]]\n|-\n| ''Raza Remix'' || 2020 || Páfata & [[EGREM]]\n|-\n| ''Aventura Loca'' || 2020 || Páfata & Unicornio\n|-\n| ''Más Rollo Que Película'' || 2020 || Páfata & Unicornio\n|-\n| ''Azowano'' || 2021 || Páfata\n|}\n\nHis first album ''Haciendo Historia '' won the award for \"Best Debut Album\" at the 2010 Cubadisco gala.\n\nHis first release for the record label Páfata Productions, ''Pasaporte'', received favorable reviews from the international press  and was voted one of the best Latin albums of the year by listeners of [[NPR]]. It was named by [[Los Angeles Times]] as one of the 10 Best Latin Music Albums of The time. In addition, it was awarded the award for \"Best Popular Dance Music Album\" at the 2013 Cubadisco Awards and won the award for \"Best Choreographic Video\" at the Lucas Awards 2012 with the video for the song ''Al Final de la Vida''.\n\n''La Vuelta al Mundo'' won the awards for \"Best Popular Dance Music Album\" and \"Grand Prize\" at Cubadisco 2015, as well as \"Best Popular Dance Music Video\" at the Lucas Awards 2016 for the music video of the song Around the World. Likewise, the video for the song ''Me Dicen Cuba'' won a \"Special Award\" at the Lucas gala.\n\n''Cantor del Pueblo'' won the award for \"Best Popular Dance Music Video\" at the Lucas Awards 2019 and also secured a nomination for \"Best Salsa Album\" at the [[Latin Grammy Awards]] 2018.\n\nThe single ''Quiero Verte Otra Vez'' won the Special Prize at the Lucas Awards gala in 2020 and was also classified by the French newspaper “Le Monde” as one of the favorite songs of Latin music.",
  "last_revision_date": "2023-04-08T18:26:19Z"
}