{
  "name": "Hawthorne Heights",
  "description": "'''Hawthorne Heights''' is an American rock band formed in [[Dayton, Ohio]], in 2001. Originally called '''A Day in the Life''', their lineup consists of JT Woodruff (lead vocals, rhythm guitar), Matt Ridenour (bass, backing vocals) and Mark McMillon (lead guitar, unclean vocals).\n\nThe band had commercial success with their first two albums, ''[[The Silence in Black and White]]'' (2004), and ''[[If Only You Were Lonely]]'' (2006), both achieving [[RIAA certification|RIAA gold certification]]. Their second album peaked at No. 1 on [[Billboard (magazine)|''Billboard's'']] [[Independent Albums]] chart and No. 3 on the [[Billboard 200|''Billboard'' 200]] chart. They are also well known for their 2006 single, \"Saying Sorry\", which reached gold status and reached No. 7 on the ''Billboard'' [[Hot Modern Rock Tracks]] chart. On November 24, 2007, rhythm guitarist and unclean vocalist Casey Calvert (son of Greg Calvert of [[Gary and the Hornets]]) died, leaving the band a four-piece. Their third album and first without Calvert, ''[[Fragile Future]]'', was released in August 2008, surprisingly through [[Victory Records]] again, after a lengthy legal battle between the two parties.\n\nThe band's fourth album, ''[[Skeletons (Hawthorne Heights album)|Skeletons]]'' (2010), was No. 50 on the ''Billboard'' 200. The band's former label, Victory, released their first [[Greatest hits album|greatest hits]] album, entitled ''[[Midwesterners: The Hits]]'', in November 2010. Shortly afterward, Hawthorne Heights left [[Wind-up Records]] to begin their own record label, Cardboard Empire. Via their label, the band released an EP trilogy, beginning with ''[[Hate (EP)|Hate]],'' released in August 2011, followed by ''[[Hope (Hawthorne Heights EP)|Hope]]'' in June 2012. After signing with Red River Entertainment in 2013, the band postponed the release of the third EP in the trilogy and released a full-length concept album titled ''[[Zero (Hawthorne Heights album)|Zero]],'' in June 2013. Hawthorne Heights played on the 2013 [[Warped Tour|Vans Warped Tour]].\n\nIn June 2014, original drummer Eron Bucciarelli left the band. In January 2015, it was announced that original lead guitarist Micah Carli had also quit. Later in 2014, the band released Hurt, the third EP of the trilogy. The band's sixth studio album, ''[[Bad Frequencies]],'' followed in 2018 and then their seventh album, ''The Rain Just Follows Me,'' in September 2021 via [[Pure Noise Records]].",
  "last_revision_date": "2026-01-29T01:15:15Z",
  "genres": [
    42,
    413,
    952,
    963,
    1105
  ]
}