{
  "name": "Hecate",
  "description": "'''Rachael Lynn Gabriela Kozak-Salmi''' (born May 26, 1976), better known by her stage name '''Hecate''', is an American-Austrian experimental [[industrial music|industrial]] and [[breakcore]] musician currently based in [[Vienna]]. Her stage name originates from [[Hecate]], the [[Greek goddess]] of [[Magic (paranormal)|sorcery]].\n\nWith a career spanning over 20 years and over 30 releases to her name, she is considered one of the most prolific female producers of dark underground electronic music.{{citation needed|date=April 2021}} Together with Kareem, she co-founded the independent record label Zhark Recordings in 1996, before parting ways and continuing her share of the label as Zhark London/Zhark International. The formation of the label was a direct response to the lack of suitable outlets for [[non-mainstream]] and underground electronic artists. Mixing hardcore electronica with elements of [[Heavy metal music|heavy metal]], her solo releases include the 2006 album ''Brew Hideous'', described by ''[[Exclaim!]]'' author Laura Taylor as \"a hellish soundtrack to an old, real-life horror\".\n\nAmongst her more controversial works is the 2003 release ''[[Nymphomatriarch]]'' with [[Venetian Snares]]. The album was constructed of synthesised recordings created during their sexual activities on the road. Hecate later spoke out about the blatant sexism and erasure of her contribution that she endured in the wake of the release.\n\nIn 1998, Hecate founded Homewrecker Recordings (a.k.a. The Homewrecker Foundation), an all-female electronic label she described as being \"born of want\". The label was put to rest in 2001, with Hecate stating that although she will always encourage female talent in the genre: \"you can lead a horse to water but you can't make them drink\".\n\nAfter a period of absence from her Hecate persona, she returned once again in 2017 with two collaborations: 'Absolution' with Instinct Primal and 'Final Planet 666' with Der Blutharsch and the Infinite Hand of the Leading Path.\n\nOutside of the music scene, Hecate also exhibits as a multidisciplinary artist. Her works include large-scale paintings, illustrations, ceramic sculptures, screen printed clothing and mixed media montage. Her first exhibition was at SMart Café in [[Vienna]], May 2014. As a performance artist, she has made appearances in Belphegor's 2010 music video 'Impaled Upon the Tongue of Satan' and Daniel [[Vrangsinn]]'s 2011 video project 'Taboo'.",
  "last_revision_date": "2025-06-03T02:35:08Z",
  "genres": [
    161,
    326,
    130
  ]
}