{
  "name": "Henry Fool",
  "description": "'''Henry Fool''' are an English [[experimental rock]] band that use elements of [[psychedelia]], [[progressive rock]], [[jazz]] and [[post-rock]] in their music.\n\nThe consistent core members of the band are [[Tim Bowness]] (vocals, guitars) and [[Stephen Bennett (musician)|Stephen Bennett]] (keyboards, guitar). The rest of the lineup has been a shifting membership including [[Michael Bearpark]] (guitar), [[Peter Chilvers (musician)|Peter Chilvers]] (bass guitar, keyboards, guitar), Myke Clifford (saxophones, flute), [[I Monster]]'s Jarrod Gosling and drummers Fudge Smith (Pendragon/[[Steve Hackett]] Band), Huxflux Nettermalm ([[Paatos]]), Andrew Booker, Richard Osbourne and Diego Mancini. [[Roxy Music]]'s [[Phil Manzanera]] has also played on some of the band's recordings.\n\nThe musicians in the band are generally associated with other projects, most notably Bowness' work as singer of [[No-Man]] and Bennett's as keyboard player with LaHost. Other associated projects are [[Darkroom (electronic music project)|Darkroom]], [[Samuel Smiles (band)|Samuel Smiles]], Fire Thieves, Improvizone and the Tim Bowness/Peter Chilvers duo.\n\nHenry Fool's music draws on 1970s British [[progressive rock]] but with other influences drawn from 1960s [[Psychedelia]], 1980s [[art rock]], 1990s [[post-rock]], [[jazz]], and elsewhere. The band is named after the [[Henry Fool|Hal Hartley film]].\n\nThe band has released two albums to date.\n\n2001's self-titled ''Henry Fool'' received generally positive reviews in the progressive rock press. It was tagged as \"highly recommended\" by New Horizons  and Axiom Of Choice described it as \"quite a feat ''(with)'' plenty to offer...\" Planet Mellotron praised the band for being \"that rarest of things, a contemporary UK progressive act who don't want to be [[Marillion]] or [[It Bites]]\" and described ''Henry Fool'' itself as a \"damn' good album, modern but with traditional touches...wholeheartedly recommended.\" The Dutch Progressive Rock Pages described the band as \"a psychedelic version of [[Porcupine Tree]] or [[Echolyn]]\" and the album as \"an album for experienced listeners... complex, jazzy and psychedelic.\" Noting the slow-burning nature of the music, the DPRP also commented \"Somehow, this music is like those French artistic movies. On the one hand you don't like them, on the other hand they grasp your attention and before you know it, you have enjoyed it.\"\n\nHenry Fool played at the 2002 Whitchurch Festival minus Stephen Bennett and Fudge Smith, with bass player Peter Chilvers doubling on keyboards and Tim Bowness playing more live guitar than planned. The performance went well enough for New Horizons to dub it \"a superb and atmospheric set ... a real treat.\"\n\n2013's Men Singing was released on the [[Kscope]] label as a CD and LP. A four track instrumental album, it received very positive reviews in both the mainstream and genre press:\n\n\"The sheer amount of imagination on display on this record is a delight to behold.\" - DPRP (8.5/10 stars) \n\n\"It features loads of great dusty old stuff like Mellotrons, glockenspiels, flutes, Moogs and Phil Manzanera’s most angular guitar noises in years. Cool be damned this is hot.\" - Total Music Magazine \n\n\"The four lengthy tracks on Men Singing manage to be steeped in English Prog and Psychedelic reference points without becoming waterlogged by any of them. Phil Manzanera, invited in to channel Quiet Sun on two tracks, slots smoothly into the work.\" - Misfit City \n\nIn mid 2014 [[Colin Edwin]], bassist of [[Porcupine Tree]] and previous collaborator with Bowness, joined the band. He will participate in recording new material for a future album.",
  "last_revision_date": "2025-11-08T11:55:53Z",
  "genres": [
    425,
    634,
    959,
    976,
    986
  ]
}