{
  "name": "Hi-5",
  "description": "'''Hi-5''' were an Australian [[children's music|children's musical group]] formed in 1998 in association with the [[Hi-5 (Australian TV series)|children's television series of the same name]]. Helena Harris and [[Posie Graeme-Evans]] created the television series for the [[Nine Network]], which premiered in 1999. The group were made up of five performers who entertained and educated [[preschool]] children through music, movement, and play. [[Kellie Crawford]], [[Kathleen de Leon Jones]], [[Nathan Foley (singer)|Nathan Foley]], [[Tim Harding (musician)|Tim Harding]] and [[Charli Robinson]] were the founding members. By the end of 2008, all of the original line-up had left, and the group's membership changed several more times after that. They collectively starred in several television series, released albums, and performed on worldwide tours. The television series features puppet characters Chatterbox and Jup Jup, who were included in the group's [[List of Hi-5 live performances|live stage shows]].\n\nHi-5 were one of Australia's highest paid entertainment groups, placing in the ''[[Business Review Weekly]]''{{'}}s annual list several times, earning an estimated [[Australian dollar|A$]]18&nbsp;million in 2007. As employees of the brand, once owned by the Nine Network, the members of Hi-5 did not hold [[Equity (finance)|equity]]. The [[Australian Recording Industry Association|Australian Recording Industry Association (ARIA)]] certified their albums as double platinum (''It's a Party''), platinum (''Jump and Jive with Hi-5'', ''Boom Boom Beat'', ''It's a Hi-5 Christmas'') and gold (''Celebrate''). Four of them reached the top&nbsp;10 on the [[ARIA Charts|ARIA Albums Chart]]; ''It's a Party'' (number four, July 2000), ''Boom Boom Beat'' (number three, August 2001), ''It's a Hi-5 Christmas'' (number four, December 2001) and ''Hi-5 Hits'' (number ten, July 2003). By 2004, the original line-up had received three [[Logie Awards|Logie Television Awards]] for [[Logie Award for Most Outstanding Children's Program|Most Outstanding Children's Program]] and five consecutive [[ARIA Music Awards]] for [[ARIA Award for Best Children's Album|Best Children's Album]].\n\nThe group's later iterations did not enjoy the same popularity or critical success as its original line-up. Hi-5 were last nominated for a major Australian award in 2012 and last released an album in 2014. The Nine Network sold the brand in 2012 to Malaysian-based group Asiasons, who shifted its commercial focus to the Southeast Asian market. After a short-lived [[Hi-5 (2017 TV series, series 1)|television revival]] in 2017, the group's production company wholly relocated to Singapore and began employing a roster of temporary performers for touring purposes until 2019.",
  "last_revision_date": "2025-11-27T05:50:24Z",
  "genres": [
    232,
    941
  ]
}