{
  "page_title": "Hole (band)",
  "description": "'''Hole''' was an American [[alternative rock]] band formed in [[Los Angeles]], California, in [[1989 in music|1989]].  It was founded by singer and guitarist [[Courtney Love]] and guitarist [[Eric Erlandson]]. It had several different bassists and drummers, the most prolific being drummer [[Patty Schemel]], and bassists [[Kristen Pfaff]] (d. 1994) and [[Melissa Auf der Maur]]. Hole released a total of four studio albums between two incarnations spanning the 1990s and early-2010s and became one of the most commercially successful rock bands in history fronted by a woman.{{sfn|Carson|Lewis|Shaw|2004|pages=89–90}}\n\nInfluenced by Los Angeles' [[punk rock]] scene, the band's debut album, ''[[Pretty on the Inside]]'' (1991), was produced by [[Kim Gordon]] of [[Sonic Youth]], and attracted critical interest from British and American alternative press. Their second album, ''[[Live Through This]]'', released in 1994 by [[DGC Records]], combined elements of punk, [[grunge music|grunge]], and pop rock music,{{sfn|Kallen|2012|p=78}} and was widely acclaimed, reaching [[RIAA certification|platinum status]] within a year of its release. Their third album, ''[[Celebrity Skin]]'' (1998), marked a notable departure from their earlier punk influences, boasting a more commercially viable sound; the album sold around 2 million copies worldwide, and earned them significant critical acclaim.\n\nThey disbanded in 2002, and the members individually pursued other projects. Eight years later in 2010, Hole was reformed by Love with new members, despite Erlandson's claim that the reformation breached a mutual contract he had with her. The reformed band released the album ''[[Nobody's Daughter]]'' (2010), which was conceived as Love's second solo album. In 2013, Love retired the Hole name, releasing new material and touring as a solo artist.\n\nHole received several accolades, including four [[Grammy Awards|Grammy Award]] nominations. They were also commercially successful, selling over three million records in the United States alone, and had a far-reaching influence on contemporary female artists. Music and [[feminism|feminist]] scholars have also recognized the band as the most high-profile musical group of the 1990s to discuss gender issues in their songs, due to Love's aggressive and violent lyrical content, which often addressed themes of body image, abuse, and sexual exploitation.",
  "last_revision_date": "2025-05-03T21:03:59Z"
}