{
  "name": "The Hot Boys",
  "description": "The '''Hot Boys''' (often styled as '''Hot Boy$''') are an American [[Hip-hop|hip hop]] group from [[Uptown New Orleans]], Louisiana, formed in 1997 and composed of rappers [[B.G. (rapper)|B.G.]], [[Lil Wayne]], [[Juvenile (rapper)|Juvenile]] and [[Turk (rapper)|Turk]].\n\nThe group signed with then-independent record label [[Cash Money Records]] to release their debut studio album, ''[[Get It How U Live!]]'' (1997). Despite negative reviews, it peaked at number 37 on the [[Top R&B/Hip-Hop Albums]] chart with regional sales, and has since sold 400,000 units domestically. Following Cash Money's joint venture deal with [[Universal Records (1995)|Universal Records]], the group released their second album, [[Guerrilla Warfare (album)|''Guerrilla Warfare'']] (1999), to further commercial success, peaking at number five on the [[Billboard 200|''Billboard'' 200]], selling 142,000 copies in its first week, and receiving [[platinum certification]] by the [[Recording Industry Association of America]] (RIAA).\n\nThe group disbanded by 2003 when Juvenile, Turk, and B.G. left Cash Money, citing financial mismanagement, leaving Lil Wayne as the only original member signed to the label. Despite this, one further album from the group — ''[[Let 'Em Burn]]'' (2003), composed of material originally recorded between 1998 and 2000 — was released, and peaked at number 14 on the ''Billboard'' 200.\n\nMany setbacks have prevented the group from having an official reunion. In 2006, Turk was sentenced to 14 years in prison for second degree attempted murder, slowing down plans for a reunion in 2009. Shortly before Turk's release from prison in 2012, B.G. was sentenced to 14 years in prison for gun possession and witness tampering; he was released in 2023. Since then, Hot Boys has managed to release one song together, a remix of Turk's 2012 song \"Zip It\".",
  "last_revision_date": "2025-09-13T03:33:19Z",
  "genres": [
    155,
    482,
    1138,
    1225
  ]
}