{
  "description": "'''Chester Arthur Burnett''' (June 10, 1910{{snd}}January 10, 1976), better known by his stage name '''Howlin' Wolf''', was an American [[blues]] singer, guitarist and harmonica player. He was at the forefront of transforming acoustic [[Delta blues]] into electric [[Chicago blues]], and over a four-decade career, recorded blues, [[rhythm and blues]], [[rock and roll]], and [[psychedelic rock]]. He is regarded as one of the most influential blues musicians of all time.\n\nBorn into poverty in [[Mississippi]], Burnett became a protégé of Delta blues musician [[Charley Patton]] in the 1930s. In the [[Deep South]], he began a solo career by performing with other notable blues musicians of the day. By the end of the decade, he had established himself in the [[Mississippi Delta]]. Following a number of legal issues, a stint in prison, and Army service, he was recruited by A&R man [[Ike Turner]] to record for producer [[Sam Phillips]] in Memphis. His first record \"[[Moanin' at Midnight]]\" (1951) led to a record deal with [[Chess Records]] in Chicago. Between 1951 and 1969, six of his songs reached the [[Billboard (magazine)|''Billboard'']] R&B charts. His studio albums include ''Howlin' Wolf'' a..k.a The Rocking Chair Album, a collection of singles from 1957 to 1961, ''[[The Howlin' Wolf Album]]'' (1969), ''[[Message to the Young]]'' (1971), ''[[The London Howlin' Wolf Sessions]]'' (1971), and ''[[The Back Door Wolf]]'' (1973). His reputation grew throughout the [[American folk music revival|blues revival]] of the 1960s, and he continued to perform until November 1975, when he performed for the last time alongside fellow blues musician [[B. B. King|B.B. King]]. He died on January 10, 1976, after years of deteriorating health. In 1980, Howlin' Wolf was inducted into the [[Blues Hall of Fame]], and in 1991, he was inducted into the [[Rock and Roll Hall of Fame]].\n\nWith a booming voice and an imposing physical presence, he is one of the best-known Chicago blues artists. [[AllMusic]] has described him as \"a primal, ferocious blues belter with a roster of classics rivaling anyone else, and a sandpaper growl of a voice that has been widely imitated\". Several of his songs have become blues and blues rock standards. The Rock and Roll Hall of Fame listed \"[[Little Red Rooster]]\", \"[[Smokestack Lightning]]\" and \"[[Spoonful]]\" in its \"500 Songs That Shaped Rock and Roll\" and “Smokestack Lightning\" was inducted into the Grammy Hall of Fame in 1999. In 2011, ''[[Rolling Stone]]'' magazine ranked him number 54 on its list of the \"[[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]\".",
  "last_revision_date": "2025-06-03T00:44:59Z"
}