{
  "name": "Hugo Fattoruso",
  "description": "'''Hugo Fattoruso''' (born 29 June 1943) is an Uruguayan musician, composer, arranger and multi-instrumentalist. He is considered a significant figure in contemporary Latin American music, with a career encompassing [[Rock music|rock]], [[jazz]], [[candombe]], [[funk]] and [[Jazz fusion|fusion]] since the 1950s.\n\nFattoruso first became known as a member of '''[[Los Shakers]]''', a 1960s Uruguayan rock band noted for its Beatle-influenced sound. The group gained widespread popularity in South America. While their first two albums drew heavily on the Beatles’ musical style, their third and final album, ''[[La conferencia secreta del Toto's Bar|La Conferencia Secreta del Toto’s Bar]]'' (1968), incorporated elements of tango, candombe and bossa nova, and is regarded as an important contribution to the development of [[Latin rock]].\n\nIn the early 1970s Fattoruso moved to the United States, where he co-founded the jazz-fusion ensemble '''[[Opa (Uruguayan band)|Opa]]''' with his brother [[Osvaldo Fattoruso]] originally as the backing group for [[Airto Moreira]]. The group blended electric jazz with Afro-Uruguayan candombe, Brazilian music and funk, and later achieved a cult following within the Latin jazz-rock scene.\n\nThroughout his career Fattoruso has collaborated with artists such as [[Milton Nascimento]], [[Airto Moreira]], [[Flora Purim]], [[Hermeto Pascoal]], [[Djavan]], [[Jaime Roos]] and [[Rubén Rada|Ruben Rada]]. His solo work spans a wide range of genres, and he has led or participated in numerous projects, including Trio Fattoruso, Barrio Opa and Rey Tambor, often focusing on the fusion of candombe and jazz.\n\nFattoruso has received several awards for his work, including a '''Latin Grammy Award for Musical Excellence'''. He continues to perform and record, and remains an influential figure in Uruguay’s musical culture as well as in international jazz and world music.",
  "last_revision_date": "2026-01-20T20:45:57Z",
  "genres": [
    205,
    637,
    638
  ]
}