{
  "name": "I See Stars",
  "description": "'''I See Stars''' are an American [[electronicore]] band from [[Warren, Michigan]] formed in 2006. The band currently consists of lead vocalist Devin Oliver, guitarist Brent Allen, keyboardist and co-vocalist Andrew Oliver, and bass guitarist Jeff Valentine.\n\nTheir first album, ''[[3-D (I See Stars album)|3-D]]'' (2009), peaked at No. 176 on the [[Billboard 200|''Billboard'' 200]]. Their second album, ''[[The End of the World Party]]'', was released on February 22, 2011. The band's third studio album, ''[[Digital Renegade]]'', was released on March 13, 2012, which demonstrated a stylistic change, featuring a more aggressive musical style than their prior albums. The band also appeared on the song, \"Beauty and the Beast\", by [[Dubstep]] producer BARE. The band's fourth studio album, ''[[New Demons]]'', was released October 22, 2013, which featured elements of [[electronic dance music|EDM]] while achieving an even further aggressive style than ''Digital Renegade''. On March 25, 2015, the band released their first [[remix album]], titled ''[[Phases (I See Stars album)|Phases]]''. The band's line-up remained unchanged, (excluding the brief departure of vocalist Zach Johnson in 2009, who returned the following year) from their formation in 2006, up until mid-2015, when the group announced the departure of rhythm guitarist Jimmy Gregerson and Johnson. Lead vocalist Devin Oliver now pursues both clean vocals and [[unclean vocals]]. Their fifth studio album and the first album featuring the new line-up, ''[[Treehouse (I See Stars album)|Treehouse]]'', was released on June 17, 2016. Drummer Luke Holland played the drum track for this album, while Andrew Oliver started his place on the keyboard. on the EP ''Treehouse (Acoustic)'', which was released on April 6, 2018. After nearly a seven year hiatus, I See Stars teased their return by posting a polaroid picture on their Instagram account featuring a lyric to their song Drift, which later dropped in their ''SPLIT - EP'' on August 1, 2024. The EP features their most recently released songs including SPLIT, D4MAGE DONE, are we 3ven?, Anomaly, and Drift.\n\nThe band has released all six of their studio albums, and other releases, through [[Sumerian Records]].",
  "last_revision_date": "2025-06-09T22:35:21Z",
  "genres": [
    915,
    399,
    393,
    744
  ]
}