{
  "name": "Icarus Witch",
  "description": "'''Icarus Witch''' is a [[heavy metal music|heavy metal]] band from [[Pittsburgh]], [[Pennsylvania]], United States, formed in 2003 by bassist Jason Myers. The band has six releases through the Los Angeles–based label Cleopatra Records. They were founding members of the \"[[New wave of traditional heavy metal]]\" according to Metal Hammer U.K. Magazine and have since progressed into a melodic metal style merging influences of classic metal, AOR, goth and modern heavy rock.\n\nIcarus Witch have toured with bands such as Y&T, Trouble, White Wizzard and former [[Iron Maiden]] singer [[Paul Di'Anno]], the latter of which they also performed as backing musicians for. Additionally they had the honor of being selected to open for Heaven and Hell at one of Ronnie James Dio's final performances. Icarus Witch have had notable guest stars on their albums including George Lynch (Dokken, Lynch Mob), Joe Lynn Turner (Deep Purple, Rainbow, Yngwie Malmsteen), Frank Aresti (Fates Warning) and Michael Romeo (Symphony X).\n\nOriginal singer, Matthew Bizilia parted ways with the band in 2010 due to artistic differences, health and to pursue a solo career, forming the band Habitual Sins with original guitarist [[Steve Pollick]]. With the release of ''RISE'', and the subsequent video and tour that followed, Icarus Witch developed from an underground cult act into a more produced, modern metal band, a move which served them well in terms of press accolades and broadening their following substantially. Yet throughout their musical evolution, they have always remained true to their pagan roots, a subject founder Myers discussed with the prominent outlet for the pagan community, Witches & Pagans Magazine.\n\nOn April 27, 2018, Icarus Witch announced their new vocalist, Andrew D'Cagna (Ironflame / Brimstone Coven / Dofka), as well as a new album, ''Goodbye Cruel World'', released on October 26, 2018 via Cleopatra Records. The first single \"Goodbye Cruel World\" was prepropduced and mixed by platinum producer, Neil Kernon (Queensryche, Dokken, Judas Priest). The album itself was engineered by Shane Mayer (Deathwhite) mixed by producer Mike Clink's go-to engineer, Brad Cox and mastered in Sweden by Eclipse mastermind Erik Mårtensson who has become a leader in the melodic rock world.\n\nA month prior to the album release for ''Goodbye Cruel World'', Decibel Magazine premiered the single \"Misfortune Teller\". The record garnered critical acclaim from multiple sources ranging from their hometown Pittsburgh Post-Gazette  to long-running Los Angeles outlet KNAC.com who wrote, \"Goodbye Cruel World is a straightforward traditional, but at the same time refreshingly modern heavy metal album, which will not only appeal to MAIDEN and PRIEST fans but also, thanks to its melodic richness and appealing arrangements, to AOR and melodic rock connoisseurs.\" The buzz from this record and Andrew D'Cagna's involvement reignited the band's European popularity which resulted in a return invite to Germany's Headbangers Open Air festival in 2022. Meanwhile, in 2021 Icarus Witch was named one of the three \"best metal bands to emerge out of Pennsylvania\" by Canada's longest running metal magazine, BraveWords.\n\nThe band released their sixth studio album, ''No Devil Lived On'', on October 27, 2023.",
  "last_revision_date": "2025-07-30T06:31:22Z",
  "genres": [
    547,
    839
  ]
}