{
  "name": "Ignacio Piñeiro",
  "description": "'''Ignacio Piñeiro Martínez''' (May 21, 1888 &ndash; March 12, 1969) was a Cuban musician, bandleader and composer whose career started in [[Cuban rumba|rumba]] and flowered in the rise of the [[Son cubano|son]]. He was one of the most important composers of son music; in total he wrote about 327 numbers, mostly sones.\n\nPiñeiro was a brilliant [[rumbero]] who worked with musical groups from 1903 onwards. In 1906, was a member of the Timbre de Oro ''[[coro de clave]] y [[guaguancó]]'' (a vocal group precursor of contemporary guaguancó), and later directed Los Roncos, another famous ''coro de guaguancó''. He was taught the [[double bass]] by [[María Teresa Vera]], and in 1926 he was a member of her band, [[Early Cuban bands#Sexteto Occidente|Sexteto Occidente]], which recorded in [[New York City]]. In 1927 he founded the [[Sexteto Nacional|Sexteto Nacional de Ignacio Piñeiro]], later simply known as Sexteto Nacional, in which he was the director and songwriter. With the addition of a trumpet the band became the [[Septeto Nacional]].\n\nFor financial reasons, Piñeiro quit the group in 1935; it was then led by trumpet player [[Lázaro Herrera]] until the group disbanded in 1937. Piñeiro became for some years the leader and principal songwriter of Los Roncos. The Septeto Nacional was recreated several times from 1954 onwards, initially under Piñeiro's direction, and it continues to perform.\n\nPiñeiro's composition \"Échale salsita\", written on a train to Chicago in 1930, influenced [[George Gershwin]]'s ''[[Cuban Overture]]''. The two met when Gershwin visited Cuba in February 1932. Many of Piñeiro's songs have been performed by other artists like [[Ray Barretto]] (\"Don Lengua\") and [[René Álvarez]] (\"A la lae la la\"). In 1999, Piñeiro was posthumously inducted into the [[International Latin Music Hall of Fame]].",
  "last_revision_date": "2025-04-29T13:37:10Z",
  "genres": [
    15,
    305,
    521,
    1132
  ]
}