{
  "name": "Ilaiyaraaja",
  "description": "'''Ilaiyaraaja''' (born '''R.Gnanathesigan''') is an Indian musician, composer, arranger, conductor, orchestrator, multi-instrumentalist, lyricist and [[playback singer]] popular for his works in [[Indian cinema]], predominantly in [[Tamil cinema|Tamil]] in addition to [[Telugu cinema|Telugu]], [[Malayalam Cinema|Malayalam]], [[Kannada cinema|Kannada]] and [[Hindi cinema|Hindi]] films. Regarded as one of the most prolific composers, in a career spanning over forty-nine years, he has composed over 8,600 songs, provided film scores for about 1,523 feature films in nine languages, and performed in over 20,000 concerts. He is nicknamed \"Isaignani\" (the musical sage) and is often referred to as \"[[Maestro]]\", the title conferred to him by the [[Royal Philharmonic Orchestra]], [[London]].\n\nIlaiyaraaja was one of the first Indian film composers to use [[Western classical music]] harmonies and string arrangements in Indian film music, and is the first Indian, as well as Asian to compose, record, and perform live a full Western classical [[symphony]]. In 1986, he became the first Indian composer to record a soundtrack with computer for the film ''[[Vikram (1986 Tamil film)|Vikram]]''. He also composed and orchestrated ''[[Thiruvasakam in Symphony|Thiruvasagam in Symphony]]'' (2006) - the first Indian [[oratorio]].\n\nIn 2013, when [[CNN-IBN]] conducted a poll to commemorate 100 years of [[Indian cinema]], he secured 49% of the vote and was adjudged the country's greatest music composer. In 2014, the American world cinema portal \"Taste of Cinema\" placed him at 9th position in its list of 25 greatest film composers in the history of cinema. He is the only Indian on the list, appearing alongside [[Ennio Morricone]], [[John Williams]], and [[Jerry Goldsmith]].\n\nIlaiyaraaja received [[List of awards and nominations received by Ilaiyaraaja|several awards]] for his works throughout his career. In 2012, for his creative and experimental works in the field of music, he received the [[Sangeet Natak Akademi Award]], the highest Indian recognition given to people in the field of [[performing arts]]. In 2010 he was awarded the [[Padma Bhushan]], the third-highest civilian honour in India, and in 2018 the [[Padma Vibhushan]], the second-highest civilian award by the [[government of India]]. He is a nominated [[Member of Parliament, Rajya Sabha|Member of Parliament]] in the Indian upper house [[Rajya Sabha]] since July 2022. A biographical film about his life titled \"Ilaiyaraaja\" was announced on 20 March 2024.",
  "last_revision_date": "2025-12-17T18:34:48Z",
  "genres": [
    630,
    1300
  ]
}