{
  "page_title": "In This Moment",
  "description": "'''In This Moment''' is an American [[Rock music|rock]] band from [[Los Angeles]], California, formed by singer [[Maria Brink]] and guitarist Chris Howorth in 2005. They found drummer Jeff Fabb and started the band as Dying Star. Unhappy with their musical direction, they changed their name to In This Moment and gained two band members, guitarist Blake Bunzel and bassist Josh Newell. In 2005, bassist Newell left the band and was replaced by Jesse Landry.\n\nTheir debut album, ''[[Beautiful Tragedy]]'', was released in 2007. Their follow up, titled ''[[The Dream (In This Moment album)|The Dream]]'' was released the following year debuting at number 73 on the [[Billboard 200|''Billboard'' 200]]. The band's third album, ''[[A Star-Crossed Wasteland]]'' was released in 2010, and their fourth album titled ''[[Blood (In This Moment album)|Blood]]'' was released in August 2012 and debuted at number 15. Their fifth album titled ''[[Black Widow (In This Moment album)|Black Widow]]'' was released in November 2014 and debuted at number 8, their highest position in the charts to date. ''[[Ritual (In This Moment album)|Ritual]]'', their sixth, was released in the summer of 2017 and debuted at number 23. Their seventh studio album, ''[[Mother (In This Moment album)|Mother]]'' was released on March 27, 2020. Their eighth album titled ''[[Godmode]]'' was released on October 27, 2023. They have received two nominations of Alternative Press Music Awards, including two for Best Hard Rock Artist and one for Best Live Band. They have also received a Grammy nomination for Best Metal Performance. To date, the band has 5 singles and an album certified Platinum and Gold by the [[Recording Industry Association of America]] (RIAA).\n\nThe band's line-up has changed several times. Landry was replaced by Kyle Konkiel in 2009 and Konkiel was replaced by Travis Johnson in 2010. Jeff Fabb and Blake Bunzel left the band in 2011, and were replaced by Tom Hane and Randy Weitzel respectively. In March 2016, drummer Tom Hane announced his departure from the band and was replaced by Kent Diimmel, formerly of 3 By Design.\n\nThroughout their career, the band has performed on several notable tours and festivals including [[Ozzfest]] in 2007 and 2008; [[Warped Tour]] in 2009; [[Download Festival]] in 2009, 2013, and 2018; [[Mayhem Festival]] in 2010; [[Music as a Weapon]] V tour in 2011; [[Uproar Festival]] in 2012; [[Rock on the Range]] in 2012, 2013, and 2015; [[Carnival of Madness]] tour in 2013; [[Knotfest]] in 2014; [[Rockfest]] and [[Rocklahoma]] in 2015; [[Carolina Rebellion]] in 2018; [[Louder Than Life]] in 2017 and 2019; [[Aftershock Festival#Aftershock 2014|Aftershock]] in 2014, 2017, and 2021; [[Welcome to Rockville]] in 2013, 2015, 2017, and 2019; and [[Knotfest]] in 2022.",
  "last_revision_date": "2025-06-10T16:17:53Z"
}