{
  "name": "Innoss'B",
  "description": "'''Innocent Didace Balume''' (born 5 May 1997), known professionally as '''Innoss'B''', is a Congolese singer-songwriter, rapper, percussionist, dancer, and philanthropist. Often referred to as the \"'''Jeune Leader'''\", he is known for pioneering the AfroCongo music genre, an eclectic fusion of [[Congolese rumba]], [[Music of the Democratic Republic of the Congo#Traditional music and instruments|indigenous folklore]], and [[ndombolo]].\n\nInnoss'B was born into a musical family in war-ravaged [[Goma]], [[North Kivu]], and grew up in the Birere area near [[Gisenyi]], Rwanda. At the age of six, he began his music career as a member of the family group Maisha Soul. The group gained recognition after winning the 2007 Revelation Award at the Goma Tourism Fair. He later ventured out as a solo artist after winning the [[Akon]]-sponsored 2010 Vodacom Superstar contest, which led to his collaboration with Akon on the international song \"Up and Away\". On 17 July 2013, he released his debut studio album, ''Innocent Vol.1''. In October 2015, Innoss'B made a name for himself in [[Kinshasa]] with his collaborations with [[Werrason]] on a hit single \"Eloko\" and later with [[Koffi Olomide|Koffi Olomidé]] on \"Elengi\" in October 2016. On 29 June 2017, he released his five-track [[Maxi single|maxi-single]], ''Plus''. The lead track, \"Ozo Beta Mabe\", became an instant hit in Africa with over one million views on [[YouTube]] in just five months, making Innoss'B one of the most successful young Congolese and African artists.\n\nThe [[BBC]] tipped him as one of the African stars with the potential for global success in 2020, praising his unique style that has him \"dancing to the beat of his drum\" and bringing a \"modern and youthful sound\" to Congolese music. That year, Innoss'B became the first Congolese musician to reach more than 100 million views on [[YouTube]] for his \"Yo Pe\" remix, featuring [[Tanzania]]n singer [[Diamond Platnumz]]. On 26 December 2021, Innoss'B released his second studio album, ''Mortal 06''. On 29 March 2024, Innoss'B released his five-track [[Extended play|Extended Play]] (EP) ''Calcul''. In July 2025, Innoss'B was ranked tenth on ''[[Billboard (magazine)|Billboard]]'' France's chart of the most-streamed Congolese artists in France, limited to those who began their careers in either the DRC or the [[Republic of the Congo]].",
  "last_revision_date": "2026-01-23T01:37:52Z",
  "genres": [
    279,
    564,
    821
  ]
}