{
  "name": "Iron Maiden",
  "description": "'''Iron Maiden''' are an English [[Heavy metal music|heavy metal]] band formed in [[Leyton]], [[East London]], in 1975 by bassist and primary songwriter [[Steve Harris (musician)|Steve Harris]]. Although fluid in the early years of the band, the line-up for most of the band's history has consisted of Harris, lead vocalist [[Bruce Dickinson]], drummer [[Nicko McBrain]], and guitarists [[Dave Murray (musician)|Dave Murray]], [[Adrian Smith (musician)|Adrian Smith]] and [[Janick Gers]]. As pioneers of the [[new wave of British heavy metal]] movement, Iron Maiden released a series of UK and US Platinum and Gold albums, including 1980's [[Iron Maiden (album)|debut album]], 1981's ''[[Killers (Iron Maiden album)|Killers]]'', and 1982's ''[[The Number of the Beast (album)|The Number of the Beast]]'' – its first album with Dickinson, who in 1981 replaced [[Paul Di'Anno]] as lead singer. The addition of Dickinson was a turning point in their career, establishing them as one of heavy metal's most important bands. ''The Number of the Beast'' is among the most popular heavy metal albums of all time, having sold almost 20 million copies worldwide.\n\nAfter some turbulence in the 1990s, the return of lead vocalist [[Bruce Dickinson]] and guitarist Adrian Smith in 1999 saw the band undergo a resurgence in popularity, with a series of new albums and highly successful tours. Their three most recent albums — ''[[The Final Frontier]]'' (2010), ''[[The Book of Souls]]'' (2015), and ''[[Senjutsu (album)|Senjutsu]]'' (2021) — have all reached number&nbsp;1 in more than 25 countries. Iron Maiden have sold over 130&nbsp;million copies of their albums worldwide and have obtained over&nbsp;600 [[music recording certification|certifications]]. The band is considered to be one of the most influential and revered heavy metal bands of all time. They have received multiple industry awards, including the [[Grammy Awards|Grammy]] and [[Brit Awards]].\n\nThe band have released 41 albums, including 17 studio albums, 13 live albums, four [[Extended play|EPs]] and seven [[compilation album|compilations]]. They have also released 47 singles and 20 video albums, and two video games. Iron Maiden's lyrics cover such topics as history, literature, war, mythology, dark fantasy, science fiction, society and religion. {{as of|2019|October|}}, the band have played [[List of Iron Maiden concert tours|2,500 live shows]]. For over 40&nbsp;years the band have featured their signature mascot, \"[[Eddie (Iron Maiden)|Eddie]]\", on the covers of almost all of their releases.",
  "last_revision_date": "2025-06-18T16:32:40Z",
  "genres": [
    542
  ]
}