{
  "name": "Isaac Hayes",
  "description": "'''Isaac Lee Hayes Jr.''' (August 20, 1942 – August 10, 2008) was an American singer, songwriter, composer, and actor. He was one of the creative forces behind the [[Southern soul]] music label [[Stax Records]] in the 1960s, serving as an in-house songwriter with his partner [[David Porter (musician)|David Porter]], \nas well as a session musician and record producer. Hayes and Porter were inducted into the [[Songwriters Hall of Fame]] in 2005 in recognition of writing scores of songs for themselves, the duo [[Sam & Dave]], [[Carla Thomas]], and others. In 2002, Hayes was inducted into the [[Rock and Roll Hall of Fame]].\n\nDuring the late 1960s, Hayes also began a career as a recording artist. He released several successful soul albums such as ''[[Hot Buttered Soul]]'' (1969) and ''[[Black Moses (album)|Black Moses]]'' (1971). In addition to his work in [[popular music]], Hayes worked as a [[film score composer|film composer]].\n\nHayes wrote the musical score for the film ''[[Shaft (1971 film)|Shaft]]'' (1971). For the \"[[Theme from Shaft|Theme from ''Shaft'']],\" he was awarded the [[Academy Award for Best Original Song]] in 1972, making him the third black person, after [[Hattie McDaniel]] and [[Sidney Poitier]], to win an [[Academy Awards|Academy Award]] in any competitive field covered by the [[Academy of Motion Picture Arts and Sciences]]. Hayes also won two [[Grammy Award]]s that same year. Later, he won his third Grammy for his album ''Black Moses''.\n\nIn 1992, Hayes was crowned honorary king of the [[Ada, Ghana|Ada]] region of Ghana in recognition of his humanitarian work there. He acted in films and television, such as in the movies ''[[Truck Turner]]'' (1974), ''[[Escape from New York]]'' (1981) and ''[[I'm Gonna Git You Sucka]]'' (1988), and as Gandolf \"Gandy\" Fitch in the TV series ''[[The Rockford Files]]'' (1974–1980). Hayes also voiced the character [[Chef (South Park)|Chef]] in the [[Comedy Central]] animated series ''[[South Park]]'' from its debut in 1997 until his controversial departure in 2006.\n\nOn August 5, 2003, Hayes was honored as a [[Broadcast Music Incorporated|BMI]] Icon at the 2003 BMI Urban Awards for his enduring influence on generations of musicians. Throughout his songwriting career, Hayes received five BMI R&B Awards, two BMI Pop Awards, two BMI Urban Awards and six Million-Air citations. As of 2008, his songs had generated more than 12 million performances.{{clarify|reason=Unclear whether this refers to sales, digital streams, or physical performances of his songs|date=October 2024}}",
  "last_revision_date": "2025-12-17T19:32:22Z",
  "genres": [
    353,
    461,
    977,
    987
  ]
}