{
  "name": "Jack White",
  "description": "'''John Anthony White''' ({{né|'''Gillis'''}}; born July 9, 1975) is an American musician who achieved international fame as the guitarist and lead singer of the rock duo [[the White Stripes]]. As the White Stripes disbanded, he sought success with his solo career, subsequent collaborations, and business ventures.\n\nAfter moonlighting in several underground Detroit bands as a drummer and guitarist, White founded the White Stripes with fellow Detroit native and then-wife [[Meg White]] in 1997. Their 2001 breakthrough album, ''[[White Blood Cells (album)|White Blood Cells]]'', brought them international fame with the single and accompanying music video for \"[[Fell in Love with a Girl]]\". White subsequently began collaborating with artists such as [[Loretta Lynn]] and [[Bob Dylan]]. In 2005, White founded [[the Raconteurs]] with [[Brendan Benson]]; in 2009, White founded [[the Dead Weather]] with [[Alison Mosshart]] of [[the Kills]]. In 2008, he recorded \"[[Another Way to Die]]\", the title song for the 2008 [[James Bond]] film ''[[Quantum of Solace]]'', alongside [[Alicia Keys]], making them the only duet to perform a Bond theme.\n\nAs a solo artist, White has released six [[Jack White discography#Studio albums|solo studio albums]], which have garnered critical and commercial success. He is a board member of the [[Library of Congress]]' [[National Recording Preservation Foundation]]. His record label and studio [[Third Man Records]] releases [[vinyl recording]]s of his own work as well as that of other artists and local school children. His second studio album, ''[[Lazaretto (album)|Lazaretto]]'' (2014), broke the record for most first-week vinyl sales since 1991, holding that record until 2021. White has an extensive collection of guitars and other instruments and has a preference for vintage items that often have connections to famous [[blues]] artists. He is a vocal advocate for analog technology and recording techniques.\n\nA key artist of the 2000s [[garage rock revival]], White is known for his distinctive musical techniques and eccentricity. He has won 12 [[Grammy Award]]s among [[List of awards and nominations received by Jack White|other accolades]]. ''[[Rolling Stone]]'' included him on their 2010 and 2023 lists of the greatest guitarists of all time. ''[[The New York Times]]'' called White \"the coolest, weirdest, [and] savviest rock star of our time\" in 2012. He will be [[List of Rock and Roll Hall of Fame inductees|inducted]] into the [[Rock and Roll Hall of Fame]] in 2025 as a member of the White Stripes.",
  "last_revision_date": "2025-07-19T10:19:43Z",
  "genres": [
    138,
    287,
    418,
    936,
    40
  ]
}