{
  "name": "Jacky Cheung",
  "description": "'''Jacky Cheung Hok-yau''' (born 10 July 1961) is a Hong Kong singer and actor. One of the most influential artists in the [[Greater China]] region, Cheung is widely regarded as a [[Four Heavenly Kings (Hong Kong)|Heavenly King]] of [[Cantopop|Cantopop music]] and an icon of [[Hong Kong popular culture]]. He is often dubbed as the \"[[Honorific nicknames in popular music|God of Songs]]\" for his vocal delivery and live performances.\n\nCheung debuted in 1985 with his first studio album ''Smile'', which sold over 300,000 copies in Hong Kong. His sophomore album ''Amour'' (1986) recorded sales of over 400,000 copies in the territory, which earned a multi-platinum certification from the [[International Federation of the Phonographic Industry|IFPI]] Hong Kong. After experiencing a period of declining sales in the late 1980s, his album [[The Goodbye Kiss (album)|''The Goodbye Kiss'']] (1993) sold over 4,000,000 copies and became one of the best-selling albums in multiple countries in Asia. In 1995, his albums sales exceeded 5,000,000 copies, making him the second highest-selling artist in the world that year, behind Michael Jackson. \n\nCheung has embarked on [[List of Jacky Cheung live performances|ten concert tours]] during his 40-year career, with the [[Jacky Cheung 1/2 Century Tour|1/2 Century World Tour]] (2010–2012) setting a [[Guinness World Records|Guinness World Record]] for the largest combined audience for a live act in twelve months, with 2,048,553 audience members in 2012. His [[A Classic Tour]] (2016–2019) became one of the [[List of most-attended concert tours|most-attended concert tours of all time]], drawing over 4.5 million people. As an actor, Cheung has appeared in over 70 films, including starring roles in ''[[Devoted to You (film)|Devoted to You]]'' (1986), ''[[Where's Officer Tuba?]]'' (1986)'','' ''[[As Tears Go By (film)|As Tears Go By]]'' (1988), and ''[[The Swordsman (1990 film)|The Swordsman]]'' (1990).\n\nCheung is the [[List of best-selling albums in Taiwan|best-selling music artist of all time in Taiwan]] and Hong Kong, and has sold over 60 million albums worldwide. Three of his albums have sold over 1 million copies in Taiwan—the most out of any artist, while sixteen of his albums became platinum certified by the IFPI Hong Kong. His various accolades include the [[Billboard Music Awards|''Billboard'' Music Award]] for Most Popular Asian Singer in 1994, and the [[World Music Awards|World Music Award]] for the World's Best-Selling Asian Artist in 1996. In 1999, Cheung was honored by [[Junior Chamber International]] as one of the Ten Outstanding Young People in the World. In 2000, he was inducted into the Superstars Hall of Fame of the 1990s by [[Universal Music Group|Universal Music]].",
  "last_revision_date": "2025-10-10T08:27:46Z",
  "genres": [
    10,
    205,
    625,
    727,
    881,
    1035
  ]
}