{
  "name": "Jane Zhang",
  "description": "'''Jane Zhang''' ({{lang-zh|c=张靓颖|p=Zhāng Liàngyǐng}}; born October 11, 1984) is a Chinese singer, songwriter and record producer. She is known for her signature use of the [[whistle register]] and has been dubbed the \"[[Honorific nicknames in popular music|Dolphin Princess]]\" ({{lang|zh-hans|海豚公主}}). Zhang began performing as a teenager by singing in pubs to help earn money for her family. After signing with [[Huayi Brothers|Huayi Brothers Media Corporation]] in 2005, Zhang released her first studio album, ''[[The One (Jane Zhang album)|The One]]'' (2006). Her second album, [[Update (Jane Zhang album)|''Update'']], was released in 2007. Zhang's third studio album, ''[[Jane@Music]]'', was released in 2009. Her fourth studio album, ''[[Believe in Jane]]'', was released in 2010. In 2011, Zhang released her fifth studio album, ''[[Reform (album)|Reform]]'', which was certified double platinum by the [[International Federation of the Phonographic Industry]] (IFPI).\n\nJane performed in the 2017 Victoria's Secret Show and was featured in the Oprah Winfrey Show. Her single \"Dust My Shoulders Off\" topped iTunes 4th and 1st in music video. She was invited and attended the Grammy twice. She was the judge for the Montreal international film festival. She has 40 million followers on [[Weibo]] and won 7 times of China best female artist. Zhang released her first English-language studio album [[Past Progressive (album)|''Past Progressive'']] in 2019.\n\nZhang has received numerous awards, including nine [[Beijing Pop Music Awards]] for Best Female Singer, two China Gold Record Awards, and a [[MTV Europe Music Award]]. She has been included in the annual ''Forbes'' China celebrity lists from 2006 to 2013. In 2016, the Chengdu government estimated her annual output value at ¥1.1 billion ($160 million).",
  "last_revision_date": "2025-04-28T22:40:09Z",
  "genres": [
    400,
    274,
    1275,
    616,
    1262,
    912,
    312
  ]
}