{
  "name": "Jane's Addiction",
  "description": "'''Jane's Addiction''' was an American [[Rock music|rock]] band formed in Los Angeles in 1985. The band's best known line-up consisted of lead vocalist [[Perry Farrell]], bassist [[Eric Avery]], drummer [[Stephen Perkins]] and guitarist [[Dave Navarro]]. Jane's Addiction was one of the first bands from the early 1990s [[alternative rock]] movement to gain commercial success.  \n\nFounded by Farrell and Avery following the disintegration of Farrell's previous band [[Psi Com]], Jane's Addiction's first release was [[Jane's Addiction (album)|their self-titled live album]] in 1987, which caught the attention of [[Warner Bros. Records]]. Their first two studio albums, ''[[Nothing's Shocking]]'' (1988) and ''[[Ritual de lo Habitual]]'' (1990), received acclaim and grew a [[cult following|cult fanbase]]. As a result, Jane's Addiction became a significant part of what Farrell dubbed the \"[[alternative rock|alternative]] nation'\" The band's first farewell tour in 1991 launched the first [[Lollapalooza]].\n\nIn 1997, Jane's Addiction reunited, with [[Flea (musician)|Flea]] of the [[Red Hot Chili Peppers]] replacing Avery for a one-off tour. In 2001, a second reunion took place, with [[Martyn LeNoble]] and later [[Chris Chaney]] on bass. In 2003, Jane's Addiction released their third studio album, ''[[Strays (Jane's Addiction album)|Strays]]'', before dissolving the following year. In 2008, the original lineup reunited and embarked on a world tour. Avery left acrimoniously in early 2010 as they began working on new material. In 2011, they released their fourth studio album, ''[[The Great Escape Artist]]'', with Chaney returning for its recording and tour. For the next ten years, the band toured and performed intermittently.\n\nIn 2022, Avery rejoined Jane's Addiction after a 12-year absence. Due to [[long COVID]], Navarro was replaced by [[Queens of the Stone Age]] guitarist [[Troy Van Leeuwen]] and former Red Hot Chili Peppers guitarist [[Josh Klinghoffer]] on tours in 2022 and 2023. In 2024, a reunion tour with Navarro was cancelled after Farrell shoved and punched him on-stage during a concert on September 13, 2024 in Boston, Massachusetts. In January 2025, Navarro, Avery and Perkins announced they were working on new music without the involvement of Farrell, with Navarro later confirming that the band would not continue.",
  "last_revision_date": "2025-10-03T03:58:51Z",
  "genres": [
    39,
    42,
    461,
    976
  ]
}