{
  "name": "Jean Shepard",
  "description": "'''Ollie Imogene''' \"'''Jean'''\" '''Shepard''' (November 21, 1933 – September 25, 2016), was an American [[Country music|country]] singer who was considered one of the genre's first significant female artists. Her commercial success ran from the 1950s to the 1970s while also being a member of the [[Grand Ole Opry]] for 60 years.\n\nShepard was born in Oklahoma and raised in California with her nine siblings. Having a musical upbringing, she formed an all-female country-music band, The Melody Ranch Girls. She was heard by country artist [[Hank Thompson (musician)|Hank Thompson]], who helped her get her first recording contract at age 18 with [[Capitol Records]]. Her second single, \"[[A Dear John Letter]]\" with [[Ferlin Husky]], topped the country charts in 1953. In 1955, she had her first solo single top-10 successes with \"[[A Satisfied Mind]]\", \"[[I Thought of You]]\", and \"[[Beautiful Lies (Jean Shepard song)|Beautiful Lies]]\". During this period she was among the first female country performers to headline shows and consistently be played on country music radio.\n\nIn 1963, Shepard's husband [[Hawkshaw Hawkins]] was killed in a [[1963 Camden PA-24 crash|plane crash]]. She considered ending her career, then returned and in 1964 had her first top-10 single in nine years, \"[[Second Fiddle (To an Old Guitar)]]\". She had 15 more top-40 US country singles during the decade, including the top-10 recordings \"[[If Teardrops Were Silver]]\", \"[[I'll Take the Dog]]\", and \"[[Then He Touched Me]]\". With a dip in commercial success, Shepard became frustrated with Capitol's lack of promotion to her material and moved to [[United Artists Records]]. In 1973 at age 40 she had a comeback with the top-10 song \"[[Slippin' Away (Jean Shepard song)|Slippin' Away]]\". Four more of her singles reached the US country top 20 during the 1970s.\n\nShepard became part of the Association of Country Entertainers (ACE) in the 1970s, which advocated for traditional country music. Her criticism of the genre's [[country pop]] trends ultimately cost Shepard her recording contract from United Artists. Ultimately, the ACE disbanded and Shepard filed for bankruptcy. Shepard continued touring and became popular in Europe, especially in the UK. She continued sporadically recording as well, releasing her last studio album in 2000. She was inducted into the [[Country Music Hall of Fame and Museum]] in 2011 and continued performing through 2015. Her musical legacy influenced the future careers of [[Loretta Lynn]], [[Dolly Parton]] and [[Tammy Wynette]].",
  "last_revision_date": "2025-07-13T02:28:03Z",
  "genres": [
    87,
    290,
    798
  ]
}