{
  "page_title": "Jerry Garcia",
  "description": "'''Jerome John Garcia''' (August 1, 1942&nbsp;– August 9, 1995) was an American musician who was the lead guitarist and a vocalist with the rock band [[Grateful Dead]], which he co-founded and which came to prominence during the [[counterculture of the 1960s]]. Although he disavowed the role, Garcia was viewed by many as the leader of the band. He was inducted into the [[Rock and Roll Hall of Fame]] in 1994 as a member of the Grateful Dead.\n\nAs one of its founders, Garcia performed with the Grateful Dead for the band's entire 30-year career (1965–1995). Garcia also founded and participated in a variety of side projects, including the Saunders–Garcia Band (with longtime friend [[Merl Saunders]]), the [[Jerry Garcia Band]], [[Old & In the Way]], the Garcia/[[David Grisman|Grisman]] and Garcia/[[John Kahn|Kahn]] acoustic duos, [[Legion of Mary (band)|Legion of Mary]], and [[New Riders of the Purple Sage]] (which he co-founded with [[John Dawson (musician)|John Dawson]] and [[David Nelson (musician)|David Nelson]]). He also released several solo albums, and contributed to a number of albums by other artists over the years as a [[session musician]]. He was well known for his distinctive guitar playing, and was ranked 13th in ''[[Rolling Stone]]''{{'}}s \"100 Greatest Guitarists of All Time\" cover story in 2003. In the 2015 version of the list he was ranked at #46. In 2023, Garcia was ranked 34th by ''Rolling Stone''.\n\nGarcia was renowned for his musical and technical ability, particularly his ability to play a variety of instruments and sustain long improvisations. Garcia believed that improvisation took stress away from his playing and allowed him to make spur of the moment decisions that he would not have made intentionally. In a 1993 interview with ''Rolling Stone'', Garcia noted that \"my own preferences are for improvisation, for making it up as I go along. The idea of {{em|picking}}, of eliminating possibilities by deciding, that's difficult for me\". Originating from the days of the \"[[Acid Tests]]\", these improvisations were a form of exploration rather than playing a song already written.\n\nLater in life, Garcia struggled with [[diabetes]]. On July 10, 1986, he went into a [[diabetic coma]] and nearly died. Although his overall health improved somewhat after the incident, he continued to struggle with obesity, smoking, and long-standing heroin and [[cocaine]] addictions. He was staying in a California [[drug rehabilitation]] facility when he died of a heart attack in August 1995, just eight days after his 53rd birthday.",
  "last_revision_date": "2025-05-25T19:00:45Z"
}