{
  "name": "Jil Jilala",
  "description": "'''Jil Jilala''' ({{Langx|ar|جيل جلالة}} ''Generation of Majesty'') is a Moroccan musical group which rose to prominence in the 1970s among the movement created by [[Nass El Ghiwane]] and Lem Chaheb.  Jil Jilala was founded in Marrakech in 1972 by performing arts students Mohamed Derhem, Moulay Tahar Asbahani, Sakina Safadi, Mahmoud Essaadi, Hamid Zoughi and Moulay Abdelaziz Tahiri (who had just left Nass el Ghiwane). In 1974, they released their first record ''Lyam Tnadi'' on the Atlassiphone label. The songs \"Leklam Lemrassaa,\" \"Baba Maktoubi,\" \"Ha L'ar a Bouya,\" \"ah ya Jilala\" and \"Chamaa\" quickly achieved the status of popular 'classics.'{{Citation needed|date=January 2013}}\n\nIn 1976 they wrote the iconic bop \"Laayoune Ayniya\" about the [[Green March]]. The song was embraced as an unofficial 'national anthem' as Moroccans from all over the country marched en masse toward the disputed [[Western Sahara]], then occupied by Spain.{{Citation needed|date=January 2013}}\n\nIn contrast to [[Nass El Ghiwane]], who were primarily influenced by [[Gnawa music]], Jil Jilala took their inspiration from other forms of traditional Moroccan music like the [[Malhun]], sung in an antiquated form of [[Moroccan Arabic]], or the spiritual music of [[Jilala]], an historical [[sufi]] brotherhood that are named after the famous sufi master from Irak, Abdul Qādir Gīlānī (1078-1166), founder of the Qadiria Sufi Order, who is called Jilali in Moroccan tradition.. In addition to their intellectual, socio-political and economic goals, these groups aimed for a rejuvenation of traditional [[Moroccan music]].{{Citation needed|date=January 2013}}\n\nTheir musical activities in the 1980s were shaped by the gnaoui ''mu'allem'' Mustafa Bakbou and the formation of [[Tiq Maya]]. Some consider Bakbou (sometimes written \"Baqbou\") to be among the most important and prolific Gnawa musicians in Africa.{{Citation needed|date=January 2013}}  The group's line-up changes regularly. Both Sakina Safadi and Mustafa Bakbou left for short periods and then returned.  Moulay Abdelaziz Tahiri left for 10 years before making his return.  Shortly after Tahiri's return, Mohamed Derham, long the group's musical and professional core, dropped out; he now works in a communication agency.  Mustafa Bakbou who was taught by his father, Maâlem Ayachi Bakbou and his older brother, Ahmed Bakbou as well as the influential Casablanca maâlem, Maâlem Sam, has now  returned to his original work as a gnawa maâlem, and is among the most venerated from the Marrakech school of gnawa. He is one of the stars of the annual Festival Gnaoua et Musiques du Monde in Essaouira, where he is looked after for collaborations, using his experience in Jil Jilala.{{Citation needed|date=January 2013}}\n\nBeginning in 2006, Jil Jilala began collaborative recording and performance ventures with Uve Muellrich and [[Marlon Klein]] of Germany's [[Dissidenten]].",
  "last_revision_date": "2024-11-05T06:13:57Z",
  "genres": [
    493,
    455
  ]
}