{
  "description": "'''James Marshall''' \"'''Jimi'''\" '''Hendrix''' (born '''Johnny Allen Hendrix'''; November 27, 1942{{snd}}September 18, 1970) was an American singer-songwriter and musician. He is widely regarded as one of the greatest and most influential guitarists of all time. Inducted into the [[Rock and Roll Hall of Fame]] in 1992 as a part of his band, the Jimi Hendrix Experience, the institution describes him as \"arguably the greatest instrumentalist in the history of rock music.\"\n\nBorn in [[Seattle]], Washington, Hendrix began playing guitar at age 15. In 1961, he enlisted in the US Army, but was discharged the following year. Soon afterward, he moved to [[Clarksville, Tennessee|Clarksville]], then [[Nashville]], Tennessee, and began playing gigs on the [[Chitlin' Circuit]], earning a place in [[the Isley Brothers]]' backing band and later with [[Little Richard]], with whom he continued to work through mid-1965. He then played with [[Curtis Knight and the Squires]].\n\nHendrix moved to England in late 1966, after bassist [[Chas Chandler]] of [[the Animals]] became his manager. Within months, he had formed his band, the Jimi Hendrix Experience (with its rhythm section consisting of bassist [[Noel Redding]] and drummer [[Mitch Mitchell]]), and achieved three UK top ten hits: \"[[Hey Joe]]\", \"[[Purple Haze]]\", and \"[[The Wind Cries Mary]]\". He achieved fame in the US after his performance at the [[Monterey Pop Festival]] in 1967. His third and final studio album, ''[[Electric Ladyland]]'' (1968), became his most commercially successful release and his only number one album on the US [[Billboard 200|''Billboard'' 200]] chart. The world's highest-paid rock musician, Hendrix headlined the [[Woodstock Festival]] in 1969 and the [[Isle of Wight Festival 1970|Isle of Wight Festival]] in 1970. [[Death of Jimi Hendrix| He died]] in London from barbiturate-related [[asphyxia]] in September 1970, at the [[27 Club|age of 27]].\n\nHendrix was inspired by American [[rock and roll]] and [[electric blues]]. He favored [[overdriven]] amplifiers with high volume and [[Gain (electronics)|gain]], and was instrumental in popularizing the previously undesirable sounds caused by guitar amplifier [[Audio feedback|feedback]]. He was also one of the first guitarists to make extensive use of tone-altering [[effects unit]]s in mainstream rock, such as fuzz distortion, [[Octavia (effects pedal)|Octavia]], [[wah-wah pedal|wah-wah]], and [[Uni-Vibe]]. He was the first musician to use stereophonic [[Phaser (effect)|phasing]] effects in recordings. Holly George-Warren of ''[[Rolling Stone]]'' commented: \"Hendrix pioneered the use of the instrument as an electronic sound source. Players before him had experimented with feedback and distortion, but Hendrix turned those effects and others into a controlled, fluid vocabulary every bit as personal as the blues with which he began.\"{{sfn|George-Warren|2005|p=428}}",
  "last_revision_date": "2025-06-13T01:34:32Z"
}