{
  "name": "Jimmy Cliff",
  "description": "'''James Chambers''' (30 July 1944 – 24 November 2025), known professionally as '''Jimmy Cliff''', was a Jamaican [[ska]], [[rocksteady]], [[reggae]] and [[Soul music|soul]] musician. He was considered to be one of Jamaica's most celebrated musicians and was credited with helping to popularise reggae music internationally. At the time of his death, he was the 4th reggae musician to hold the [[Jamaican Order of Merit|Order of Merit]], the highest honour granted by the Jamaican government for achievements in the arts and sciences. He was also nominated seven times for the [[Grammy Awards]], winning twice.\n\nCliff starred in ''[[The Harder They Come]]'' (1972), the first major commercial film from Jamaica. The [[The Harder They Come (soundtrack)|soundtrack]] helped to make reggae widely known. He was known for such songs as \"[[Many Rivers to Cross]]\", \"If I Follow My Mind\", \"[[You Can Get It If You Really Want]]\", \"[[The Harder They Come (song)|The Harder They Come]]\", \"[[Reggae Night]]\", and his [[cover version|covers]] of [[Cat Stevens]]'s \"[[Wild World (song)|Wild World]]\", [[Johnny Nash]]'s \"[[I Can See Clearly Now]]\" (from the ''[[Cool Runnings]]'' soundtrack) and \"[[Hakuna Matata (song)|Hakuna Matata]]\". Cliff was one of five performers inducted into the [[Rock and Roll Hall of Fame]] in 2010. He was one of only two Jamaicans in the Hall of Fame, the other being [[Bob Marley]].\n\nJimmy Cliff made deliberate, multifaceted efforts to reach across cultural and racial lines and appeal to a mainstream audience. He pursued strategic record deals that gave him access to the primarily white UK market, covered well-known pop and rock songs such as Cat Stevens' \"Wild World\", which reached number eight on the UK Singles Chart in 1970, and placed his music in popular films including the 1988 hit ''Cocktail'', which featured his song \"Shelter of Your Love\". Through these efforts Cliff reached a broader global audience while remaining true to his reggae roots, and was widely credited with helping to popularize reggae worldwide.",
  "last_revision_date": "2026-01-27T17:44:53Z",
  "genres": [
    1044,
    1069,
    1132,
    1156
  ]
}