{
  "description": "'''José Íñigo Homer Lacambra Ayala''' (born June 1, 1956), professionally known as '''Joey Ayala''', is a Filipino singer, songwriter and former chairman of the music committee of the [[National Commission for Culture and the Arts]]. He is well known for his style of music that combines the sounds of [[Philippines|Filipino]] ethnic instruments with modern [[pop music]]. His public music life started when he released an album recorded in a makeshift studio in 1982 in [[Davao City]]. To date, he has released fourteen albums.\n\nSome of the Filipino ethnic instruments Ayala is known to use include the two-stringed ''[[Hegalong]]'' of the [[T'Boli]] people of [[Mindanao]], the ''[[Kubing]]'', the bamboo jaw harp found in various forms throughout the Philippines, and the 8-piece gong set, ''[[Kulintang]]'', the melodic gong-rack of the indigenous peoples of the southern regions of the country. He also uses modern instruments in his music, such as the [[electric guitar]], [[bass guitar]], synthesizer/sequencer and drums.\n\nThe name of his band \"Bagong Lumad\" literally means \"New Native\", a name and philosophy that was carried over into ''Bagong Lumad Artists Foundation, Inc.'' (www.blafi.org), now a \"UNDP Responsible Party\" working on ''SiningBayan'' (Social Artistry) capacity-building projects with the Civil Service Commission, the Department of Education, and other [[Government agency|GO]]s and [[NGO]]s in the Philippines. He served as the (2008–10) Chairman and Vice-Chairman (2011–13) of the National Committee on Music under the [[National Commission for Culture and the Arts]].\n\nIn 2013, Ayala entered the second [[Philippine Popular Music Festival]] as a composer and interpreter for the song, \"Papel\", where it vied as one of its twelve finalists. The song featured collaborations with rapper [[Gloc-9]] and guest vocals by Denise Barbacena. He previously participated in 2012 as an interpreter for the song \"Piso\" written by Kristofferson Melecio.\n\nIn 2014, Ayala was featured in the BBC Travel episode featuring the Philippines.",
  "last_revision_date": "2024-12-22T21:37:27Z"
}