{
  "description": "'''John Zorn''' (born September 2, 1953) is an American [[composer]], [[conducting|conductor]], [[saxophonist]], [[arrangement|arranger]] and [[record producer|producer]] who \"deliberately resists category\". His [[Avant-garde music|avant-garde]] and [[experimental music|experimental]] approaches to composition and improvisation are inclusive of [[jazz]], [[rock music|rock]], [[Jewish music]], [[Hardcore punk|hardcore]], [[Classical music|classical]], [[Contemporary classical music|contemporary]], [[Surf music|surf]], [[Heavy metal music|metal]], [[soundtrack]], [[Ambient music|ambient]], and [[world music]]. ''[[Rolling Stone]]'' noted that {{nowrap|\"[alt]hough}} Zorn has operated almost entirely outside the mainstream, he's gradually asserted himself as one of the most influential musicians of our time\".\n\nZorn engaged New York City's [[downtown music]] scene in the mid-1970s, collaborating with improvising artists and experimenting with compositional strategies and arrangements. Over the next decade he performed throughout Europe and Japan and recorded on [[Independent record label|independent]] US and European labels. He released ''[[The Big Gundown (album)|The Big Gundown]]'', reconstructing the [[spaghetti Western]], [[gangster film|gangster]] and [[war movie]] themes of [[Ennio Morricone]], a formative musical influence, to acclaim in 1986. ''[[Spillane (album)|Spillane]]'' and ''[[Naked City (album)|Naked City]]'' further demonstrated Zorn's ability to merge and blend musical styles in new and challenging formats.\n\nZorn spent significant time in Japan in the 1980s and early '90s returning to [[Lower East Side]] Manhattan to establish the [[Tzadik Records|Tzadik]] record label in 1995. Tzadik enabled Zorn to establish independence, maintain creative control, and ensure the availability of his growing catalog of recordings. He prolifically recorded and released new material for the label, issuing several new albums each year, along with recordings by many other artists.\n\nZorn performs on saxophone with his [[Naked City (band)|Naked City]], [[Painkiller (band)|Painkiller]], and [[Masada (band)|Masada]] bands. He also conducts ensembles such as Moonchild, Simulacrum, several Masada-related groups, and encourages musicians toward their own interpretations of his work. He has composed concert music for classical ensembles and orchestras, and produced music for opera, sound installations, film and documentary. Tours of Europe, Asia, and the Middle East have been extensive, usually at festivals with musicians and ensembles that perform his repertoire.",
  "last_revision_date": "2025-06-20T04:31:29Z"
}