{
  "name": "John Lydon",
  "description": "'''John Joseph Lydon''' ({{IPAc-en|ˈ|l|aɪ|d|ən}} {{respell|LY|dən}}; born 31 January 1956), also known by his former stage name '''Johnny Rotten''', is an English singer, songwriter, author, and [[television personality]]. He was the lead vocalist of the [[punk rock]] band the [[Sex Pistols]], which was active from 1975 to 1978, and again for various revivals during the 1990s and 2000s. He is also the lead vocalist of [[post-punk]] band [[Public Image Ltd]] (PiL), which he founded and fronted from 1978 until 1993, and again since 2009.\n\nLydon's outspoken personality, rebellious image and fashion style convinced Sex Pistols manager [[Malcolm McLaren]] to invite Lydon to join the group as its lead vocalist. With the Sex Pistols, he co-wrote singles including \"[[Anarchy in the U.K.]]\", \"[[God Save the Queen (Sex Pistols song)|God Save the Queen]]\", and \"[[Holidays in the Sun (song)|Holidays in the Sun]]\", the content of which precipitated what one commentator described as the \"last and greatest outbreak of pop-based [[moral pandemonium]]\" in Britain. The band scandalised much of the media, and Lydon was seen as a figurehead of the burgeoning punk movement. Due to their [[controversial]] lyrics and disrepute at the time, they are regarded as one of the most influential acts in the history of popular music.\n\nAfter the Sex Pistols disbanded in 1978, Lydon founded his own band, Public Image Ltd, which was far more experimental in nature and described in a 2005 review by ''[[NME]]'' as \"arguably the first [[post-rock]] group\". The band produced eight studio albums and a string of singles, including \"[[Public Image (song)|Public Image]]\", \"[[Death Disco]]\", and \"[[Rise (Public Image Ltd song)|Rise]]\", before they went on hiatus in 1993, reforming in 2009. In subsequent years, Lydon has hosted television series in the UK, US, and Belgium, in 2004 appeared on ''[[I'm a Celebrity...Get Me Out of Here! (British TV series)|I'm a Celebrity...Get Me Out of Here!]]'' in the UK, appeared in advertisements on UK television promoting [[Saputo Dairy UK|Country Life]], a brand of British butter, written two autobiographies, and produced solo musical work, such as the studio album ''[[Psycho's Path]]'' (1997). In 2005, he released a compilation album, ''[[The Best of British £1 Notes]]''.\n\nIn 2015, there was a revival of a 1980s movement to have Lydon [[Orders, decorations, and medals of the United Kingdom|knighted]] for his achievements with the Sex Pistols, although he declined an [[Order of the British Empire|MBE]] for services to music. ''[[Q (magazine)|Q]]'' magazine remarked that \"somehow he's assumed the status of [[national treasure]]\".",
  "last_revision_date": "2025-07-19T21:03:32Z",
  "genres": [
    365,
    73,
    827,
    935,
    418,
    975,
    36
  ]
}