{
  "name": "John Denver",
  "description": "'''Henry John Deutschendorf Jr.''' (December 31, 1943&nbsp;– October 12, 1997), known professionally as '''John Denver''', was an American [[Country music|country]] and [[Folk music|folk]] singer, songwriter, and actor. He was one of the most popular [[acoustic music|acoustic]] artists of the 1970s and one of the best selling artists in that decade. [[AllMusic]] has called Denver \"among the most beloved entertainers of his era\".\n\nDenver recorded and released approximately 300 songs, about 200 of which he wrote himself. He released 33 albums and singles that were certified Gold and Platinum in the U.S by the [[Recording Industry Association of America]] (RIAA), with estimated sales of more than 33 million units. He recorded and performed primarily with an acoustic guitar and sang about his joy in nature, disdain for city life, enthusiasm for music, and relationship trials. Denver's music appeared on a variety of charts, including country music, the [[Billboard Hot 100|''Billboard'' Hot 100]], and [[Adult contemporary music|adult contemporary]], earning 12 [[Music recording certification|gold]] and four [[Music recording certification|platinum]] albums with his signature songs \"[[Take Me Home, Country Roads]]\"; \"[[Poems, Prayers & Promises]]\"; \"[[Annie's Song]]\"; \"[[Rocky Mountain High]]\"; \"[[Calypso (John Denver song)|Calypso]]\"; \"[[Thank God I'm a Country Boy]]\"; and \"[[Sunshine on My Shoulders]]\".\n\nDenver appeared in several films and television specials during the 1970s and 1980s, including the 1977 hit ''[[Oh, God! (film)|Oh, God!]]'', in which he starred alongside [[George Burns]]. He continued to record into the 1990s, also focusing on environmental issues as well as lending vocal support to space exploration and testifying in front of [[United States Congress|Congress]] to protest [[censorship]] in music. Known for his love of Colorado, Denver lived in [[Aspen, Colorado|Aspen]] for much of his life. In 1974, Denver was named [[poet laureate]] of the state. The Colorado state legislature also adopted \"Rocky Mountain High\" as one of its two state songs in 2007, and [[West Virginia]] did the same for \"Take Me Home, Country Roads\" in 2014. An avid pilot, Denver died at the age of 53 in 1997, in a single-fatality crash while piloting a recently purchased light plane.",
  "last_revision_date": "2025-06-09T20:18:54Z",
  "genres": [
    1104,
    275,
    1253,
    435,
    287,
    912
  ]
}