{
  "name": "John Prine",
  "description": "'''John Edward Prine''' ({{IPAc-en|p|r|ai|n}}; October 10, 1946&nbsp;– April 7, 2020) was an American singer-songwriter of [[country folk|country-folk music]]. Widely cited as one of the most influential songwriters of his generation, Prine was known for his signature blend of humorous lyrics about love, life, and current events, often with elements of [[social commentary]] and [[satire]], as well as sweet songs and melancholy ballads. He was active as a composer, recording artist, live performer, and occasional actor from the early 1970s until his death.\n\nBorn and raised in [[Maywood, Illinois]], Prine learned to play the guitar at age 14. He attended classes at Chicago's [[Old Town School of Folk Music]]. After serving in [[West Germany]] with the [[U.S. Army]], he returned to Chicago in the late 1960s, where he worked as a mailman, writing and singing songs first as a hobby. Continuing studies at the Old Town School, he performed at a student hang-out, the nearby Fifth Peg. A laudatory review by [[Roger Ebert]] put Prine on the map. Singer-songwriter [[Kris Kristofferson]] heard Prine at [[Steve Goodman]]'s insistence, and Kristofferson invited Prine to be his opening act. Prine released his [[John Prine (album)|eponymous debut album]] in 1971. Featuring such songs as [[Paradise (John Prine song)|\"Paradise\"]], [[Sam Stone (song)|\"Sam Stone\"]] and \"[[Angel from Montgomery]]\", it has been hailed as one of the greatest albums of all time.\n\nThe acclaim Prine earned from his debut led to three more albums for [[Atlantic Records]]. ''[[Common Sense (John Prine album)|Common Sense]]'' (1975) was his first to chart on the Billboard U.S. Top 100. He then recorded three albums with [[Asylum Records]]. In 1981, he co-founded [[Oh Boy Records]], an independent label which released all of his music up until his death. His final album, 2018's ''[[The Tree of Forgiveness]]'', debuted at #5 on the [[Billboard 200]], his highest ranking on the charts.\n\nPrine struggled with health issues throughout his life, surviving cancer twice. He died in 2020 from complications caused by {{nowrap|[[COVID-19]]}}. Earlier the same year, he received the [[Grammy Lifetime Achievement Award]].",
  "last_revision_date": "2025-09-19T17:38:59Z",
  "genres": [
    52,
    278,
    957
  ]
}