{
  "name": "Johnny Hallyday",
  "description": "'''Jean-Philippe Léo Smet''' ({{IPA|fr|ʒɑ̃ filip leo smɛt}}; 15 June 1943 – 5 December 2017), better known by his stage name '''Johnny Hallyday''', was a French [[rock and roll]] and [[Pop music|pop]] singer and actor, credited with having brought rock and roll to France.\n\nDuring a career spanning 57 years, Hallyday released 79 albums and sold more than 110 million records worldwide, mainly in the French-speaking world, making him one of the [[List of the best-selling music artists|best-selling artists in the world]]. He had five [[diamond album]]s, 40 [[Music recording sales certification|gold albums]], 22 [[platinum album]]s and earned ten ''[[Victoires de la Musique]]''. He sang an estimated 1,154 songs and performed 540 duets with 187 artists. Credited for his strong voice and his spectacular shows, he sometimes arrived by entering a stadium through the crowd and once by jumping from a helicopter above the [[Stade de France]], where he performed nine times. Among his 3,257 shows completed in 187 tours, the most memorable were at [[Parc des Princes]] in 1993, at the [[Stade de France]] in 1998, just after France's win in the [[1998 FIFA World Cup]], as well as at the [[Eiffel Tower]] in 2000, which had record-breaking ticket sales for a French artist.{{citation needed|date=January 2019}} A million spectators gathered to see his performance at the Eiffel Tower, with some 10 million watching on television.\n\nUsually working with the best French artists and musicians of his time, Hallyday collaborated with [[Charles Aznavour]], [[Michel Berger]] and [[Jean-Jacques Goldman]]. Hugely popular in France, he was referred to as simply \"Johnny\" and seen as a \"national monument\" and a part of the [[French culture|French cultural legacy]]. He became a symbol of the ''[[Trente Glorieuses]]'', France's prosperous postwar era, after he emerged in 1960, and was a familiar figure to four generations. More than 2,500 magazine covers and 190 books were dedicated to him during his lifetime, making him one of the people most widely covered by the media in France. His death from cancer in 2017 was followed by a \"people's tribute\", during which a million people attended the funeral procession in Paris and 15&nbsp;million others watched the ceremony on TV. Hallyday remained relatively unknown outside the French-speaking world, where he was dubbed \"the biggest rock star you've never heard of\" and introduced as the French version of [[Elvis Presley]].",
  "last_revision_date": "2026-01-31T18:30:05Z",
  "genres": [
    950,
    1060,
    1322
  ]
}