{
  "name": "Joy Division",
  "description": "'''Joy Division''' were  an English [[Rock music|rock]] band formed in [[Salford]] in 1976. The group consisted of vocalist, guitarist and lyricist [[Ian Curtis]], guitarist and keyboardist [[Bernard Sumner]], bassist [[Peter Hook]] and drummer [[Stephen Morris (musician)|Stephen Morris]].\n\nSumner and Hook formed the band after attending a [[Sex Pistols at the Lesser Free Trade Hall|June 1976]] [[Sex Pistols]] concert. While Joy Division's first recordings were heavily influenced by early [[punk rock]], they soon developed a sparse sound and style that made them one of the pioneering groups of the&nbsp;[[post-punk]] genre. Their self-released 1978 debut EP ''[[An Ideal for Living]]'' drew the attention of the Manchester television personality [[Tony Wilson]], who signed them to his independent label [[Factory Records]]. Their debut album ''[[Unknown Pleasures]]'', recorded with producer [[Martin Hannett]], was released in 1979.\n\nCurtis struggled with personal problems, including a failing marriage, [[Major depressive disorder|depression]], and [[epilepsy]]. As the band's popularity grew, Curtis's health condition made it increasingly difficult for him to perform; he occasionally experienced [[generalised tonic-clonic seizure|seizure]]s on stage. He died by suicide on the eve of what would have been the band's first North American tour in May 1980, aged 23. Joy Division's second and final album, ''[[Closer (Joy Division album)|Closer]]'', was released two months later; it and the single \"[[Love Will Tear Us Apart]]\" became their highest-charting releases.\n\nBetween July and October 1980, the remaining members, with the addition of keyboardist and guitarist [[Gillian Gilbert]], regrouped under the name [[New Order (band)|New Order]]. They were successful throughout the next decade, blending post-punk with [[electronic music|electronic]] and [[dance music]] influences. Joy Division would remain a prominent influence on subsequent generations of [[alternative music|alternative]] acts, particularly within the [[gothic rock]] genre.",
  "last_revision_date": "2026-01-23T08:23:42Z",
  "genres": [
    518,
    853,
    969
  ]
}