{
  "name": "Juanes",
  "description": "'''Juan Esteban Aristizábal Vásquez''' (born 9 August 1972), known professionally as '''Juanes''' ({{IPA|es|ˈxwanes}}), is a Colombian musician and singer, a former member of the [[Rock music|rock]] band [[Ekhymosis]]. Since releasing his solo debut album ''[[Fíjate Bien]]'' in 2000, Juanes has won 26 [[Latin Grammy Awards]] and sold more than 15 million records worldwide, making him one of the [[List of best-selling Latin music artists|best-selling Latin music artists of all time]].\n\nBorn and raised in Colombia, Juanes began playing piano at age two. When Juanes was 17, he started his first band, Ekhymosis, in 1988, which went on to release eight albums, achieving recognition in his native Colombia. The track \"Solo\" from the album ''Niño Gigante'' in 1992 was very popular. In 1997 after the band broke up, Juanes continued solo and in 2000 he released the album ''Fíjate Bien'' which earned him three Latin Grammys. His follow-up album, ''[[Un Día Normal]]'', was released in 2002 and was later certified platinum throughout America. Juanes' third album, ''[[Mi Sangre]]'' (2004), became an international bestseller, managing to position well in a number of countries around the world. It achieved success due to the single \"[[La Camisa Negra]]\".\n\nHe has since released ''[[La Vida... Es Un Ratico]]'' (2007), ''[[P.A.R.C.E.]]'' (2010), ''[[Loco de Amor (album)|Loco de Amor]]'' (2015), ''[[Mis planes son amarte]]'' (2017), ''[[Más Futuro Que Pasado]]'' (2019), [[Origen (Juanes album)|''Origen'']] (2021), and ''[[Vida Cotidiana]]'' (2023).\n\nJuanes has won 26 [[Latin Grammy Awards]] and three [[Grammy Awards]]. He received the [[Broadcast Music, Inc.|BMI]] President's Award at the 2010 BMI Latin Awards. Juanes is also known for his humanitarian work, especially with aid for Colombian victims of [[anti-personnel mine]]s through his NGO Fundacion Mi Sangre. In April 2013, Juanes released an autobiography titled ''Chasing The Sun'' in which he tells his story through narratives and pictures. He is\none of the best-selling Spanish-language artists.",
  "last_revision_date": "2025-11-10T23:21:19Z",
  "genres": [
    533,
    548,
    695,
    696,
    1216
  ]
}