{
  "description": "'''Juan Mario De la Espriella''' better known as '''Juancho De la Espriella''' (born 26 February  1973, [[Sincelejo]], [[Sucre Department|Sucre]]) is a [[Colombian people|Colombian]] musician interpreter of [[vallenato]] in [[accordion]]. De la Espriella is the current accordionist of Colombian vallenato singer Martin Elias Diaz.\n\nJuan Mario was born in Sincelejo, Sucre on February 26, 1973, son of Carlos Adolfo De la Espriella and Rosario Salcedo Macías. His father was a lawyer for the Colombian Petroleum Company (Ecopetrol) and a politician, who served as governor in charge of the department of Sucre on one occasion. His mother is a native of Barranquilla and a piano player. He inherited his taste for Vallenata music from his father, who had Vallenata parties in his house with artists such as Poncho Zuleta and Emilianito Zuleta from Los Hermanos Zuleta and the minstrel Alejandro Durán, which Juan Mario experienced in his childhood.\n\nHis father gave him his first accordion when he was 13 years old, under the condition that he study but keep music as a hobby, however Juan Mario would not study a university degree to dedicate himself completely to being a professional accordion player.\n\nJuan Mario married Dolly Cáliz, from whose union there are two children; Salvatore and Manuela De la Espriella Cáliz.\n\nFrom the age of 17 to 27, Juan Mario spent much of his life at parties playing the accordion, consuming alcohol, becoming a drug addict and having relationships with many women. During this period he became a partner musical with Miguel Osorio, Miguel Cabrera and Peter Manjarrés. According to Juan Mario, it was when he joined Silvestre Dangond and met Dolly Cáliz that his life began to change to try to get out of drugs and the partying life he was leading.  Since then he has had several relapses into drugs and alcohol, but he has also overcome them, according to him, due to his dedication to the Christian religion. His partner at the time, Silvestre, was also a drug user.\n\nIn 2007, Juancho and Silvestre underwent lipectomy and liposuction operations in 2007 to remove kilos of body weight.",
  "last_revision_date": "2024-09-19T01:25:13Z"
}