{
  "name": "Judy Garland",
  "description": "'''Judy Garland''' (born '''Frances Ethel Gumm'''; June{{nbsp}}10, 1922{{snd}}June{{nbsp}}22, 1969) was an American actress and singer. Possessing a strong [[contralto]] voice, she was celebrated for her emotional depth and versatility across film, stage, and concert performance. Garland achieved international recognition for her portrayal of [[Dorothy Gale]] in ''[[The Wizard of Oz]]'' (1939). Her rendition of \"[[Over the Rainbow]]\" won the [[Academy Award for Best Original Song]], and became Garland's [[List of signature songs|signature song]]. \n\nGarland began her career at the age of two: performing with her two older sisters as a [[vaudeville]] act called [[The Gumm Sisters]]. In 1935, aged 13, she signed a contract with [[Metro-Goldwyn-Mayer]] (MGM) and was initially cast in supporting roles in ensemble musicals such as ''[[Broadway Melody of 1938]]'' (1937) and ''[[Thoroughbreds Don't Cry]]'' (1937). The success of ''The Wizard of Oz'' propelled her into leading roles in MGM musicals, including ''[[Meet Me in St. Louis]]'' (1944), ''[[Easter Parade (film)|Easter Parade]]'' (1948), and ''[[Summer Stock]]'' (1950). In the 1950s and early 1960s, she expanded her range with dramatic performances in ''[[A Star Is Born (1954 film)|A Star Is Born]]'' (1954) and ''[[Judgment at Nuremberg]]'' (1961), both of which earned [[Academy Award]] nominations and demonstrated her capacity to convey vulnerability and resilience on screen.\n\nBeyond her film work, Garland had a distinguished singing career in recordings and live performance. Between 1939 and 1962, she recorded 11 [[Judy Garland discography#Studio albums|studio albums]]. Several of her recordings were later inducted into the [[Grammy Hall of Fame]]. Her 1961 live album ''[[Judy at Carnegie Hall]]'' won the [[Grammy Award for Album of the Year]]. In the same year she became the first woman to receive the [[Cecil B. DeMille Award]] for lifetime achievement in motion pictures (aged 39 at the time, she remains the youngest recipient of that award). Her honors also include a [[Golden Globe Award]], an [[Academy Juvenile Award]] for her early contributions, and a [[Special Tony Award]] for her role in reviving vaudeville. In 1997 she was posthumously awarded a [[Grammy Lifetime Achievement Award]], and in 1999 the [[American Film Institute]] ranked her eighth among the greatest female screen legends of classic Hollywood cinema.\n\nGarland's personal life was marked by both public fascination and private struggle. She married five times and had three children, including actresses and singers [[Liza Minnelli]] and [[Lorna Luft]]. From her teenage years onward, she faced health challenges exacerbated by studio pressures on her appearance and performance. She developed dependencies on prescription medications that affected her physical and mental well-being. Financial difficulties, including substantial tax debts, added to her burdens. She died from an accidental barbiturate overdose at age 47 in 1969. \n\nGarland's resilience, artistic range and enduring recordings have ensured her lasting impact on popular culture and her reputation as a cultural icon.",
  "last_revision_date": "2025-09-19T18:38:24Z",
  "genres": [
    626,
    1171,
    1221
  ]
}