{
  "name": "Judy Garland",
  "description": "'''Judy Garland''' (born '''Frances Ethel Gumm'''; June 10, 1922{{snd}}June 22, 1969) was an American actress and singer. Possessing a strong [[contralto]] voice, she was celebrated for her emotional depth and versatility across film, stage, and concert performance. Garland achieved international recognition for her portrayal of [[Dorothy Gale]] in ''[[The Wizard of Oz]]'' (1939). Her recording of \"[[Over the Rainbow]]\" became an enduring song in American popular music. Over a career spanning more than forty-five years, she recorded [[Judy Garland discography#Studio albums|eleven studio albums]], and several of her recordings were later inducted into the [[Grammy Hall of Fame]].\n\nAt the age of two, Garland began her career by performing with her two sisters as a vaudeville act, [[The Gumm Sisters]]. In 1935, she signed a contract with [[Metro-Goldwyn-Mayer]] at thirteen and appeared in supporting roles in ensemble musicals such as [[Broadway Melody of 1938|''Broadway Melody of 1938'']] (1937) and [[Thoroughbreds Don't Cry|''Thoroughbreds Don't Cry'']] (1937). The success of ''The Wizard of Oz'' propelled her into leading roles in MGM musicals including ''[[Meet Me in St. Louis]]'' (1944), ''[[Easter Parade (film)|Easter Parade]]'' (1948) and ''[[Summer Stock]]'' (1950). In the 1950s and early 1960s she expanded her range with dramatic performances in ''[[A Star Is Born (1954 film)|A Star Is Born]]'' (1954) and ''[[Judgment at Nuremberg]]'' (1961), both of which earned her [[Academy Award]] nominations and demonstrated her capacity to convey vulnerability and resilience on screen.\n\nBeyond her film work, Garland cultivated a distinguished career in live performance and recordings. Her 1961 live album ''[[Judy at Carnegie Hall]]'' won the [[Grammy Award for Album of the Year]], capping a series of sold-out engagements at the [[Hollywood Bowl]] and concerts. That same year she became the first woman—and, at thirty-nine, the youngest recipient—of the [[Cecil B. DeMille Award]] for lifetime achievement in motion pictures. Her honors also included a [[Golden Globe Award]], an [[Academy Juvenile Award]] for her early contributions, and a [[Special Tony Award]] for her role in reviving vaudeville. In 1997 she was posthumously awarded a [[Grammy Lifetime Achievement Award]], and in 1999 the [[American Film Institute]] ranked her eighth among the greatest female screen legends of classic Hollywood cinema.\n\nGarland's personal life was marked by both public fascination and private struggle. She married five times and had three children, including actress and singer [[Liza Minnelli]]. From her teenage years onward, she faced health challenges exacerbated by studio pressures on her appearance and performance, and she developed dependencies on prescription medications that affected her physical and mental well-being. Financial difficulties, including substantial tax debts, added to her burdens. She died in London in 1969 from an accidental barbiturate overdose at age 47. Garland's resilience, artistic range and enduring recordings have ensured her lasting impact on popular culture and her reputation as a cultural icon.",
  "last_revision_date": "2025-07-14T11:21:52Z",
  "genres": [
    1156,
    1206,
    617
  ]
}