{
  "name": "Julian Casablancas",
  "description": "'''Julian Fernando Casablancas''' (born August 23, 1978) is an American musician. He is the lead vocalist and primary songwriter of the [[Rock music|rock]] band [[the Strokes]], with whom he has released six studio albums since their founding in 1998. Casablancas released a solo studio album, ''[[Phrazes for the Young]]'', in 2009, and has released three albums with the experimental rock band [[the Voidz]].\n\nA native [[New York City|New Yorker]], he was born to businessman [[John Casablancas]]. His mother, Jeanette Christiansen, married a man who introduced him to the music of the band [[the Doors]], introducing him to rock music. He met bassist [[Nikolai Fraiture]] at the age of six, and attended the exclusive [[Le Rosey]] school, where he met guitarist [[Albert Hammond Jr.]] He did not complete high school, but received a GED.\n\nAfter meeting guitarist [[Nick Valensi]] and drummer [[Fab Moretti]] at [[Dwight School]] in [[Manhattan|Manhattan, New York]] the group began experimenting with music together. After adding Hammond Jr., the Strokes were formed. Their debut album ''[[Is This It]]'' was critically acclaimed, and launched Casablancas and the band to rock stardom. Casablancas was the primary songwriter and creative voice behind the band's early albums, including 2003's ''[[Room on Fire]]'' and 2005's ''[[First Impressions of Earth]]''. After a six-year hiatus, the Strokes released [[Angles (The Strokes album)|''Angles'']] in 2011 and ''[[Comedown Machine]]'' in 2013 with the band taking a more collaborative approach to these projects. Casablancas would not record another record with the band until 2020's [[Grammy Awards|Grammy-winning]] ''[[The New Abnormal]]'', the first such nomination or win for the band.\n\nDuring a five-year hiatus for the band, Casablancas released his debut solo album, ''[[Phrazes for the Young]]''. In the same year he founded the [[Independent record label|independent]] record label [[Cult Records]], which has represented artists [[the Growlers]], [[Rey Pila]] and [[Karen O]].\n\nSince 2013, he has been the frontman of experimental rock band [[the Voidz]]. The band has released three studio albums, ''[[Tyranny (The Voidz album)|Tyranny]]'' (2014), ''[[Virtue (The Voidz album)|Virtue]]'' (2018) and ''Like All Before You'' (2024). The band represents an ambition of Casablancas to make less commercial music and explore new themes.",
  "last_revision_date": "2025-10-08T10:48:29Z",
  "genres": [
    422,
    582,
    811,
    837,
    951
  ]
}