{
  "name": "Junoon",
  "description": "'''Junoon''' ({{Langx|ur|جنون}} {{Translation|Obsession/Passion}}) is a Pakistani [[sufi rock]] band from [[Lahore]], [[Punjab (Pakistani province)|Punjab]], [[Pakistan]], and Tappan, New York, formed in 1990.\n\nThe band is directed by founder, lead guitarist and songwriter, [[Salman Ahmad]], who was soon joined by keyboardist [[Nusrat Hussain]], bass guitarist [[Brian O'Connell (musician)|Brian O'Connell]] and vocalist [[Ali Azmat]]. Junoon is Pakistan's and one of South Asia's most successful bands. Since their inception, the group has released a total of nineteen albums: seven studio albums; one soundtrack; two live albums; four video albums; and five compilations. They have sold over 30 million records worldwide.\n\nPioneers of [[Sufi rock]] with an original sound, they achieved success during the early 1990s. Its members were signed to [[major record label]] [[EMI Records]] and afterwards released their self-titled debut album ''[[Junoon (Junoon album)|Junoon]]'' in 1991. After two years, the band recorded their second album ''[[Talaash (album)|Talaash]]'' (1993) with their new bassist [[Brian O'Connell (musician)|Brian O'Connell]] after [[Nusrat Hussain]] left the band. The release of their second album began to create a cult following for the band. In 1996, Junoon released their third album ''[[Inquilaab (album)|Inquilaab]]'', and it was only then that Junoon developed a nationwide fan following, with blending rock guitars and bluesy vocals with Eastern elements like the use of [[tabla]]s, raga-inspired melodies, traditional [[Pakistani folk music]], and Eastern-inspired poetry. The following year, the band recorded the critically acclaimed ''[[Azadi (album)|Azadi]]'' (1997), being the band's first international record deal, and making it Junoon's debut album in neighbouring [[India]]. The band went on to record and release ''[[Parvaaz]]'' in 1999. The band found renewed success and popularity starting with 2001's ''[[Andaz (album)|Andaz]]'' and through 2003's ''[[Dewaar]]'' and their supporting tours. Junoon celebrated their [[Silver jubilee|25th anniversary]] by releasing their eighth studio album titled ''[[Door (Junoon album)|Door]]'' in 2016.",
  "last_revision_date": "2026-01-08T06:36:32Z",
  "genres": [
    541,
    557,
    995,
    1186
  ]
}