{
  "name": "Lucas \"Grandpa\" Abela",
  "description": "'''Lucas \"Grandpa\" Abela''' (born 7 May 1972), also known by the stage name '''Justice Yeldham''', is an Australian [[noise music|noise]] musician. They are most famous for creating an instrument made from a diamond-shaped pane of glass, fitted with [[contact microphone]]s and attached to [[effects unit|effects pedals]]. During live shows, they manipulate and break the glass with their mouth, often receiving cuts in the process and leaving their face and the instrument smeared in blood. ''[[NME]]'' described their live shows as \"crossing the line between music and bloodsport\". Despite being classified as a noise artist, Abela sees themself as an improvisational musician in the [[free jazz]] tradition.\n\nAbela began their music career in [[Sydney]] in the 1990s as a [[DJing|DJ]] and [[turntabalism|turntablist]]. Realising that any metal tip can carry sound, they began replacing the record needles with objects such as pins, knives and skewers, and soon moved on to building their own [[phonograph]]s with recycled electric motors. Abela's experimentations attracted the attention of Australian musicians [[Oren Ambarchi]] and [[Mike Avenaim]], who helped launch their career as a touring musician. Abela discovered the musical potential of glass in 2003 when they found broken glass among building rubble in [[Chippendale, New South Wales|Chippendale]], Sydney. They attached a microphone to one end of the glass, then started blowing on the surface. They later said: \"I was really taken how just kind of crystal clear the resonance was as opposed to the resonance within metal, ... Finding glass was a hallelujah moment.\" Performing as Justice Yeldham, they toured the world extensively with their glass instrument, garnering a wide array of reactions due to the graphic and dangerous nature of their live shows. One journalist described the sound that Abela achieves with the instrument as \"like a distorted guitar laid over a harmony of dying cats.\" In regards to bleeding on stage due to cuts from the glass, Abela says, \"I'm never even conscious that I've cut myself until after the show when someone says 'You’d better clean yourself up.' It’s like the playing is an [[Out-of-body experience|out of body experience]] in which I never feel pain.\"\n\nIn 2017, Justice Yeldham began collaborating with American [[experimental hip hop]] group [[Death Grips]]. They feature on the band's 2018 album ''[[Year of the Snitch]]''.",
  "last_revision_date": "2025-11-28T23:30:59Z",
  "genres": [
    77,
    325,
    405,
    457,
    458,
    552,
    868
  ]
}