{
  "name": "Keane",
  "description": "'''Keane''' are  an English [[alternative rock]] band from [[Battle, East Sussex]], formed in 1995. The band comprises [[Tom Chaplin]] (lead vocals, guitar, piano), [[Tim Rice-Oxley]] (piano, synthesisers, bass guitar, backing vocals), Richard Hughes (drums, percussion, backing vocals) and [[Jesse Quin]] (bass guitar, guitar, backing vocals). Their original line-up included founder and guitarist [[Dominic Scott]], who left in 2001. \n\nKeane achieved mainstream international success with the release of their debut album ''[[Hopes and Fears]]'' in 2004. Topping the [[UK Albums Chart]], the album won the [[Brit Awards|2005 Brit Award]] for [[2005 Brit Awards|Best British Album]] and was the UK's second-best-selling album of 2004. It is one of the [[List of best-selling albums in the United Kingdom|best-selling albums in UK chart history]]. Their second album, ''[[Under the Iron Sea]]'' (2006), topped the UK chart and debuted at number four on the US [[Billboard 200|''Billboard'' 200]]. They released their third album ''[[Perfect Symmetry (Keane album)|Perfect Symmetry]]'' in 2008, and followed it with the 2010 EP ''[[Night Train (EP)|Night Train]]''. Their fourth studio album ''[[Strangeland (album)|Strangeland]]'' was released in 2012 and peaked at number one in the UK. \n\nThe band went on hiatus after the release of their compilation album ''[[The Best of Keane]]'' (2013). They returned in 2019 with \"The Way I Feel\", the lead single from their fifth studio album, ''[[Cause and Effect (Keane album)|Cause and Effect]]'' (2019). The band then embarked on the Cause and Effect Tour, visiting Europe and Latin America, before the remainder of the tour was postponed due to the [[COVID-19 pandemic]].\n\nKeane are known for using keyboards as the lead instrument instead of guitar, differentiating them from most other rock bands. The inclusion of a distorted piano effect in 2006 and various synthesisers was a common feature in their music which developed on the second and third albums. In May 2008, both ''Hopes and Fears'' (number 13) and ''Under the Iron Sea'' (number 8) were voted by readers of ''[[Q magazine|Q]]'' magazine as among the best British albums ever. In 2009, ''Hopes and Fears'' was listed as the [[List of best-selling albums of the 2000s (decade) in the United Kingdom|ninth best-selling album of the 2000s decade]] in the UK. Keane have sold over 13 million records worldwide.",
  "last_revision_date": "2025-08-21T02:32:06Z",
  "genres": [
    42,
    935,
    1036,
    1119
  ]
}