{
  "page_title": "Kelly Willard",
  "description": "'''Kelly Willard''' (born on August 18, 1956) is a [[contemporary Christian music]]ian best known for her [[Contemporary worship music|praise and worship recordings]]. She was featured as a soloist on recordings from [[Integrity Media|Integrity]], [[Vineyard Music]], and [[Maranatha! Music]]. Additionally she has sung duets and background vocals with such artists as [[Don Moen]], [[Dion DiMucci]], [[Lenny LeBlanc]], [[Amy Grant]], [[Ricky Skaggs]], [[Paul Overstreet]], [[Twila Paris]], [[Steve Green (singer)|Steve Green]], [[Fernando Ortega]], [[Keith Green]], [[Buddy Greene]], Jim Cole and many others. Willard has also recorded nine solo projects.\n\nWillard was born in [[Winter Haven, Florida]]. She began playing the piano at the age of five and composing her own songs at the age of thirteen. She accompanied the church choir, playing and singing in nursing homes, and traveled with a part-time gospel group on the weekends. At the age of sixteen Willard moved to [[Nashville, Tennessee|Nashville]], where she accompanied The Jake Hess Sound on piano. She then moved to [[Panorama City, California]], where she joined the popular [[Contemporary Christian music|CCM]] group [[The Archers (musical group)|The Archers]], and later went to [[Oklahoma City, Oklahoma]] joining the group Seth. She credits her vocal development to Jonathan David Brown and Harlan Rogers.\n\nWillard married at 18, joined Harlan Rogers & Friends, and traveled the [[Midwestern United States|midwest]] until 1977. She moved to Southern California to be a part of the flow of 'Jesus Music' artists who were performing and recording there. She played keyboards and sang background vocals on projects for artists including [[Bob Bennett (singer-songwriter)|Bob Bennett]] and [[Roby Duke]] before [[Maranatha! Music]] approached her in 1978 asking her to record her own solo project.\n\nAfter the birth of her children, she took occasional sabbaticals, [[homeschooling]] them during the 1980s, 1990s. Later she took care of her mother, who had [[Alzheimer's disease|Alzheimer's]]. In 2004, both of her parents died, her 29-year marriage came to an end, and her 18-year-old daughter Haylie committed suicide after a struggle with severe depression. Willard later referred to the period in an interview as \"the worst year of my life.\" She moved to [[Jacksonville, Florida]], and became part of a church support community there.\n\nWillard's latest album, recorded in 2000, titled ''Paga'', features her son Bryan on bass guitar, and her daughter Haylie in a duet on the song \"Beautiful Jesus\".{{cn|date=August 2015}} Kelly Willard lives in [[Florence, Alabama]]; she is writing and recording a new \"duo\" project with long-time friend, Rene Stamps.{{cn|date=August 2015}}",
  "last_revision_date": "2025-05-15T18:05:19Z"
}