{
  "name": "Kenny G",
  "description": "'''Kenneth Bruce Gorelick''' (born June 5, 1956) is an American [[smooth jazz]] saxophonist, composer, and record producer. His 1986 album ''[[Duotones]]'' brought him commercial success. Kenny G is one of the [[List of best-selling music artists|best-selling artists of all time]], with global sales totaling more than 75 million records, making him also the best-selling instrumentalist in history.\n\nKenny G was born in Seattle, Washington and started playing the saxophone at the age of ten, inspired by a performance on ''[[The Ed Sullivan Show]]''. He attended several schools in Seattle, including the [[University of Washington]]. During high school, he took private saxophone lessons and played in the school jazz band.\n\nKenny G's professional career began with [[Barry White]]'s [[The Love Unlimited Orchestra]] at age 17. He played with the Seattle funk band Cold, Bold & Together before joining the [[Jeff Lorber Fusion]] in 1980. His solo career took off after signing with [[Arista Records]] in 1982. His debut album, ''[[Kenny G (album)|Kenny G]]'', was recorded with members of the Jeff Lorber Fusion and released in 1982. Kenny G's fourth solo album, ''[[Duotones]]'' (1986), marked the start of his most commercially successful period, featuring the hit single \"[[Songbird (Kenny G composition)|Songbird]]\". His 1992 album, ''[[Breathless (Kenny G album)|Breathless]]'', became the best-selling instrumental album ever, and his first holiday album, ''[[Miracles: The Holiday Album]]'', sold over 13 million copies. He has worked on soundtracks for films such as ''[[The Bodyguard (soundtrack)|The Bodyguard]]'' and collaborated with artists, including [[Andrea Bocelli]] and [[Frank Sinatra]].\n\nIn the 2000s and 2010s, Kenny G released several albums, including ''[[Paradise (Kenny G album)|Paradise]]'' and ''[[Brazilian Nights]]''. He made appearances in commercials and music videos and continued to perform worldwide. Kenny G's popularity in China is notable, with his song \"[[Going Home (Kenny G composition)|Going Home]]\" widely used in public places. Despite facing criticism from some jazz musicians, Kenny G remains a highly successful and influential figure in contemporary instrumental music.",
  "last_revision_date": "2025-12-08T13:21:32Z",
  "genres": [
    10,
    388,
    1142
  ]
}