{
  "name": "Kim Junsu",
  "description": "'''Kim Jun-su''' ({{Korean|hangul=김준수}}; born December 15, 1986{{efn-ua|name=dob}}), known [[mononymously]] as  '''Junsu''' or by the stage name '''XIA''' ({{IPAc-en|ʃ|i|ˈ|ɑː}} {{respell|SHEE|ah}}; {{Korean|hangul=시아|labels=no}}) is a South Korean singer-songwriter and musical actor. He is a member of [[JYJ]], and was one of the original members of [[TVXQ]], during which time he was known by the stage name '''Xiah Junsu''' ({{Korean|hangul=시아준수|labels=no}}). \n\nKim made his debut in 2003 as a member of [[TVXQ]], a [[boy band]] produced and formed by South Korean record label and talent agency [[SM Entertainment]], having previously been a trainee for six years. During his time in TVXQ, the group released four Korean albums, four Japanese albums, thirty Japanese singles and several Korean singles. In 2009, Kim and fellow TVXQ members [[Kim Jaejoong]] and [[Park Yoochun]] filed a lawsuit against SM Entertainment, arguing that their exclusive contracts were unilaterally disadvantageous towards the artists and should be invalidated. The Seoul Central District Court ruled in favor of the three and granted an injunction suspending their contracts. The trio reunited and subsequently formed [[JYJ]] in 2010. JYJ has since released one English album, two Korean albums, one Japanese EP, and one Korean EP.\n\nKim began his solo career in 2010 with the release of the Japanese EP ''[[Xiah (EP)|Xiah]]'', which peaked at number two on Japan's [[Oricon Singles Chart]]. Later that year, he made his musical debut in the role of Wolfgang in ''[[Mozart!]]'', receiving critical acclaim and commercial success. In May 2012, he made his solo debut in South Korea with the studio album ''[[Tarantallegra]]'' and embarked on his first headlining world tour.\n\nDespite limitations in media coverage and promotional activities caused by a ban in the Entertainment Departments of South Korea's three main terrestrial broadcasters resulting from [[SM Entertainment]]'s interference, Kim's first and second studio albums reached the top two on South Korea's [[Circle Album Chart|Gaon Album Chart]], as well as reaching number-ten and number-five on the ''[[Billboard charts|Billboard]]'' World Albums chart for ''Tarantallegra'' and ''Incredible'', respectively. He is also known for being able to sell out tickets for his concerts and musicals within minutes, dubbed \"the ticket power\" by South Korean media. In November 2021, Kim formed his own agency, Palm Tree Island, with him as CEO.",
  "last_revision_date": "2026-01-26T03:26:23Z",
  "genres": [
    40,
    281,
    319,
    660,
    681
  ]
}