{
  "name": "Kim Junsu",
  "description": "'''Kim Jun-su''' ({{Korean|hangul=김준수}}; born December 15, 1986{{efn-ua|name=dob}}), known [[mononymously]] as  '''Junsu''' or known under the stage name '''XIA''' ({{IPAc-en|ʃ|i|ˈ|ɑː}} {{respell|SHEE|ah}}; {{Korean|hangul=시아|labels=no}}) is a South Korean singer-songwriter, dancer and musical actor. He is a member of [[JYJ]], and was one of the original members of boy band [[TVXQ]], where he was formerly known by the stage name '''Xiah Junsu''' ({{Korean|hangul=시아준수|labels=no}}). In November 2021, Kim formed his own agency Palm Tree Island, with him as CEO.\n\nKim made his debut in 2003 as a member of [[TVXQ]], a [[boy band]] produced and formed by South Korean record label and talent agency [[SM Entertainment]], having previously been a trainee for six years. He had released four Korean albums, four Japanese albums, thirty Japanese singles and several Korean singles with TVXQ in the six years his career. In 2009, Kim and fellow TVXQ members [[Kim Jaejoong]] and [[Park Yoochun]] filed a lawsuit against SM Entertainment, arguing that their exclusive contracts were unilaterally disadvantageous towards the artists and should be invalidated. The Seoul Central District Court ruled in favor of the three and granted an injunction suspending their contracts. The trio reunited and subsequently formed [[JYJ]] (formerly known as JUNSU/JAEJOONG/YOOCHUN in Japan). With JYJ, Kim has released one [[The Beginning (JYJ album)|English album]], two [[JYJ discography|Korean albums]], one [[The...|Japanese EP]], and one [[Their Rooms \"Our Story\"|Korean EP]].\n\nKim began his solo career in 2010 with the release of Japanese EP ''[[Xiah (EP)|Xiah]]'', which peaked at number-two on Japan's [[Oricon Chart|Oricon]] singles chart. After the release of ''Xiah'', Kim's solo music career was sent into hiatus because of a discord between him and his Japanese label [[Avex Trax]] that led to the sudden suspension of all his activities in Japan. Later that year, he made his musical debut with took the role of Wolfgang in ''[[Mozart!]]'', receiving critical acclaim and commercial success. In May 2012, he made his solo debut in Korea with released his studio album ''[[Tarantallegra]]'' and also embarked on his first headlining world tour.\n\nDespite limitations in media coverage and promotional activities caused by a ban in the Entertainment Departments of South Korea's three main terrestrial broadcasters resulting from [[SM Entertainment]]'s interference, Kim's first and second studio album reached top two on the [[Gaon Chart|Gaon]] albums chart in South Korea, as well as reaching number-ten and number-five on the ''[[Billboard charts|Billboard]]'' World Albums chart for ''Tarantallegra'' and ''Incredible'', respectively. He is also known for being able to sell out tickets for his concerts and musicals within minutes, dubbed \"the ticket power\" by South Korean media.",
  "last_revision_date": "2025-06-14T13:03:25Z"
}