{
  "description": "'''King Crimson''' were  an English [[progressive rock]] band formed in London in 1968 by [[Robert Fripp]], [[Michael Giles]], [[Greg Lake]], [[Ian McDonald (musician)|Ian McDonald]] and [[Peter Sinfield]]. Guitarist Fripp remained the only constant member throughout the band's long history. The band drew inspiration from a wide variety of music, incorporating elements of [[classical music|classical]], [[jazz]], [[folk music|folk]], [[heavy metal music|heavy metal]], [[gamelan]], [[blues]], [[industrial (music)|industrial]], [[electronic music|electronic]], and [[experimental music]]. They exerted a strong influence on the early 1970s progressive rock movement, including on contemporaries such as [[Yes (band)|Yes]] and [[Genesis (band)|Genesis]], and continue to inspire subsequent generations of artists across multiple genres. The band has earned a large [[cult following]], especially in the 21st century.\n\nThe band's debut album, ''[[In the Court of the Crimson King]]'' (1969), remains their most commercially successful and influential release. The next two albums, ''[[In the Wake of Poseidon]]'' and ''[[Lizard (album)|Lizard]]'' (both 1970), were recorded during a period of instability in the band's line-up, before a stable group with Fripp, Sinfield, [[Mel Collins]], [[Boz Burrell]] and [[Ian Wallace (drummer)|Ian Wallace]] recorded ''[[Islands (King Crimson album)|Islands]]'' in 1971. In mid-1972, Fripp disbanded this line-up, recruited new members [[Bill Bruford]] (formerly of [[Yes (band)|Yes]]), [[John Wetton]], [[David Cross (musician)|David Cross]] and [[Jamie Muir]], and changed the group's musical approach, drawing from European free improvisation and developing ever more complex compositions. The band reached what some saw as a creative peak on ''[[Larks' Tongues in Aspic]]'' (1973), ''[[Starless and Bible Black]]'' (1974), and ''[[Red (King Crimson album)|Red]]'' (1974). King Crimson disbanded at the end of 1974.\n\nAfter seven years of inactivity, King Crimson was recreated in 1981 with Fripp, Bruford and new members [[Adrian Belew]] and [[Tony Levin]]. Drawing influence from African music, [[gamelan]], [[post-punk]] and New York [[Minimalist music|minimalism]], this band lasted three years, resulting in the trio of albums ''[[Discipline (King Crimson album)|Discipline]]'' (1981), ''[[Beat (King Crimson album)|Beat]]'' (1982) and ''[[Three of a Perfect Pair]]'' (1984). Following a decade-long hiatus, they reformed in 1994, adding [[Pat Mastelotto]] and [[Trey Gunn]] for a sextet line-up Fripp called \"The Double Trio\". The double trio participated in another three-year cycle of activity that included the album ''[[Thrak]]'' (1995). Fripp, Belew, Mastelotto and Gunn reunited in 2000 as a quartet, called \"The Double Duo\", releasing ''[[The Construkction of Light]]'' (2000) and ''[[The Power to Believe]]'' (2003). After another hiatus, the band reformed for a 2008 tour celebrating the 40th anniversary of their 1968 formation, with [[Gavin Harrison]] of [[Porcupine Tree]] being added, and Levin returning in place of Gunn.\n\nFollowing another hiatus (2009–2012), during which Fripp was thought to be retired, King Crimson came together again in 2013, this time as a septet (and, later, octet) with an unusual three-drumkit frontline, and new singer and secondary guitarist [[Jakko Jakszyk]]. This version of King Crimson toured from 2014 to 2021.  After the band's final show in 2021, Fripp commented that King Crimson had \"moved from sound to silence.\"\n{{TOC limit|3}}",
  "last_revision_date": "2025-06-19T01:38:42Z"
}