{
  "name": "Kishore Kumar",
  "description": "'''Kishore Kumar''' (born '''Abhas Kumar Ganguly'''; {{audio|Kishore Kumar pronunciation.ogg|pronunciation}}; 4 August 1929 – 13 October 1987) was an Indian [[playback singer]], musician and actor. He is widely regarded as one of the greatest, most influential and dynamic singers in the history of [[Indian music]]. Kumar was one of the most popular singers in the [[Indian subcontinent]], notable for his [[yodelling]] and ability to sing songs in different voices. He used to sing in different genres but some of his rare compositions, considered classics, were lost in time. In 2013, Kumar was voted \"The Most Popular Male Playback Singer\" in a poll conducted by the [[Filmfare|Filmfare magazine]].   \n\nBesides [[Hindi]], he sang in many other Indian languages, including [[Bengali language|Bengali]], [[Marathi language|Marathi]], [[Assamese language|Assamese]], [[Gujarati language|Gujarati]], [[Kannada]], [[Bhojpuri language|Bhojpuri]], [[Malayalam]], [[Odia language|Odia]] and [[Urdu]]. He also released a few non-film albums in multiple languages, especially in Bengali, which are noted as all-time classics. According to his brother and legendary actor [[Ashok Kumar]], Kishore Kumar was successful as a singer because his \"voice hits the mike, straight, at its most sensitive point\".\n\nHe won 8 [[Filmfare Award for Best Male Playback Singer]] out of 28 nominations and holds the record for winning and nominating the most [[Filmfare Awards]] in that category. He was awarded the [[Lata Mangeshkar Award]] by the [[Madhya Pradesh]] government in 1985. In 1997, the [[Madhya Pradesh]] Government initiated an award called the \"Kishore Kumar Award\" for contributions to [[Bollywood|Hindi cinema]]. In 2012, his unreleased last song sold for {{Indian Rupee}}15.6 [[lakh]] ($17,500 US) at the Osian's Cinefan Auction in [[New Delhi]].",
  "last_revision_date": "2025-12-04T13:51:58Z",
  "genres": [
    271,
    353,
    941,
    1052,
    1307
  ]
}