{
  "name": "Kiss",
  "description": "'''Kiss''' (commonly styled as '''KIϟϟ''' or '''KISS''') was an American [[rock music|rock]] band formed in [[New York City]] in 1973 by [[Paul Stanley]] (vocals, rhythm guitar), [[Gene Simmons]] (vocals, bass guitar), [[Ace Frehley]] (lead guitar, vocals) and [[Peter Criss]] (drums, vocals). Known for their [[face paint]] and stage outfits, the group rose to prominence in the mid-1970s with [[shock rock]]–style live performances that featured fire-breathing, blood-spitting, smoking guitars, shooting rockets, levitating drum kits and [[pyrotechnics]]. The band went through several lineup changes, with Stanley and Simmons remaining the only consistent members. The final lineup consisted of Stanley, Simmons, [[Tommy Thayer]] (lead guitar, vocals) and [[Eric Singer]] (drums, vocals).\n\nWith their makeup and costumes, the band members took on the personas of comic book-style characters: the Starchild (Stanley), the Demon (Simmons), the Spaceman or Space Ace (Frehley), and the Catman (Criss). During the second half of the 1970s, Kiss became one of America's most successful rock bands and a pop culture phenomenon. The band's commercial success declined during the early 1980s; however, it experienced a resurgence in 1983 when the band members began performing without makeup and costumes, marking the beginning of the band's \"unmasked\" era that would last until 1996. The first album of this era, 1983's [[platinum-certified]] ''[[Lick It Up]]'', successfully introduced the band to a new generation of fans, and its music videos received regular airplay on [[MTV]]. In response to a wave of Kiss [[nostalgia]] in the mid-1990s, the original lineup reunited in 1996; at this time, the band resumed using makeup and stage costumes. The resulting [[Alive/Worldwide Tour|1996–1997 reunion tour]] was the band's most successful, grossing $143.7&nbsp;million. In January 2019, Kiss began its [[End of the Road World Tour|final worldwide tour]], and the band retired after performing its final show in New York City in December 2023.\n\nKiss is regarded as one of the most influential rock bands of all time, as well as [[List of best-selling music artists|one of the best selling bands of all time]]. Kiss has also earned 30 Gold albums, the most of any band from the United States. Kiss has earned 14 Platinum albums, three of which earned multi-Platinum status. The four original members of Kiss were inducted into the [[Rock and Roll Hall of Fame]] in April 2014. Kiss was ranked by [[MTV]] as the ninth-greatest metal band of all time, placed tenth on [[VH1]]'s \"100 Greatest Artists of Hard Rock\" list, was ranked as the third \"Best Metal and Hard Rock Live Band of All Time\" by ''[[Loudwire]]'' magazine, and was placed sixteenth by the British magazine ''[[Classic Rock (magazine)|Classic Rock]]'' on their \"The 50 Best Rock Bands of All Time\" list.",
  "last_revision_date": "2025-09-19T18:26:51Z",
  "genres": [
    497,
    534,
    549,
    1105
  ]
}