{
  "name": "Koffi Olomidé",
  "description": "'''Antoine Christophe Agbepa Mumba''' (born 13 July 1956), known professionally as '''Koffi Olomidé''', is a Congolese singer-songwriter, dancer, producer, and founder of [[Quartier Latin International]]. Often referred to as the \"King of [[Ndombolo]]\", he is noted for his explosive [[Vocal range|high notes]], deep, throaty [[baritone]], and [[Offbeat (music)|offbeat]] voice. Agbepa is considered one of the most significant figures in 20th-century [[Music of the Democratic Republic of the Congo|Congolese]] and [[African popular music]]. His lyrics often explore themes of love, politics, technology, success, infidelity, religion, [[Trickster|chicanery]], and disillusionment. Through his music and stage performances, he introduced the slower style of [[soukous]] known as tcha tcho and popularized a flamboyant fashion [[subculture]] called [[La Sape]], alongside [[Papa Wemba]].\n\nEmerging as a [[ghostwriter]] for various artists in the [[Music industry and copyright in the Democratic Republic of the Congo|Zairean music industry]], he gained prominence in 1977 with the song \"Princesse ya Synza\", which featured Papa Wemba and [[King Kester Emeneya]]. In 1986, he established the group Quartier Latin International, which accompanied him onstage and on his albums since 1992, serving as a launching pad for emerging artists, including [[Fally Ipupa]], [[Jipson Butukondolo]], Deo Brondo, [[Montana Kamenga]], [[Bouro Mpela]], [[Ferré Gola]], Marie-Paul Kambulu, Eldorado Claude, Djuna Fa Makengele, [[Soleil Wanga]], Laudy Demingongo Plus-Plus, Éric Tutsi, among others. His career experienced a resurgence in 1990, when he signed a record deal with [[Sonodisc|SonoDisc]].\n\nWith a nearly five-decade-long career, he is the first African artist to sell out the [[Accor Arena|Palais Omnisports de Paris-Bercy]], and one of twelve African artists whose work has been featured in the book ''[[1001 Albums You Must Hear Before You Die]]''. Throughout his forty-year career, Agbepa has recorded 32 studio albums, including seven under the Latin Quarter banner, one in collaboration with [[Papa Wemba]], as well as 18 live albums, amounting to a repertoire of over 300 songs.\n\nHe has won six [[Kora Awards]], four of which in the 2002 edition, for his album ''Effrakata''. ''[[Forbes]]'' has named him among Africa's 40 most influential celebrities. In 2013, he founded his own recording label, Koffi Central. On 13 October 2015, he released ''13ième apôtre'', a [[Double album|quadruple album]] comprising 39 songs, which he proclaimed to be his last, before later resurfacing with ''Nyataquance'' (2017), ''Légende Éd. Diamond'' (2022), ''Platinium'' (alternatively titled ''Platinum'') in 2024, and ''GOAT Intemporel, Vol. 1'' (2025). In July 2025, Agbepa secured the second spot on ''[[Billboard (magazine)|Billboard]]'' France's 2025 ranking of the most-streamed Congolese artists in France, highlighting those who began their careers in either the DRC or the [[Republic of the Congo]].",
  "last_revision_date": "2026-01-28T07:07:00Z",
  "genres": [
    279,
    821
  ]
}