{
  "name": "Laibach",
  "description": "'''Laibach''' ({{IPA|de|ˈlaɪbax|-|de-Laibach.ogg}}) is a [[Slovenia]]n [[avant-garde music]] group associated with the [[industrial music|industrial]], [[Martial industrial|martial]], and [[Dark wave#Neoclassical dark wave|neoclassical]] genres. Formed in 1980 in the [[Mining community|mining town]] of [[Trbovlje]], Slovenia (at the time the [[SR Slovenia]] within [[Socialist Federal Republic of Yugoslavia|Yugoslavia]]), Laibach represents the musical wing of the [[Neue Slowenische Kunst]] (NSK) [[artist collective]], a group which Laibach co-founded in 1984.\n\nFrom the early days, the band was subject to controversies and bans due to their use of iconography with parodies and [[pastiche]]s of elements from [[totalitarianism]], [[nationalism]] and [[militarism]], a concept they have preserved throughout their career. Censored in Yugoslavia, receiving a [[dissident]] status and a [[cult following]] in their home country, the band embarked on international tours and gradually acquired international fame, which led to wider acceptance by Yugoslav public and to attention of the country's mainstream media. After Slovenia became independent in 1991, Laibach's status in the country has turned from rejection by a part of the public to promotion into a national cultural icon.\n\nEarly Laibach albums were industrial-oriented, marked by heavy rhythms and roaring vocals. Later in the mid-1980s, their sound became more richly layered, featuring samples from [[Pop music|pop]] and [[classical music]]. The band's lyrics, variously written in Slovene, German and English, are usually delivered by the deep [[Bass (voice type)|bass]] vocals of lead vocalist Milan Fras. Initially the lyrics handled war and military themes; later, the focus turned to any highly charged political issue of the moment, sending intentionally ambiguous messages. They recorded a number of cover versions of popular songs, often turning light melodies into sinister-sounding [[Gothic rock|gothic]] tunes.\n\nThe band has seen numerous line-up changes, with Milan Fras (lead vocals), [[Dejan Knez]] (bass guitar, keyboards, drums), Ervin Markošek (drums, keyboards, electronics) and Ivan \"Jani\" Novak (stage effects) forming the best-known line-up. They have worked with a number of collaborators and guest musicians. During their career, Laibach have also recorded film and theatre music and produced works of visual arts, while the band members have embarked on a number of side projects.",
  "last_revision_date": "2025-12-26T02:07:00Z",
  "genres": [
    77,
    401,
    405,
    607,
    750
  ]
}