{
  "name": "LCD Soundsystem",
  "description": "'''LCD Soundsystem''' is an American [[Dance-punk#Contemporary dance-punk|dance-punk revival]] band from [[Brooklyn|Brooklyn, New York]], formed in 2002 by [[James Murphy (electronic musician)|James Murphy]], {{Nowrap|co-founder}} of [[DFA Records]]. The band comprises Murphy (vocals, various instruments), Nancy Whang (synthesizer, keyboards, vocals), Pat Mahoney (drums), Tyler Pope (bass, guitar, synthesizer), [[Al Doyle]] (guitar, synthesizer, percussion), Matt Thornley (guitar, synthesizer, percussion), and Korey Richey (synthesizer, piano, percussion). They have been signed to DFA since their inception, and also signed to [[Columbia Records]] in 2016.\n\nThe band began by recording and releasing multiple singles from 2002 to 2004, the first of which was \"[[Losing My Edge]]\", one of their [[signature song]]s. This led up to the release of their 2005 [[LCD Soundsystem (album)|self-titled debut studio album]]. It garnered critical acclaim and a [[Grammy Award]] nomination for [[Grammy Award for Best Electronic/Dance Album|Best Electronic/Dance Album]]. Their song \"[[Daft Punk Is Playing at My House]]\", which became the band's most commercially successful single, received a Grammy nomination for [[Grammy Award for Best Dance Recording|Best Dance Recording]]. In the following year, LCD Soundsystem recorded and released \"[[45:33]]\", a forty-five minute-long composition that was a specially made \"workout track\" for [[Nike, Inc.|Nike]]'s ''Nike+ Original Run'' series. In 2007, the band released their second studio album, ''[[Sound of Silver]]'', to critical acclaim and another Grammy nomination for Best Electronic/Dance Album.\n\nIn 2010, LCD Soundsystem released their third studio album, ''[[This Is Happening]]'', which became their first top-ten album in the United States. In February 2011, the band posted a statement on its website announcing that it was disbanding following a large farewell concert at [[Madison Square Garden]] on April 2, 2011. The farewell concert is chronicled in the documentary film ''[[Shut Up and Play the Hits]]'' and was also made available as a live album titled ''[[The Long Goodbye: LCD Soundsystem Live at Madison Square Garden|The Long Goodbye]]'', in April 2014.\n\nAfter a series of rumors hinting at a possible reunion, in December 2015 the band released their first single in five years, \"[[Christmas Will Break Your Heart]]\". The group later confirmed their reunion and announced an expanded tour, including appearances at several high-profile music festivals, and released their fourth studio album, ''[[American Dream (LCD Soundsystem album)|American Dream]]'' in September 2017. It went on to become their first number-one album in the U.S. The album was nominated for [[Best Alternative Music Album]] at the [[60th Annual Grammy Awards]] and the single \"[[Tonite (LCD Soundsystem song)|Tonite]]\" won for Best Dance Recording.",
  "last_revision_date": "2025-07-17T17:05:19Z",
  "genres": [
    395,
    398,
    36,
    65,
    575
  ]
}