{
  "name": "LeAnn Rimes",
  "description": "'''Margaret LeAnn Rimes Cibrian''' (born August 28, 1982) is an American singer, songwriter and actress. She originally rose to success as a [[country music]] artist at the age of 13 and has since [[Crossover music|crossed over]] into [[Pop music|pop]], [[Contemporary Christian music|contemporary Christian]], and other musical genres. Rimes has placed more than 40 singles on international charts since 1996. She has sold more than 48&nbsp;million records worldwide, with 20.8&nbsp;million album sales in the United States, according to [[Nielsen SoundScan]]. ''[[Billboard (magazine)|Billboard]]'' ranked her at number 17 in terms of sales success in the 1990–1999 decade.\n\nBorn in Mississippi and raised in Texas, Rimes demonstrated a unique singing ability from a young age. Through her parents' efforts, Rimes began performing in various musical theater and local music contests. Working with her father Wilbur as producer and manager, Rimes released two independent albums as a preteen. After signing with [[Curb Records]] in 1996, she released the single \"[[Blue (Bill Mack song)#LeAnn Rimes versions|Blue]]\", which became a top-10 hit on the American ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs]] charts. Her first Curb album and third overall, [[Blue (LeAnn Rimes album)|''Blue'']] was [[RIAA certification|certified Platinum]] six times and established her as a major country artist. She received the [[Grammy Award for Best New Artist]] and [[Grammy Award for Best Female Country Vocal Performance|Best Female Country Vocal Performance]], becoming the youngest winner of the these categories. In 1997, Rimes crossed over into pop music with \"[[How Do I Live]]\", which became one of the best-selling singles of the 1990s. The track was included on her next album ''[[You Light Up My Life: Inspirational Songs]]'' (1997), which was certified quadruple Platinum. It was followed up with the Platinum-certified albums ''[[Sittin' on Top of the World (LeAnn Rimes album)|Sittin' on Top of the World]]'' (1998) and ''[[LeAnn Rimes (album)|LeAnn Rimes]]'' (1999). In the following years, Rimes released several pop singles for soundtrack albums, which include \"[[I Need You (LeAnn Rimes song)|I Need You]]\" and \"[[Can't Fight the Moonlight]]\", the latter of which became a major hit worldwide. Several of these soundtrack singles were compiled on the Platinum-certified album ''[[I Need You (LeAnn Rimes album)|I Need You]]'' (2001).\n\nBreaking away from her father's management in the 2000s, Rimes released the Gold-certified pop album ''[[Twisted Angel]]'' (2002) and the Christmas record ''[[What a Wonderful World (LeAnn Rimes album)|What a Wonderful World]]'' (2004). She returned to her country origins with ''[[This Woman (LeAnn Rimes album)|This Woman]]'' (2005), which produced three country hits and was certified Gold. Later album releases were ''[[Whatever We Wanna]]'' (2006), ''[[Family (LeAnn Rimes album)|Family]]'' (2007), ''[[Lady & Gentlemen]]'' (2011) and ''[[Spitfire (LeAnn Rimes album)|Spitfire]]'' (2013). After ending her long-time professional relationship with Curb Records, Rimes released the Christmas album ''[[Today Is Christmas]]'' (2015) and pop studio album ''[[Remnants (LeAnn Rimes album)|Remnants]]'' (2016), the latter of which featured two number one ''Billboard'' dance club hits. In the years that followed, she released the albums ''[[Chant: The Human & the Holy]]'' (2020) and ''[[God's Work]]'' (2022).\n\nRimes has also had several notable television film roles. She began her acting career with the film ''[[Holiday in Your Heart]]'' (1997). After appearing in the television film ''[[Northern Lights (2009 film)|Northern Lights]]'' (2009), Rimes began an affair with co-star [[Eddie Cibrian]] which received notable media attention. She has since appeared in ''[[Good Intentions (2010 film)|Good Intentions]]'' (2010), ''[[Reel Love (2011 film)|Reel Love]]'' (2011), and ''[[It's Christmas, Eve]]'' (2018). In 2024, she was featured as a coach on ''[[The Voice (Australian TV series)|The Voice Australia]]'' and ''[[The Voice UK]]''.",
  "last_revision_date": "2025-11-15T03:07:23Z",
  "genres": [
    289,
    935,
    1206
  ]
}