{
  "name": "Lemmy",
  "description": "'''Ian Fraser Kilmister''' (24 December 1945 – 28 December 2015), better known as '''Lemmy Kilmister, Lemmy from Motörhead''' or simply '''Lemmy''', was an English musician. He was the founder, lead vocalist, bassist and primary songwriter of the rock band [[Motörhead]], of which he was the only continuous member, and a member of [[Hawkwind]] from 1971 to 1975.\n\nA foundational force in the genre following the advent of the [[new wave of British heavy metal]], Lemmy was known for his appearance, which included his signature [[sideburns|friendly mutton chops]], his military-influenced fashion sense and his gravelly rasp of a voice. It was once declared \"one of the most recognisable voices in rock\". He was also noted for his unique posture when singing, which was once described as \"looking up towards a towering microphone tilted down into his weather-beaten face\". He was also known for his bass playing style, using his [[Rickenbacker]] bass to create an \"overpowered, distorted rhythmic rumble\". A notable aspect of his bass sound was his guitar-like riffing, often playing [[power chord]]s using heavily overdriven [[Bass amplifier|tube stacks]] by [[Marshall Amplification|Marshall]].\n\nLemmy was born in [[Stoke-on-Trent]] and grew up between there, the nearby towns of [[Newcastle-under-Lyme]] and [[Madeley, Staffordshire|Madeley]], and later in the village of [[Benllech]], [[Anglesey]], Wales.  At a later point, Lemmy remembers living briefly at [[Gwrych Castle]], [[Abergele]]. He was influenced by rock and roll and the early works of [[the Beatles]], which led to him playing in several rock groups in the 1960s, such as [[the Rockin' Vickers]]. He worked as a [[Road crew|roadie]] for [[Jimi Hendrix]] and [[the Nice]] before joining the [[space rock]] band [[Hawkwind]] in 1971, singing lead vocals on their hit \"[[Silver Machine]]\". In 1975, he was fired from Hawkwind after an arrest for drug possession. That same year, he founded Motörhead. The band's success peaked around 1980 and 1981, including the hit single \"[[Ace of Spades (song)|Ace of Spades]]\" and the chart-topping live album ''[[No Sleep 'til Hammersmith]]'' (1981).\n\nLemmy continued to record and tour regularly with Motörhead until his death on 28 December 2015 in Los Angeles, where he had lived since 1990. He was diagnosed with [[prostate cancer]] two days before his death. Alongside his music career, he had minor roles and cameos in film and television. He was known for his hard-living, road-driven lifestyle, which included [[chain-smoking]] and daily consumption of large amounts of [[Alcoholic beverage|alcohol]] and [[amphetamine]].",
  "last_revision_date": "2026-01-27T06:13:54Z",
  "genres": [
    541,
    557,
    1060,
    1166,
    1169
  ]
}