{
  "name": "Leslie Cheung",
  "description": "'''Leslie Cheung Kwok-wing'''{{efn-ua|{{lang-zh|first=t|t=張國榮|s=张国荣|j=Zoeng1 Gwok3-wing4}}}} (born '''Cheung Fat-chung''';{{efn-ua|{{lang-zh|first=t|t=張發宗|s=张发宗|j=Zoeng1 Faat3-zung1}}}} 12 September 1956 – 1 April 2003) was a Hong Kong singer and actor. One of the most influential cultural icons in the [[Sinophone|Sinophone world]], Cheung was known for his debonair demeanor, flamboyant screen characters, and avant-garde, androgynous stage presence. Throughout his 26-year career, he released over 40 music albums and acted in 56 films.{{sfn|Leung|2008|p=85}}\n\nBorn in Kowloon, [[British Hong Kong]], Cheung studied in England from the age of 12 until he returned home in 1976. He garnered attention in 1977 when entering [[Rediffusion Television|RTV]]'s ''Asian Singing Contest'' and achieved popularity in 1984 with a hit single \"Monica\". Cheung is regarded as one of the founding fathers of [[Cantopop]] for defining the music genre in the 1980s. He announced his \"retirement\" from music in 1989 and emigrated to Canada the following year, but he returned to Hong Kong in 1994. His reemergence from the musical retirement in the late 1990s, particularly in his 1996 album ''[[Red (Leslie Cheung album)|Red]]'', was marked by sonic experimentation and daring imagery.\n\nIn addition to music, Cheung achieved pan-Asian fame with such films as ''[[A Better Tomorrow]]'' (1986) and ''[[A Chinese Ghost Story]]'' (1987). He won the [[Hong Kong Film Award for Best Actor|Best Actor]] at the 1991 [[Hong Kong Film Awards]] for his role in ''[[Days of Being Wild]]'' (1990), and became world-renowned for his performances in ''[[Farewell My Concubine (film)|Farewell My Concubine]]'' (1993) and ''[[Happy Together (1997 film)|Happy Together]]'' (1997). In April 2003, Cheung died by suicide by jumping off the [[Mandarin Oriental, Hong Kong|Mandarin Oriental]] hotel in Hong Kong.\n\nOne of the best-selling musical acts in Hong Kong history, Cheung's studio albums ''[[Summer Romance]]'' (1987) and ''[[Most Beloved]]'' (1995) each sold over 300,000 copies and are among the [[List_of_best-selling_albums_by_country#Hong_Kong|best-selling albums of all time in the territory]]. In recognition of his work in the film industry, Cheung was selected as one of the Top 100 Foreign Actors of the 20th Century by ''[[Kinema Junpo]]''. In 2010, [[CNN]] named him one of the 25 Greatest Asian Actors of All Time.",
  "last_revision_date": "2025-09-16T17:54:08Z",
  "genres": [
    205,
    726
  ]
}