{
  "name": "Little Richard",
  "description": "'''Richard Wayne Penniman''' (December 5, 1932 – May 9, 2020), better known by his stage name '''Little Richard''', was an American singer-songwriter and pianist. He was an influential figure in popular music and culture for seven decades. Described as the \"[[Architect of Rock and Roll]]\", Richard's most celebrated work dates from the mid-1950s, when his charismatic showmanship and dynamic music, characterized by frenetic piano playing, pounding backbeat and powerful raspy vocals, laid the foundation for [[rock and roll]]. Richard's innovative emotive vocalizations and uptempo rhythmic music played a key role in the formation of other popular music genres, including [[Soul music|soul]] and [[funk]]. He influenced singers and musicians across musical genres from rock to [[hip hop]]; his music helped shape [[rhythm and blues]] for generations. \n\n\"[[Tutti Frutti (song)|Tutti Frutti]]\" (1955), one of Richard's [[signature song]]s, became an instant hit, crossing over to the pop charts in the United States and the United Kingdom. His next hit single, \"[[Long Tall Sally]]\" (1956), hit No. 1 on the [[Hot R&B/Hip-Hop Songs|''Billboard'' Rhythm and Blues Best-Sellers]] chart, followed by a rapid succession of fifteen more in less than three years. In 1962, after a five-year period during which Richard abandoned rock and roll music for [[born-again Christianity]], concert promoter [[Don Arden]] persuaded him to tour Europe. During this time, [[the Beatles]] opened for Richard on some tour dates. {{Citation needed|date=May 2025}}\n\nRichard is cited as one of the first [[Crossover music|crossover]] black artists, reaching audiences of all races. His music and concerts broke the color line, drawing black and white people together despite attempts to sustain segregation. Many of his contemporaries, including [[Elvis Presley]], [[Buddy Holly]], [[Bill Haley]], [[Jerry Lee Lewis]], [[the Everly Brothers]], [[Gene Vincent]], [[Pat Boone]], and [[Eddie Cochran]], recorded covers of his works. {{Citation needed|date=May 2025}}\n \nRichard was honored by many institutions. He was inducted into the [[Rock and Roll Hall of Fame]] as part of its first group of inductees in 1986. He was also inducted into the [[Songwriters Hall of Fame]]. He was the recipient of Lifetime Achievement Awards from [[The Recording Academy]] and the [[Rhythm and Blues Foundation]]. In 2015, Richard received a Rhapsody & Rhythm Award from the [[National Museum of African American Music]]. \"Tutti Frutti\" was included in the [[National Recording Registry]] of the [[Library of Congress]] in 2010, which stated that his \"unique vocalizing over the irresistible beat announced a new era in music.\" \n\n{{Toclimit}}",
  "last_revision_date": "2025-06-19T19:56:11Z",
  "genres": [
    500,
    1113,
    1022,
    1015
  ]
}