{
  "name": "Lou Reed",
  "description": "'''Lewis Allan Reed''' (March 2, 1942{{spnd}}October 27, 2013) was an American musician and songwriter. He was the guitarist, singer, and principal songwriter for the rock band [[the Velvet Underground]] and had a solo career that spanned five decades. Although not commercially successful during its existence, the Velvet Underground came to be regarded as one of the most influential bands in the history of [[underground music|underground]] and [[alternative rock]] music. Reed's distinctive deadpan voice, poetic and [[Transgressive art|transgressive]] lyrics, and experimental guitar playing were trademarks throughout his long career.\n\nReed, [[John Cale]], [[Sterling Morrison]], and [[Angus MacLise]] formed the Velvet Underground in 1965. After building a reputation in the avant garde music scene, the Velvet Underground gained the attention of [[Andy Warhol]], who became the band's manager. The Velvet Underground became something of a fixture at [[The Factory]], Warhol's art studio, and served as his \"house band\" for various projects. The band released its [[Velvet Underground & Nico|first album]], now with drummer [[Moe Tucker]] and featuring German singer [[Nico]], in 1967, and parted ways with Warhol shortly thereafter. Following several lineup changes and three more little-heard albums, Reed quit the band in 1970.\n\nAfter leaving the Velvet Underground, Reed embarked on a successful solo career, releasing twenty solo studio albums. His second album, ''[[Transformer (Lou Reed album)|Transformer]]'' (1972), was produced by [[David Bowie]] and arranged by [[Mick Ronson]]; it brought him mainstream recognition. The album is considered an influential landmark of the [[glam rock]] genre, anchored by Reed's most successful single, \"[[Walk on the Wild Side (Lou Reed song)|Walk on the Wild Side]]\". The less commercial but critically acclaimed ''[[Berlin (Lou Reed album)|Berlin]]'' peaked at No. 7 on the [[UK Albums Chart]]. ''[[Rock 'n' Roll Animal]]'' (a live album released in 1974) sold strongly, and ''[[Sally Can't Dance]]'' (1974) peaked at No. 10 on the [[Billboard 200|''Billboard'' 200]]. When Reed's work ceased to sell well, his drug addiction and alcoholism intensified. Reed achieved sobriety in the early 1980s, gradually returning to prominence with ''[[The Blue Mask]]'' (1982) and ''[[New Sensations]]'' (1984). He reached a critical and commercial career peak with his 1989 album ''[[New York (album)|New York]]''.\n\nReed participated in the re-formation of the Velvet Underground in the 1990s. He also made several more albums, including a collaboration album with [[John Cale]] titled ''[[Songs for Drella]]'' which was a tribute to their former mentor [[Andy Warhol]]. ''[[Magic and Loss]]'' (1992) would become Reed's highest-charting album on the UK Albums Chart, peaking at No. 6. He contributed music to two theatrical interpretations of 19th-century writers, one of which he developed into an album titled ''[[The Raven (Lou Reed album)|The Raven]]''. Reed was inducted into the [[Rock and Roll Hall of Fame]] as a member of the Velvet Underground in 1996 and as a solo act in 2015.",
  "last_revision_date": "2025-11-17T19:08:54Z",
  "genres": [
    66,
    496,
    974,
    1048
  ]
}