{
  "name": "Louis Jordan",
  "description": "'''Louis Thomas Jordan'''{{efn|Jordan favoured the French pronunciation of [[Louis (given name)|his name]] ({{IPAc-en|'|l|uː|i}}), commonly found in the southern United States}} (July 8, 1908 – February 4, 1975) was an American saxophonist, multi-instrumentalist, songwriter and bandleader who was popular from the late 1930s to the early 1950s. Known as \"[[Honorific nicknames in popular music|the King of the Jukebox]]\", he earned his highest profile towards the end of the swing era.\n\nSpecializing in the [[alto saxophone|alto sax]], Jordan played all forms of the saxophone, as well as piano and [[clarinet]]. He also was a talented singer with great comedic flair, and fronted his own band for more than twenty years. He duetted with some of the biggest solo singing stars of his time, including [[Bing Crosby]], [[Ella Fitzgerald]] and [[Louis Armstrong]]. \n\nJordan began his career in [[big-band]] swing jazz in the 1930s coming to the public's attention as part of [[Chick Webb]]'s hard swinging band, though he became better known as an innovative popularizer of [[jump blues]]—a swinging, up-tempo, dance-oriented hybrid of [[jazz]], [[blues]] and [[boogie-woogie]]. Typically performed by smaller bands consisting of five or six players, jump music featured shouted, highly [[syncopated]] vocals and earthy, comedic lyrics on contemporary urban themes. It strongly emphasized the rhythm section of piano, bass and drums; after the mid-1940s, this mix was often augmented by electric guitar. Jordan's band also pioneered the use of the [[electronic organ]].\n\nWith his dynamic bands that he called The [[Tympany Five]] no matter how many musicians were in it, Jordan mapped out the main parameters of the classic [[Rhythm and blues|R&B]], urban [[blues]] and early [[rock-and-roll]] genres with a series of highly influential [[78-rpm]] discs released by [[Decca Records]]. These recordings presaged many of the styles of black popular music of the late 1940s, 1950s and 1960s and exerted a strong influence on many leading performers in these genres. Many of his records were produced by [[Milt Gabler]] who, in his later production work, played Jordan's music for [[Bill Haley (musician)|Bill Haley]] as Haley wanted to transition from country & western to rock 'n' roll resulting in Haley's huge hit, \"[[Rock Around the Clock]]\".\n\nJordan was also an actor and a film personality. He appeared in 14 three-minute [[Soundies]] filmed for \"movie jukeboxes\" of the 1940s. He also worked as a specialty act in the Hollywood theatrical features ''[[Follow the Boys (1944 film)|Follow the Boys]]'' and ''[[Swing Parade of 1946]]''. His very successful musical short ''[[Caldonia (film)|Caldonia]]'' (1945) prompted three more feature films, all starring Jordan and his band: ''[[Beware (1946 film)|Beware]]''; ''[[Reet, Petite and Gone]]''; and ''[[Look-Out Sister]]''.\n\nJordan ranks fifth in the list of the most successful [[African-American]] recording artists according to [[Joel Whitburn]]'s analysis of ''[[Billboard magazine|Billboard]]'' magazine's [[R&B chart]], and was the most popular rhythm and blues artist with his jump blues recordings of the pre-rock n' roll era. Though comprehensive sales figures are not available, Jordan had at least four million-selling hits during his career and regularly topped the R&B \"race\" charts, reaching Number 1 a total of 18&nbsp;times, with 113 weeks in that spot over the years. He was also one of the first black recording artists to achieve significant [[Crossover (music)|crossover]] in popularity with the predominantly white mainstream American audience, having simultaneous [[record chart|top ten]] hits on the pop charts several times.",
  "last_revision_date": "2025-06-10T06:26:33Z",
  "genres": [
    617,
    1156,
    636,
    1020,
    1027
  ]
}