{
  "name": "All City Chess Club",
  "description": "At a performance in New Zealand in February 2010, Fiasco performed new material from the then-titled ''We Are Lasers'' for the first time. He claimed that the album was complete and waiting for a release date from his label, Atlantic Records. However, Atlantic feared that the record lacked commercial singles, and presented Fiasco with songs the label wanted him to record. Fiasco declined, as he was told he would not have any ownership of the songs. He explained, \"I don't think the label cares about an album...People just want their number-one record.\" For six months, the cause of the album's delay remained unclear to the public. In response, Fiasco's fans created an online petition demanding that Atlantic Records release ''[[Lasers (album)|Lasers]]''. The petition garnered considerable attention on hip hop blog sites as well as over 16,000 signatures. Fiasco stated that the petition \"brought [him] to tears\", and in response to the petition, Fiasco released a song titled \"B.M.F-Building Minds Faster\" to thank his fans.\n\nWhile waiting for ''Lasers'' to be released, Fiasco completed another album, titled ''[[Food & Liquor II: The Great American Rap Album Pt. 1|Food & Liquor II: The Great American Rap Album]]''. He was unsure if the ''Food and Liquor II'' would ever be released, though he released the song \"Go To Sleep\" from the record \"out of desperation\" to put out new music. He also pursued numerous side projects in the midst of the delay. In April 2010, Fiasco formed the hip hop collective All City Chess Club along with Pharrell, [[Asher Roth]], [[B.o.B]], [[The Cool Kids (duo)|The Cool Kids]], [[Charles Hamilton (rapper)|Charles Hamilton]], [[Blu (rapper)|Blu]], [[Diggy Simmons]], [[Wale (rapper)|Wale]], [[J. Cole]], & Dosage. The group has so far made one song, a remix of Fiasco's \"I'm Beamin\". Additionally, On July 16, 2010, Fiasco released his [[Rock music|rock]] side-project [[Japanese Cartoon (band)|Japanese Cartoon]]'s debut [[Extended play|EP]] ''In The Jaws of the Lords of Death''. Japanese Cartoon was influenced by a variety of musical genres, with Fiasco saying, \"I've always been a fan of all music...Hip hop is just something I actually know how to do but I always had aspirations to participate in other forms of music. Once I got to create some hip hop, it was like, 'Okay, what am I going to do now?' So my artistic side was like, 'Yo, let's do some rock music.'\"\n\nMore than two and a half years after the album's completion, ''Lasers'' was released on March 8, 2011. The first single from the record was \"[[The Show Goes On (song)|The Show Goes On]]\", which samples \"[[Float On (Modest Mouse song)|Float On]]\" by [[Modest Mouse]]. \"The Show Goes On\" debuted at number 57 on the ''Billboard'' Hot 100. The lead single peaked at number 9 since then. The producers involved on the album include Alex Da Kidd, King David \"The Future\" and Jerry \"Wonda\" Duplessis, while featured artists include [[Skylar Grey]], [[Trey Songz]], and [[John Legend]]. Upon the album's release, ''Lasers'' debuted at number one on the ''Billboard'' 200 chart, with first-week sales of 204,000 copies. Despite the album's commercial success, ''Lasers'' received mixed reviews from most music critics. Writing for [[AllMusic]], editor Andy Kellman gave the record three out of five stars and criticized its \"lumbering, overwrought choruses\", writing that \"If there is one [[Emcee (hip hop)|MC]] whose rhymes should not be dulled for the sake of chasing pop trends, it's Lupe Fiasco\". ''Lasers'', however, was nominated Best Rap Album, with \"The Show Goes On\" nominated for Best Rap Performance, and Best Rap Song at the [[2012 Grammy Awards]]. Lupe Fiasco later involved himself at the [[Occupy Wall Street]] movement where he donated tents and released a poem in support of the protesters. He also released his \"Friend of the People: I Fight Evil\" mixtape on [[Thanksgiving (United States)|Thanksgiving Day]].",
  "last_revision_date": "2025-05-11T06:29:16Z",
  "genres": [
    553,
    37
  ]
}