{
  "name": "Lynn Anderson",
  "description": "'''Lynn René Anderson''' (September 26, 1947 – July 30, 2015) was an American [[country music|country]] singer and television personality. Her  [[crossover (music)|crossover]] [[list of signature songs|signature recording]], \"[[Rose Garden (song)|Rose Garden]]\", was a number one hit internationally. She also charted five number one and 18 top-ten singles on the ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs|country songs]] chart.  Anderson is regarded as one of country music's most significant performers.{{sfn|Bufwack|Oermann|2003|p=337-39}}\n\nBorn in [[Grand Forks, North Dakota]], United States, she was raised in California by her mother, [[Liz Anderson]], who was also a country music artist. Daughter Lynn was signed to a recording contract to [[Chart Records]] in 1966 after she was heard singing along with her mother at an industry function. Previously she had recorded some demo tapes of her mother's songs and appeared on television in California on regional country music shows. In 1967, she had her first top ten hit with the single \"[[If I Kiss You (Will You Go Away)]]\". Soon after, Anderson joined the cast of ''[[The Lawrence Welk Show]]'', where she performed country music weekly to a national audience.\n\nIn 1970, Anderson signed with [[Columbia Records]], where she was produced by her first husband, [[Glenn Sutton]]. She had her biggest commercial success with \"Rose Garden\". The song reached positions on the ''Billboard'' country, pop, and adult contemporary charts, also charting in the Top-5 in 15 other countries and earning her a [[Grammy Award for Best Female Country Vocal Performance]]. Throughout the decade, Anderson also had number-one hits with \"[[You're My Man]]\", \"[[How Can I Unlove You]]\", \"[[Keep Me in Mind (Lynn Anderson song)|Keep Me in Mind]]\", and \"[[What a Man My Man Is (song)|What a Man My Man Is]]\". She also became a television personality, with appearances on ''[[The Tonight Show]]'', specials with [[Bob Hope]] and [[Dean Martin]], and her own prime-time specials.\n\nAfter a brief hiatus, Anderson returned with the studio album ''[[Back (Lynn Anderson album)|Back]]'' (1983). The album spawned three singles, including the top ten hit \"[[You're Welcome to Tonight]]\", with [[Gary Morris]]. She continued recording sporadically throughout the 1980s. This included a revival of the pop hit \"[[Under the Boardwalk]]\" and the studio album ''[[What She Does Best]]'' (1988). Anderson continued releasing new albums into the new millennium, such as 2004's ''[[The Bluegrass Sessions (Lynn Anderson album)|The Bluegrass Sessions]]''. Towards the end of her life, Anderson struggled with alcohol addiction, but continued performing until her death in 2015. For her work as a crossover artist, she was ranked on ''[[Rolling Stone]]'''s list of the \"100 Greatest Country Artists of All Time\" and ''[[Country Music Television|CMT]]''s \"40 Greatest Women of Country Music\".",
  "last_revision_date": "2025-09-25T15:08:10Z",
  "genres": [
    138,
    289,
    504,
    1276
  ]
}