{
  "name": "Lynyrd Skynyrd",
  "description": "'''Lynyrd Skynyrd''' ({{IPAc-en|l|ɛ|n|ər|d|_|ˈ|s|k|ɪ|n|ər|d}}, {{respell|LEN|ərd|_|SKIN|ərd}}) is an American [[Rock music|rock]] band formed in [[Jacksonville, Florida]] in 1964. The group originally formed as My Backyard and comprised [[Ronnie Van Zant]] (vocals), [[Gary Rossington]] (guitar), [[Allen Collins]] (guitar), [[Larry Junstrom]] (bass), and [[Bob Burns (drummer)|Bob Burns]] (drums). The band spent four years touring small venues under various names and with several lineup changes before deciding on \"Lynyrd Skynyrd\" in 1968. The band released its first album, ''[[(Pronounced 'Lĕh-'nérd 'Skin-'nérd)]]'', in 1973. By then, they had settled on a lineup that included bassist [[Leon Wilkeson]], keyboardist [[Billy Powell]], and guitarist [[Ed King]]. Burns left and was replaced by [[Artimus Pyle]] in 1974. King left in 1975 and was replaced by [[Steve Gaines]] in 1976. At the height of their fame in the 1970s, the band popularized the [[Southern rock]] genre with songs such as \"[[Sweet Home Alabama]]\" and \"[[Free Bird]]\". After releasing five studio albums and one live album, the band's career was abruptly halted on October 20, 1977, when [[Lynyrd Skynyrd plane crash|their chartered airplane crashed]], killing Van Zant, Steve Gaines, and backup singer [[Cassie Gaines]], and seriously injuring the rest of the band.\n\nLynyrd Skynyrd reformed in 1987 for a reunion tour with Ronnie's brother, [[Johnny Van Zant]], as lead vocalist. They continued to tour and record with Johnny Van Zant, and [[Rickey Medlocke]], who first wrote and recorded with the band from 1971 to 1972 before his return in 1996. Over the years, other founding members of the band have died either during or after their time in the band. In January 2018, Lynyrd Skynyrd announced [[The Last of the Street Survivors Farewell Tour|its farewell tour]], and continued touring until 2022. Members were still working on the band's fifteenth album at the time of Rossington's death in 2023, after which no founding members remained in the band.\n\nIn 2004, ''[[Rolling Stone]]'' magazine ranked Lynyrd Skynyrd No. 95 on its list of the \"100 Greatest Artists of All Time\". Lynyrd Skynyrd was inducted into the [[Rock and Roll Hall of Fame]] on March 13, 2006. As of 2023, the band has sold more than 38 million records in the United States. [[AllMusic]] called them \"the definitive Southern rock band\".",
  "last_revision_date": "2025-11-18T08:10:59Z",
  "genres": [
    140,
    292,
    533,
    1144
  ]
}