{
  "name": "Machine Head",
  "description": "'''Machine Head''' is an American [[Heavy metal music|heavy metal]] band from [[Oakland, California]]. The band was formed in 1991 by vocalist/guitarist [[Robb Flynn]], who remains the only original member of the band. Machine Head's aggressive musicianship made it one of the pioneering bands in the [[new wave of American heavy metal]]. Its current lineup comprises Flynn, bassist [[Jared MacEachern]], drummer Matt Alston and guitarist Reece Scruggs. Bassist [[Adam Duce]], guitarists [[Logan Mader]], [[Ahrue Luster]], [[Phil Demmel]] and [[Wacław Kiełtyka]], and drummers [[Tony Costanza]], [[Chris Kontos (drummer)|Chris Kontos]] and [[Dave McClain (musician)|Dave McClain]] are former members of the band; Mader and Kontos toured with the band in 2019 and 2020 as part of the 25th anniversary tour for its first album, ''[[Burn My Eyes]]'' (1994).\n\nMachine Head's first four albums earned the band a growing fan base in Europe; however, the band would not have success in the United States until later releases. The band drew controversy with its fourth album, ''[[Supercharger (album)|Supercharger]]'' (2001), which was released three weeks after the [[September 11 attacks]]; its only single, \"[[Crashing Around You]]\", and its music video (which featured burning buildings) was pulled from all media outlets. The band nearly disbanded in 2002 after negotiating off its label [[Roadrunner Records]] as a result of the controversy, however the band would eventually re-sign with the label.\n\nHaving experimented with elements of [[groove metal]] and [[nu metal]] in its early releases, Machine Head changed to a more traditional [[thrash metal]] sound and longer songs with its sixth album, ''[[The Blackening]]'' (2007), which drew critical acclaim and was chosen as Album of the Decade by ''[[Metal Hammer]]'' in 2010; the album's first single, \"[[Aesthetics of Hate]]\", also earned a [[Grammy Award]] nomination. The band achieved similar success with its next two albums, ''[[Unto the Locust]]'' (2011) and ''[[Bloodstone & Diamonds]]'' (2014), before again experimenting with nu metal on its ninth album, ''[[Catharsis (Machine Head album)|Catharsis]]'' (2018). Machine Head reverted to its groove and thrash metal roots on the follow-up album, ''[[Of Kingdom and Crown]]'' (2022), which was its first concept album. Their latest studio album is 2025's ''[[Unatoned]]''.\n\nMachine Head has released eleven studio albums, two live albums, one video album, 13 singles and 15 music videos. Four of the band's studio albums have been [[Music recording sales certification|certified silver]] in the United Kingdom, and the band's highest peak on the [[Billboard 200|''Billboard'' 200]] came with ''Bloodstone & Diamonds'' at number 21. As of 2013, the band has sold over three million records worldwide.",
  "last_revision_date": "2026-01-20T01:26:00Z",
  "genres": [
    39,
    525,
    881,
    1233
  ]
}