{
  "name": "Mahotella Queens",
  "description": "The '''Mahotella Queens''' is a South African female band formed in 1964 by music producer Rupert Bopape, consisting of [[Hilda Tloubatla]], [[Nobesuthu Mbadu]], and Amanda Nkosi. The group is noted for their distinct vocal harmony sound, guitar-led [[mbaqanga]] music, and fast stage dancing.\n\nBopape was a talent scout and producer at the independent Gallo Africa's subsidiary dedicated to black music, Mavuthela Music Company. He formed the Mahotella Queens as the company's resident girl group and the ensemble, often led by the deep-voiced male vocals of [[Mahlathini|Simon 'Mahlathini' Nkabinde]], went on to have many hit records during the 1960s. The Queens line-up during this period usually comprised Hilda Tloubatla, [[Juliet Mazamisa]], [[Ethel Mngomezulu]], Nobesuthu Mbadu and [[Mildred Mangxola]]. The Queens and Mahlathini were backed by Mavuthela's house band, the [[Makgona Tsohle]] Band (including Marks Mankwane on lead guitar and [[West Nkosi]] on alto saxophone). In 1972 the line-up of the Mahotella Queens disintegrated after royalty disagreements with Bopape; Mahlathini left the company in a similar dispute with the producer. However, with a change of membership, the Queens remained productive and popular into the 1970s and 1980s. In 1987, following the explosion of interest in South African music, the Queens line-up was rejigged and three of its original singers – Hilda Tloubatla, Nobesuthu Mbadu and Mildred Mangxola – returned to the group. In combination with Mahlathini, the group forged a successful international touring career that lasts to this day.\n\nIn spite of the deaths of Mahlathini, Marks Mankwane and West Nkosi during the late 1990s, the Mahotella Queens continue to perform and record in the 21st century. In 2013, long-serving member Mildred Mangxola retired from the group. She was replaced by a new recruit, Amanda Nkosi. Nobesuthu Mbadu died in 2021.",
  "last_revision_date": "2025-02-06T19:40:44Z",
  "genres": [
    729
  ]
}