{
  "name": "Malavoi",
  "description": "'''Malavoi''' was a [[Martinique|Martinican]] band consisting of Mano Césaire, Jean-Paul Soïme, Christian de Negri, Denis Dantin, and Marcel Rémion.  They formed in 1972, naming themselves after a kind of [[sugarcane]] and a street on [[Gorée]], a [[Senegal]]ese island. Many of the members were part of the '''Merry Lads''', a band from the [[Lycée Schoelcher]], and many had been students at [[Colette Franz]], a music school.\n\nMalavoi's style mixes French Antillean music with modern influences from across the Americas, especially Caribbean and [[Brazilian music]], as well as [[jazz]]. Their early popular singles included \"Albé\" and \"En lè mon là\".  The band was soon expanded to include saxophonist Bib Monville and pianist Paulo Rosine, who became the band's leader. The singers alternated and included Raymond Mazarin, Pierre Jabert, Maurice Marie-Louise, Pierre Pastel and Julien Constance.\n\nMalavoi's first album was ''Malavoi'', released in 1978 and featuring singer Ralph Thamar. The band broke up soon after, however, and didn't perform again until re-uniting under Rosine's leadership in 1981. Rosine greatly expanded the fiddle section, first to ten performers, then down to four with Philippe Porry taking over for Dantin, and also added Jean-José Lagier on cello. Malavoi's fame soon spread across the Caribbean and abroad with the 1983 album ''Zouel'', featuring Thamar on vocals along with Marie-José Alie. They played at the [[Printemps de Bourges]] in 1983 and at the Caribbean festival in [[Cartagena, Colombia|Cartagena]], and won the Caribbean music prize, the [[Maracas d'Or]], as well as scoring the film ''[[Rue Case Nègres]]'' [[:fr:Rue Cases-Nègres (film)|(fr)]].\n\nThey continued touring widely into the late 1980s, in the United States, France, Japan, Russia, Brazil, Canada and Ecuador. Thamar was replaced by Pipo Gertrude in 1988. In the early 1990s, the band's popularity continued to grow, and the membership expanded with the addition of singer Tony Chasseur. Their 1992 ''Matebis'' included collaborations with numerous Caribbean musicians, including [[Jocelyne Béroard]], [[Beethova Obas]], [[Kali (French singer)|Kali]], [[Edith Lefel]], [[Tanya Saint-Val]] [[:fr:Tanya Saint-Val|(fr)]] and [[Philippe Lavil]].\n\nMalavoi's leader, Paulo Rosine, died in 1993. He was replaced by [[José Privat]], while two French violinists, Jean-Luc Pino and Daniel Dato, also joined; the band's leader became Jean-Paul Soïme.",
  "last_revision_date": "2025-10-25T15:47:45Z",
  "genres": [
    122,
    190,
    1292,
    1308
  ]
}