{
  "name": "Manoj George",
  "description": "'''Manoj George''' is an Indian [[violinist]] and a [[music composer]]. He performed as the conductor, [[string instrument|string]] arranger, solo violinist and [[choral]] arranger of 3 Grammy Award Winning albums : ''Winds of Samsara'', in 2015, ''Divine Tides'' in 2022 for the [[Best New Age Album]] &  ''Divine Tides'' in 2023 as the Best Immersive Audio album. He is reported to be the first Indian violinist recognised by the [[National Academy of Recording Arts and Sciences]], The [[Grammys]], United States and the first [[Malayali]] violinist to receive the honour. Manoj George has won several accolades for his Music Compositions including a nomination to [https://www.hmmawards.com HollyWood Music in Media awards] and 3 [http://www.globalmusicawards.com Global Music Awards]. \n\nManoj George estimated to be performed at more than 3000 concerts around the globe. He has composed music for [[Malayalam Language|Malayalam]] and [[Kannada Language|Kannada]] films, documentary films, corporate movies and advertisements. He is the brand ambassador for YAMAHA Violins, ROLAND- Japan, CANTINI Electric Violins - Italy & STENTOR Violins - UK.\n\nOne of the best violinists known for his own compositions and noted for introducing contemporary styles on violin amalgamating western music with Indian classical. His experiments in Indian music with different styles of music from different parts of the world like blues, Latin, Indo jazz etc. brought him to be one of the famous violinists in India. He is an avid humanitarian and philanthropist, donating and raising money for beneficial causes and supporting charities.\n\nManoj George and Fr. Paul Poovathingal released [https://www.youtube.com/watch?v=9echIwvE0u0 ''Sarvesa''], a Sanskrit rendition of the Lord's Prayer. [[Pope Francis]] officially launched the track at the Vatican on November 20, 2024. \n\n[https://www.youtube.com/watch?v=9echIwvE0u0 Sarvesa] features performances by legendary singer [[Padma Vibhushan]] Dr. [[K. J. Yesudas]], Fr. Paul Poovathingal, [[Ricky Kej]], [[Rakesh Chaurasia]], the Los Angeles Orchestra, and a chorus of 100 priests and 100 nuns. It won the Global Music Awards 2025 for Best Production and Best Composition. ''Sarvesa'' ''is a'' noble project to help the brain development of children affected with autism, cerebral palsy and mental retardation through Neurologic Music Therapy by Chetana Ganashram.",
  "last_revision_date": "2025-04-18T14:23:19Z",
  "genres": [
    587,
    847,
    1048,
    1291
  ]
}