{
  "name": "Marc Rizzo",
  "description": "'''Marc Rizzo''' (born August 2, 1977) is an American musician, best known as the former lead guitarist of metal band [[Soulfly]]. He has featured on eight Soulfly albums: ''[[Prophecy (Soulfly album)|Prophecy]]'', ''[[Dark Ages (album)|Dark Ages]]'', ''[[Conquer (Soulfly album)|Conquer]]'', ''[[Omen (Soulfly album)|Omen]]'', ''[[Enslaved (Soulfly album)|Enslaved]]'', ''[[Savages (Soulfly album)|Savages]]'', ''[[Archangel (Soulfly album)|Archangel]]'', and ''[[Ritual (Soulfly album)|Ritual]]''. He has also released five solo instrumental albums: ''Marc Rizzo'', ''Colossal Myopia'', ''The Ultimate Devotion'', ''Legionnaire'', and ''Rotation''. Rizzo is also a member of [[Cavalera Conspiracy]], a side project with the co-founders of [[Sepultura]], Max and [[Igor Cavalera]]. The band released their debut album ''[[Inflikted]]'' in 2008, ''[[Blunt Force Trauma (album)|Blunt Force Trauma]]'' in 2011 and ''[[Pandemonium (Cavalera Conspiracy album)|Pandemonium]]'' in 2014. In March 2015, it was announced that Rizzo was playing guitar for [[Misfits (band)|Misfits]]. His only show with the band took place at Dutch Comic Con. Early in his career, he was known to wear a backpack on stage during the shows.\n\nWhile primarily regarded as a metal guitarist, Rizzo's solo work demonstrates an interest in a wide range of styles, combining elements of hard rock, metal, jazz, classical and flamenco guitar. 2007 saw him headline his first US tour to sell out venues across the country. In 2008, Rizzo's two solo records were released under Shrapnel Records and are available on iTunes (iTunes.com).\n\nRizzo was endorsed by [[Peavey Electronics|Peavey]] and [[Yamaha Corporation|Yamaha]], and traveled the world undertaking clinics for Peavey when his tour schedule allowed. Rizzo, as of 2009, is endorsed by [[B.C. Rich]]. A signature seven-string Stealth model has been built for him and made available for to the public as an import model in 2010. He has been using PRS SE Custom 24 seven-string guitars. He currently uses a Washburn seven-string single-cut guitar.\n\nIn 2004, Rizzo created the indie Phlamencore Records with younger brother Luke. Since has released two sampler CD's (international distro) and three full-lengths.\n\nRizzo grew up in [[Carlstadt, New Jersey]], where he attended [[Henry P. Becton Regional High School]].\n\nIn 2020, Rizzo started his new death metal side project Revenge Beast.{{citation needed|date=August 2021}}\n\nIn August 2021, Rizzo departed Soulfly after 18 years with the band.  Rizzo said in an interview that he got no support from Soulfly during the COVID-19 pandemic.  Rizzo went further saying “I was doing home renovations, working very hard, 10 hours a day,” he explained. “A Soulfly live record came out [last year, Live Ritual NYC MMXIX]. I never saw a dime of that. So basically, within the [first] six [or] seven months of Covid, I just said, ‘You know, man, I don't want this anymore. I gave you guys 18 years of my life, “And it was a great time. Back in the good years, it was great. But the last eight to 10 years have not been very good\".\n\nIn October 2021, Marc Rizzo returned to [[Ill Niño]], where he performed as their original guitarist from 1998 until his departure in 2003. He quietly left the band in late 2024.",
  "last_revision_date": "2025-05-06T22:24:30Z",
  "genres": [
    512,
    328,
    847,
    680,
    542
  ]
}