{
  "name": "Marc Bolan",
  "description": "'''Marc Bolan''' ({{IPAc-en|ˈ|b|oʊ|l|ə|n}} {{respell|BOH|lən}}; born '''Mark Feld'''; 30 September 1947&nbsp;– 16 September 1977) was an English guitarist, singer-songwriter and poet. He was a pioneer of the [[glam rock]] movement in the early 1970s with his band [[T. Rex (band)|T. Rex]]. Bolan strongly influenced artists of many genres, including glam rock, [[Punk rock|punk]], [[post-punk]], [[New wave music|new wave]], [[indie rock]], [[Britpop]] and [[alternative rock]]. He was posthumously inducted into the [[Rock and Roll Hall of Fame]] in 2020 as a member of T. Rex.\n\nIn the late 1960s, he rose to fame as the founder and leader of the [[psychedelic folk]] band Tyrannosaurus Rex, with whom he released four critically acclaimed albums and had one minor hit,  \"Debora\". Bolan had started as an acoustic singer-writer before heading into electric music prior to the recording of T. Rex's first single \"[[Ride a White Swan]]\", which went to number two in the UK singles chart. From 1970 to 1973, T. Rex achieved a level of popularity in the UK comparable to [[the Beatles]], with a run of eleven top ten singles, four of which reached number one: \"[[Hot Love (T. Rex song)|Hot Love]]\", \"[[Get It On (T. Rex song)|Get It On]]\", \"[[Telegram Sam]]\" and \"[[Metal Guru]]\". The 1971 album ''[[Electric Warrior]]'', with all songs written by Bolan, received critical acclaim, reached number 1 in the UK and became a landmark album in glam rock. From 1973, he started marrying rock with other influences, including [[funk]], [[soul music|soul]], [[gospel music|gospel]], [[disco]] and [[Rhythm and blues|R&B]].\n\nBolan died in a car crash in 1977. A memorial stone and bust of Bolan, [[Marc Bolan's Rock Shrine]], was unveiled at the site where he died in [[Barnes, London|Barnes]], west London. His musical influence as guitarist and songwriter is profound; he inspired many later acts over the following decades. Bolan's March 1971 appearance on the [[BBC]]'s music show ''[[Top of the Pops]]'', wearing glitter on his face, performing the UK chart topper \"Hot Love\" is cited as the start of the glam rock movement.\n\nMusic critic Ken Barnes called Bolan \"the man who started it all\". The 1971 album ''Electric Warrior'' has been described by [[AllMusic]] as \"the album that essentially kick-started the UK glam rock craze\". Producer [[Tony Visconti]], who worked with Bolan during his heyday, stated: \"What I saw in Marc Bolan had nothing to do with strings, or very high standards of artistry; what I saw in him was raw talent. I saw genius. I saw a potential rock star in Marc – right from the minute, the hour I met him.\"",
  "last_revision_date": "2025-12-19T22:08:15Z",
  "genres": [
    498,
    981,
    1052
  ]
}