{
  "name": "Margareth Menezes",
  "description": "'''Margareth Menezes da Purificação''' (born 13 October 1962) is a Brazilian singer and politician from [[Salvador, Bahia|Salvador]], Bahia.\n\nHer style is considered [[axé]] but her music also steers into [[samba]] and [[Música popular brasileira|MPB]] territory, at times drawing on African rhythms and reggae.\n\nMenezes is best known in Brazil for the debut single \"Faraó (Divindade do Egito)\" 1988 of [[Olodum]] and for \"Me Abraça e Me Beija\", a major hit in 1990. She also scored another hit with \"Dandalunda\", a song which became the unofficial anthem of the 2003 Salvador carnival.\n\nMenezes achieved superstardom in her native Bahia, but only moderate success in the rest of Brazil. She is famed for energetic live performances and regularly tours and performs at carnival celebrations.\n\nIn 1990, one of Menezes's tracks \"Elegibô (Uma Historia De Ifa)\" was used in the Mickey Rourke film ''[[Wild Orchid (film)|Wild Orchid]]''. This prompted [[Island Records]] in the US to release a compilation album of some of her older material from Brazil on their subsidiary label, Mango. The album, simply titled ''Elegibô'', was an instant hit, reaching # 1 on the ''[[Billboard (magazine)|Billboard]]'' World Music chart at a time when [[David Byrne (musician)|David Byrne]] was championing Brazilian music in the US. The title track itself became a regular staple at clubs playing so-called world music throughout the US and Europe. The album also received a full release in the UK, Germany and France. A single, \"Tenda do Amor\", was also released from the album in some European territories. Menezes toured internationally on the back of this album, generating a lot of press in the process. A second US-released follow-up album ''[[Kindala]]'', released late 1991, but repackaged in some territories from the Brazilian version of the same name, also achieved some success. This release also gave Menezes a minor hit album in France too.\n\nIn 2001, Menezes released the highly acclaimed ''Afropopbrasileiro'' (also known as \"''Maga''\") showcasing her trademark fusion of afro-Brazilian beats. The album was produced by [[Carlinhos Brown]] of [[Tribalistas (group)|Tribalistas]] fame and was well received in Brazil and internationally.\n\nMenezes also co-wrote and performed on the 2003 Tribalistas hit \"Passe Em Casa\", from the million-selling ''[[Tribalistas (2002 album)|Tribalistas]]'' album.\n\nHer 2005 single, \"Como Tu\", a duet with Brazilian superstar [[Ivete Sangalo]] was released amidst much hype because Sangalo was achieving platinum album sales at the time. The track reached the lower reaches of the airplay Top 30 in Brazil but failed to emulate the success of recent Sangalo hits. The hit single was lifted from Menezes' 2005 album release ''Pra Você''; the album received lukewarm reviews, possibly owing to a more poppier sound than previous releases. A second single, the reggae-tinged \"Miragem na esquina\" performed poorly at radio.\n\nIn 2006, the album ''Pra Você'' received a [[Grammy]] nomination for \"Best Brazilian Contemporary Pop Album\".\n\nMore recently, Menezes participated on the track \"Beijo Descarado\" by [[Timbalada]] which achieved some airplay success in Brazil during the 2007 Carnival celebrations.\n\nIn 2010, an acoustic version of her 2008 album ''Naturalmente'' was released. The album was recorded at Ilha dos Sapos and featured guests like [[Gilberto Gil]], Carlinhos Brown and Portuguese singer Luis Represas.\n\nMenezes remains one of the most dynamic and popular of the contemporary Brazilian artists achieving international recognition.\n\nShe became [[Ministry of Culture (Brazil)|Brazil's Minister of Culture]] on 1 January 2023.",
  "last_revision_date": "2025-06-27T01:31:02Z",
  "genres": [
    24,
    79,
    1058
  ]
}