{
  "name": "Marilyn Manson",
  "description": "'''Brian Hugh Warner''' (born January 5, 1969), known professionally as '''Marilyn Manson''', is an American rock musician. He is the lead singer and the only original member remaining of the [[Marilyn Manson (band)|same-titled band]] he founded in 1989. The band members initially created their stage names by combining the first name of an American female [[sex symbol]] with the last name of a male [[serial killer]]. The singer derived his name from the actress [[Marilyn Monroe]] and cult leader [[Charles Manson]]. \n\nIn the 1990s, the band released the albums ''[[Portrait of an American Family]]'' (1994), ''[[Antichrist Superstar]]'' (1996) and ''[[Mechanical Animals]]'' (1998), which included hit singles such as \"[[The Beautiful People (song)|The Beautiful People]]\", \"[[Tourniquet (Marilyn Manson song)|Tourniquet]]\", \"[[The Dope Show]]\" and \"[[Rock Is Dead (Marilyn Manson song)|Rock Is Dead]]\". The band's 2000 album ''[[Holy Wood (In the Shadow of the Valley of Death)]]'' is a direct response to [[mainstream media]], who blamed Manson for supposedly [[Marilyn Manson–Columbine High School massacre controversy|influencing the perpetrators]] of the [[Columbine High School massacre]]. Three of the band's albums have been awarded [[music recording sales certification#Certification thresholds|platinum]] status and three more went gold, and they have had eight top-ten albums and two number-one albums on the [[Billboard 200|''Billboard'' 200]]. He has been ranked at No. 44 on the list of the \"Top 100 Heavy Metal Vocalists\" by ''[[Hit Parader]]'' and, along with his band, has been nominated for five [[Grammy Awards]].  \n\nManson is widely considered one of the most controversial figures in [[heavy metal music|heavy metal]]. In addition to the Columbine tragedy, his lyrics have been criticized by American politicians and examined in [[congressional hearing]]s, with several U.S. states creating legislation specifically banning the group from performing in state-operated venues. His paintings and films appeared as evidence in a [[Murder of Jodi Jones|murder trial]], and he has been accused of inspiring several other murders and school shootings. Outside of music, he made his film debut as an actor in [[David Lynch]]'s ''[[Lost Highway (1997 film)|Lost Highway]]'' (1997), and has since appeared in a variety of minor roles and cameos. In 2002, his first art show, ''The Golden Age of Grotesque'', was held at the [[Los Angeles Contemporary Exhibitions]] center.\n\nIn 2021, former partner [[Evan Rachel Wood]] accused Manson of psychological and sexual abuse, allegations which Manson denied. Other women followed with similar accusations, with five women suing him in civil court. One of these lawsuits was withdrawn after the accuser recanted her allegations and alleged Wood pressured her to accuse Manson. He sued Wood for defamation, but later dropped the lawsuit after substantial portions of the suit were dismissed by Wood's [[anti-SLAPP]] motions, agreeing to pay her legal fees. A four-year criminal investigation of the abuse allegations by the [[Los Angeles County Sheriff's Department]] concluded in 2025, which resulted in no charges filed against Manson due to the expiration of the [[statute of limitations]] and a lack of evidence.",
  "last_revision_date": "2025-08-15T02:00:17Z",
  "genres": [
    39,
    510,
    591,
    595,
    1099
  ]
}