{
  "page_title": "Martinho da Vila",
  "description": "'''Martinho da Vila''' (born February 12, 1938) is a Brazilian singer and composer who is considered to be one of the main representatives of [[samba]] and [[Música popular brasileira|MPB]]. He is a prolific songwriter, with hundreds of recorded songs across over 40 solo albums. He also has many songs that were recorded by singers from different musical genres.\n\nInternationally celebrated artists such as [[Nana Mouskouri]] (Greece), [[Ornella Vanoni]] (Italy), [[Katia Guerreiro]] (Portugal), [[Rosario Flores]] (Spain) have put their voices to Martinho’s songs and lyrics.\n\nAs a singer, he is considered by critics as one of the top exponents of samba to have ever lived. Among his many national collaborations, a few notable names are [[Zeca Pagodinho]], [[Arlindo Cruz]], [[Chico Buarque]], [[Beth Carvalho]], [[Noel Rosa]], [[Alcione Nazareth|Alcione]], among others. Furthermore, Martinho composed some of the most important samba enredos (samba school themed songs) and has forged a solid partnership with the [[Vila Isabel]] samba school.\n\nIn spite of being a self-taught singer / songwriter with no academic background, Martinho has a great connection with classical music. He participated in the symphonic project \"Samba Classics\" under the baton of the late Maestro Silvio Barbato, which went on to be performed by several classical orchestras such as the Belo Horizonte, Brasilia, and Espirito Santo Orchestras, as well as the Orquestra Petrobras and the Orfeônica of Denmark. He also devised, in partnership with Maestro Bruno Leonardo, the Black Concert, a Symphonic performance that focuses on the participation of black musicians in classical music.\n\nIn addition to being a celebrated singer and songwriter, Martinho is also a writer and author of 13 books: Notable works include ''Os Lusófonos'', republished in Portugal, as well as ''Joanna and Joanes - A Fluminense Romance'', and ''Ópera Negra'', which was later translated into French. At the Book Fair in Paris in 2015, Martinho released his novel ''Os Lusófonos''.\n\nAs a journalist, Martinho writes articles for ''[[O Globo]]'', ''[[Folha de São Paulo]]'' and ''O Estadão'' newspapers, several magazines, and, for two years, he was a weekly columnist of the newspaper ''[[O Dia]]''.\n\nHe is also politically active and a prominent figure and spokesperson for [[Afro-Brazilian]] issues as well as for the [[Communist Party of Brazil]]. He is the author of six books, and has been a recording artist since 1969.\n\nApart from his own interpretations, [[Simone Bittencourt de Oliveira|Simone]] stands out as one of his greatest interpreters, with a whole album dedicated to him, entitled ''Café com leite''.",
  "last_revision_date": "2024-12-27T10:44:05Z"
}