{
  "name": "MC5",
  "description": "'''MC5''' was an American [[rock music|rock]] band formed in [[Lincoln Park, Michigan]], in 1963. The classic lineup consisted of vocalist [[Rob Tyner]], guitarists [[Wayne Kramer]] and [[Fred \"Sonic\" Smith]], bassist [[Michael Davis (bassist)|Michael Davis]], and drummer [[Dennis Thompson (drummer)|Dennis Thompson]]. MC5 were listed by ''[[Parade (magazine)|Parade]]'' as one of the best rock bands of all time and by [[VH1]] as one of the greatest hard rock artists of all time.\nThe band's first three albums are regarded by many as staples of rock music, and their 1969 song \"[[Kick Out the Jams (song)|Kick Out the Jams]]\" is widely covered.\n\n\"Crystallizing the [[Counterculture of the 1960s|counterculture]] movement at its most volatile and threatening\", according to [[AllMusic]] critic [[Stephen Thomas Erlewine]], MC5's [[Left-wing politics|leftist]] political ties and [[anti-establishment]] lyrics and music positioned them as emerging pioneers of the punk movement in the United States.{{Citation needed|date=May 2020}} Their loud, energetic style of back-to-basics [[rock and roll]] included elements of [[garage rock]], [[hard rock]], [[blues rock]], and [[psychedelic rock]]. [[Rage Against the Machine]] guitarist [[Tom Morello]] described MC5 as having \"basically invented [[punk rock]].\"\n\nMC5 had a promising beginning that earned them a January 1969 cover appearance on ''[[Rolling Stone]]'' and a story written by [[Eric Ehrmann]] before their debut live album was released. They developed a reputation for energetic and polemical live performances, one of which was recorded as their 1969 debut album ''[[Kick Out the Jams]]''. The band released the albums ''[[Back in the USA (album)|Back in the USA]]'' and ''[[High Time (MC5 album)|High Time]]'' before disbanding in 1972.\n\nVocalist Tyner died of a heart attack in late 1991 at the age of 46 and was followed by Fred Smith, who also died of a heart attack, in 1994 at the age of 46. The remaining three members reformed in 2003 with [[the Dictators]]' singer [[Richard Manitoba|Handsome Dick Manitoba]] as its new vocalist, and this reformed lineup occasionally performed live over the next nine years until Davis died of liver failure in 2012 at the age of 68.\n\nIn 2022, Kramer announced that a tour under the banner of ''We Are All MC5'' would take place that spring, and that a new MC5 studio album with producer [[Bob Ezrin]] would also be released later that year with original MC5 drummer Dennis Thompson playing on two tracks. In 2023, Kramer announced that the album would be released in the spring of 2024. Kramer died February 2, 2024, leaving Thompson as the only surviving original member of the band. In 2024, the MC5 were inducted into the [[Rock and Roll Hall of Fame]] in the musical excellence category. On May 8, 2024, Thompson died at the age of 75. ''[[Heavy Lifting]]'', their final album, was released on October 18, 2024.",
  "last_revision_date": "2025-05-15T07:22:16Z"
}