{
  "name": "McDonald Craig",
  "description": "'''McDonald 'Mack' Craig''' (April 11, 1931 – September 26, 2021) was an American folk musician and farmer. A member of the Mid-American Country Music Hall of Fame, Craig's style was influenced by and has been compared in style to country music singer [[Jimmie Rodgers]]. Influenced by his family's musical tradition Craig committed much of Rodgers's work to memory, and his performances bridged folk and popular styles. \n\nIn the mid-1960s, Craig recorded four singles with Nashville-based Gold Standard Records. He did not release any professional recordings or albums until 2002, when ''McDonald Craig Sings Traditional Country Music'' was released on Roughshod Records. In addition to these recordings, Craig toured folk music festivals and appeared on broadcast radio, including [[Midnite Jamboree|Ernest Tubb's Midnite Jamboree]]. In 1978, Craig won the talent competition at the Jimmie Rodgers Music Festival held in [[Meridian, Mississippi]], the same music festival that a young [[Elvis Presley]] had won 25 years before, becoming the first and only African American artist to do so. Organizers were reluctant to present him with the reward due to his race, but at the insistence of the judges it was eventually given to him. \n\nCraig served in the [[United States Army]] during the [[Korean War]], receiving a Bronze Star medal in 1953 for his leadership of a [[recoilless rifle]] platoon. After his military service, Craig settled down with his wife Rosetta and took over operation of the [[Craig Family Farm|family farm]], which was later listed on the [[National Register of Historic Places]] in recognition of its significance in the history of Black farmers in Tennessee. In 1954, in response to the county's decision to bus Black students to a neighboring county to attend high school, Craig purchased a school bus and accepted the job to drive students the 35 miles to school each way.",
  "last_revision_date": "2026-01-26T13:31:48Z",
  "genres": [
    1318
  ]
}