{
  "name": "Meg White",
  "description": "'''Megan Martha White''' (born December 10, 1974) is an American retired musician who achieved international fame as the drummer of the rock duo [[the White Stripes]]. Though she typically performed backing vocals for the band, she occasionally sang lead, including in the song \"[[In the Cold, Cold Night]]\".\n\nWhite was born in [[Grosse Pointe Farms, Michigan]], and worked as a chef after finishing high school. She met [[Jack White]] in the 1990s, and the two married in 1996. She began playing the drums on [[Bastille Day]] in 1997 and formed the White Stripes with Jack later that year. They divorced in 2000, but continued performing at her insistence and publicly presented themselves as siblings. The band's 2001 breakthrough album, ''[[White Blood Cells]]'', brought them international fame. This, along with the band's [[The White Stripes discography#Albums|three subsequent albums]] released throughout the decade, established White as a key artist of the 2000s [[garage rock revival]]. Her minimalist approach to drumming sparked an ongoing debate throughout the decade.  \n\nOutside of music, White pursued acting, appearing in the 2003 ''[[Coffee and Cigarettes]]'' and in a [[Jazzy and the Pussycats|2006 episode]] of ''[[The Simpsons]]'', and a short modeling career. While the band were on tour in support of their 2007 album, ''[[Icky Thump]]'', she suffered a bout of acute anxiety, leading to a cancellation of the remaining tour dates. During the interim, she appeared at a [[The Raconteurs|Raconteurs]] concert and in the 2009 documentary [[Under Great White Northern Lights|''Under Great White Northern Lights'']]. She was also married to Jackson Smith from 2009 to 2013. After a [[The White Stripes#2009–2011: Final years and breakup|lengthy hiatus]], the White Stripes disbanded in 2011 and White ceased performing. Her last media appearance was in 2009, and she has not been active in the industry since.  \n\nWhite's playing style, which has been called \"minimalistic\" and \"primal\", initially polarized critics but has earned retrospective praise and continues to be discussed. She is also noted for her elusive media image, calling herself \"very [[Shyness|shy]]\" and reclusive. With the White Stripes, she won six [[Grammy Awards]] from twelve nominations. In 2015, ''[[Rolling Stone]]'' included her on their \"100 Greatest Drummers of All Time\" list. She will be [[List of Rock and Roll Hall of Fame inductees|inducted]] into the [[Rock and Roll Hall of Fame]] in 2025 as a member of the White Stripes.",
  "last_revision_date": "2025-06-20T09:39:32Z",
  "genres": [
    139,
    40,
    964,
    575,
    481
  ]
}