{
  "description": "'''Menudo''' is a Puerto Rican [[boy band]] formed by producer [[Edgardo Díaz]]. Referred to as the \"most iconic Latino pop music band\", they have been ranked as one of the biggest boy bands of all time by several publications, including ''[[Billboard (magazine)|Billboard]]'', ''[[Us Weekly]]'', ''[[Seventeen (American magazine)|Seventeen]]'', and ''[[Teen Vogue]]'', being the only Latin band on their lists.\n\nThe band had several radio hits during its career. They acted in a television film (1979's ''Leyenda de Amor'') and two feature films, ''[[Una aventura llamada Menudo|An Adventure Called Menudo]]'' (''Una aventura llamada Menudo'') and ''[[Menudo: La Película|Menudo: The Movie]]'' (''Menudo: La Película''), in three [[mini series]] entitled \"I Want to Be\", \"It's for Love\" and \"Forever Friends\" (\"Quiero Ser\", \"Es Por Amor\" and \"Por Siempre Amigos\") and another television mini-series named ''Panchito and Arturo'' (''Panchito y Arturo'').\n\nMenudo was distinctive in that the members of the band were let go at around age 17 , that is when their voice breaks, and younger vocalists took their place. In fact over the course of the band's history, it had run through more than fifty members, for this very reason. At any one time however, the Menudo band was always composed of five male teenagers. \n\nMenudo's original lineup consisted of five boys: brothers [[Fernando and Nefty Sallaberry]] (ages 12 and 13); the Melendez brothers, [[Carlos Meléndez (singer)|Carlos Meléndez]], (age 12), [[Óscar Meléndez]], (age 11), and [[Ricky Meléndez]], (age 9); the latter three are Díaz's cousins. The band's golden-era lineup{{According to whom|date=December 2024}} consisted of members Ricky Meléndez, [[Johnny Lozada]], [[René Farrait]], [[Miguel Cancel]], [[Xavier Serbiá]], [[Charlie Masso]] and [[Ray Reyes]]. It was also a starting point for popular international stars like [[Ricky Martin]] (1984–89) and [[Draco Rosa]] (1984–87), who were members of the band in the mid-1980s.\n\nEntering the 1990s their popularity started to wane amid allegations of drug use. In 1997, the rights and the name Menudo were sold. The remaining members continued to perform as [[MDO (band)|MDO]] until their official disbandment in 2002. However, this iteration has continued to perform sporadically since. New management of Menudo formed a new line-up in 2007, releasing an EP but disbanding in 2009. Some of the members of the \"golden era\" of the band reunited in 1998 under the name [[El Reencuentro]] and in 2019 for the \"Get on My Motorcycle\" (\"Súbete a Mi Moto Tour\").\n\nMenudo is estimated to have sold 20 million albums worldwide and has generated over 300 million US dollars.",
  "last_revision_date": "2025-06-13T04:49:03Z"
}