{
  "description": "'''Mercyful Fate''' is a Danish [[Heavy metal music|heavy metal]] band from [[Copenhagen]], formed in 1981 by vocalist [[King Diamond]] and guitarist [[Hank Shermann]]. Influenced by [[progressive rock]] and [[hard rock]], and with lyrics dealing with [[LaVeyan Satanism]] (often with [[Irony|ironic]] or [[Sardonicism|sardonic]] use of [[Christianity|Christian]] themes) and the [[occult]], Mercyful Fate was part of the [[first-wave black metal|first wave of black metal]] in the early to mid-1980s, along with [[Venom (band)|Venom]] and [[Bathory (band)|Bathory]]. The band is also cited as a formative influence on many then-up-and-coming subgenres of heavy metal, including [[thrash metal]] and [[death metal]], as well as the [[Music_of_Norway#Black_metal|Norwegian black metal]] scene.\n\nSince its inception in 1981, Mercyful Fate has released seven studio albums, two [[extended play]]s, and four [[Compilation album|compilation]]s. After several line-up changes and self-made demos, they released their [[Mercyful Fate (EP)|self-titled EP]] in 1982, with the line-up of [[King Diamond]] (vocals), Hank Shermann (lead and rhythm guitars), Michael Denner (rhythm and lead guitars), [[Timi Hansen]] (bass) and Kim Ruzz (drums). With this line-up, the group recorded their first two studio albums: 1983's ''[[Melissa (Mercyful Fate album)|Melissa]]'' and 1984's ''[[Don't Break the Oath]]''. In spite of their reputation as one of the most acclaimed bands of the European heavy metal scene of the 1980s, Mercyful Fate were the subject of controversy due to their satanic imagery, and one of their songs \"Into the Coven\" (from ''Melissa'') later gained notoriety for appearing as one of the [[Parents Music Resource Center|PMRC]]'s \"Filthy Fifteen\" list of objectionable songs.\n\nAfter disbanding in 1985 due to musical differences, four out of the five members of Mercyful Fate reunited in 1992 and recorded the album ''[[In the Shadows (album)|In the Shadows]]'', which was released the following year. During the 1990s, the band released four more studio albums and went through several line-up changes. Mercyful Fate went on hiatus in 1999, but had reunited on occasion during the 2000s. On August 1, 2019, it was announced that Mercyful Fate was reuniting on a more permanent basis, with plans to tour and release a new album, which will be their first since ''[[9 (Mercyful Fate album)|9]]'' in 1999.",
  "last_revision_date": "2025-06-13T18:56:54Z"
}