{
  "description": "'''Daniel Dumile'''{{efn|Dumile's [[birth certificate]] provides his name as \"Dumile Daniel Thompson\". Variations like \"Daniel Dumile Thompson\" and \"Dumile Thompson Dumile\" appear in other records. In his life as a public figure, \"Daniel Dumile\" was the name most commonly used to refer to him.<ref name=yoo2021 />}} (born '''Dumile Daniel Thompson'''; {{IPAc-en|ˈ|d|uː|m|ə|l|eɪ}} {{respell|DOO|mə|lay}}; July 13, 1971{{spnd}}October 31, 2020), also known by his stage name '''MF Doom''' or simply '''Doom''' (both mostly stylized in [[all caps]]), was a British and American rapper, songwriter, and record producer. Noted for his intricate wordplay, signature metal mask, and \"[[supervillain]]\" stage persona, he became a major figure of [[underground hip hop]] and [[alternative hip hop]] in the 2000s.\n\nDumile was born in London and raised in [[Long Beach, New York]]. He began his career in 1988 as a member of the trio [[KMD]], performing as '''Zev&nbsp;Love&nbsp;X'''. The group disbanded in 1993 after the death of [[DJ Subroc]], Dumile's brother. After a hiatus, Dumile reemerged in the late 1990s. He began performing at [[open mic]] events while wearing a metal mask resembling that of the [[Marvel Comics]] supervillain [[Doctor Doom]], who is depicted on the cover of his 1999 debut solo album ''[[Operation: Doomsday]]''. He adopted the MF Doom persona and rarely made unmasked public appearances thereafter.\n\nDuring Dumile's most prolific period, the early to mid-2000s, he released the acclaimed ''[[Mm..Food]]'' (2004) as MF Doom, as well as albums released under the pseudonyms '''King Geedorah''' and '''Viktor Vaughn'''. ''[[Madvillainy]]'' (2004), recorded with the producer [[Madlib]] under the name [[Madvillain]], is often cited as Dumile's ''[[magnum opus]]'' and is regarded as a landmark album in hip hop. ''Madvillainy'' was followed by another acclaimed collaboration, ''[[The Mouse and the Mask]]'' (2005), with the producer [[Danger Mouse (music producer)|Danger Mouse]], released under the name [[Danger Doom]].\n\nThough he lived most of his life in the United States, Dumile never gained American citizenship; in 2010, he was denied reentry after returning from an international tour for his sixth and final solo album, ''[[Born Like This]]'' (2009). He moved to London before settling in [[Leeds]] and worked mostly in collaboration with other artists during his final years, releasing albums with [[Jneiro Jarel]] (as [[JJ Doom]]), [[Bishop Nehru]] (''[[NehruvianDoom]]''), and [[Czarface]] (''[[Czarface Meets Metal Face]]'', and the posthumous ''[[Super What?]]''). On Halloween 2020, he died in a Leeds hospital from [[angioedema]] following a reaction to a [[ACE inhibitor|blood pressure medication]]. After his death, ''[[Variety (magazine)|Variety]]'' described him as one of hip hop's \"most celebrated, unpredictable and enigmatic figures\".",
  "last_revision_date": "2025-05-13T07:20:19Z"
}