{
  "page_title": "Mike McClure",
  "description": "'''Mike McClure''' (born July 6, 1971) is an American singer, songwriter, and producer from [[Tecumseh, Oklahoma]]. He is currently the frontman for the Mike McClure Band. McClure is a founding member of [[The Great Divide (band)|The Great Divide]], and was a member until he and the band parted ways in 2002. The Mike McClure Band consists of McClure (guitar, vocals), and Caleb Shirtum (bass).\n\nMcClure got his start in [[Stillwater, Oklahoma]], and would hang out and play music at the notorious \"Farm\" with other [[Red Dirt (music)|Red Dirt]] artists such as [[Bob Childers]], Tom Skinner, and Scott Evans. After forming The Great Divide with J.J. Lester, Scotte Lester, and Kelley Green in 1992 and contributing to six studio albums and one live two-part album, McClure set out to do his own thing.\n\nIn 2002, while still a member of The Great Divide, he released [[Twelve Pieces]], his first solo album. When Mcclure initially formed his own band, it featured Les Paul Clanton on bass and Rodney Pyeatt on guitar. Both went to do other projects. After recruiting Tom Skinner (bass) and Eric Hansen (drums), McClure had his band together. In 2004, The Mike McClure Band released their first album [[Everything Upside Down]], a hard-hitting rock album. McClure often uses the quote that his new band is \"twice as loud, and half as popular.\" Since the first album, the band has put out seven more albums, including the 2004 collaboration with the Burtschi Brothers of [[Norman, Oklahoma]].  After the death of Tom Skinner in July 2015 and the departure of Hansen, the band took on its current look.\n\nAs a songwriter and producer, McClure has collaborated with many other Red Dirt artists. He has become the permanent producer for [[Cross Canadian Ragweed]]. Usually contributing also as a songwriter, he has produced five of their seven studio albums, jokingly earning him the title of \"prodouchebag\". McClure has also produced albums by other artists around the scene such as [[Stoney LaRue]], [[Jason Boland & the Stragglers]], [[Scott Copeland]], Johnny Cooper, [[Whiskey Myers]], and the [[Turnpike Troubadours]].\n\nIn 2011 McClure produced and recorded with  [http://www.damnquails.com The Damn Quails], releasing \"Down the Hatch\"  in October 2011.\n\nIn 2014, McClure produced and recorded [http://www.chrisbrazealband.com The Chris Brazeal Band], releasing their 3rd album \"A Heart Like Yours\" in September 2014. He appears on their cover of Hal Ketchum's \"Small Town Saturday Night\"\n\nOn February 27, 2022 he was inducted into the Oklahoma Music Hall of Fame.",
  "last_revision_date": "2025-01-27T02:34:32Z"
}