{
  "name": "Milva",
  "description": "'''Maria Ilva Biolcati''' ({{IPA|it|maˈriːa ˈilva bjolˈkaːti|lang}}; 17 July 1939 – 23 April 2021), known as '''Milva''' ({{IPA|it|ˈmilva|lang}}), was an Italian singer, stage and film actress, and television personality. She was also known as ''La Rossa'' (Italian for \"The Redhead\"), due to the characteristic colour of her hair, and additionally as ''La Pantera di Goro'' (\"The Panther of [[Goro, Emilia–Romagna|Goro]]\"), which stemmed from the Italian press having nicknamed the three most popular Italian female singers of the 1960s, combining the names of animals and the singers' birthplaces. The colour also characterised her leftist political beliefs, claimed in numerous statements. Popular in Italy and abroad, she performed on musical and theatrical stages the world over, and received popular acclaim in her native Italy, and particularly in Germany and Japan, where she often participated in musical events and televised musical programmes. She released numerous albums in France, Japan, Korea, Greece, Spain, and South America.\n\nShe collaborated with European composers and musicians including [[Ennio Morricone]] in 1965, [[Francis Lai]] in 1973, [[Mikis Theodorakis]] in 1978 (''Was ich denke'' became a best selling album in Germany), [[Enzo Jannacci]] in 1980, [[Vangelis]] in 1981 and 1986, and [[Franco Battiato]] in 1982, 1986 and 2010.\n\nHer stage productions of [[Bertolt Brecht]]'s recitals and [[Luciano Berio]]'s operas toured the world's theatres. She performed at [[La Scala]] in Milan, at the [[Deutsche Oper Berlin|Deutsche Oper]] in Berlin, at the [[Paris Opera]], in the [[Royal Albert Hall]] in London and at the [[List of Edinburgh festivals|Edinburgh Festival]], amongst others.\n\nHaving had success both in Italy and internationally, she remained one of the most popular Italian personalities in the fields of music and theatre. Her artistic stature was officially recognised by the Italian, German and French Republics, each of which bestowed her with the highest honours. She was the only Italian artist in contemporary times who was simultaneously: [[Legion of Honour|Chevalier of the National Order of the Legion of Honour of the French Republic]] (Paris, 11 September 2009), [[Order of Merit of the Italian Republic|Commander of the Order of Merit of the Italian Republic]] (Rome, 2 June 2007), [[Order of Merit of the Federal Republic of Germany|Officer of the Order of Merit of the Federal Republic of Germany]] (Berlin, 2006), and [[Ordre des Arts et des Lettres|Officier]] of the [[Ordre des Arts et des Lettres]] (Paris, 1995).",
  "last_revision_date": "2026-01-15T13:03:17Z",
  "genres": [
    225,
    623,
    950,
    1103,
    1212
  ]
}