{
  "name": "Moby",
  "description": "'''Richard Melville Hall''' (September 11, 1965), known professionally as '''Moby''', is an American musician, songwriter and [[animal rights]] activist. He has sold 20 million records worldwide. [[AllMusic]] considers him to be \"among the most important [[electronic dance music|dance music]] figures of the early 1990s, helping bring dance music to a mainstream audience both in the United States and the United Kingdom\".\n\nAfter taking up guitar and piano at age nine, he played in several underground punk rock bands through the 1980s (Vatican Commandos, Flipper, Ultra Vivid Scene) before turning to electronic dance music. In 1989, he moved to New York City and became a prolific figure as a DJ, producer and remixer. His 1991 single \"[[Go (Moby song)|Go]]\" was his mainstream breakthrough, especially in Europe, where it peaked within the top ten of the charts in the Netherlands and the United Kingdom. Between 1992 and 1997 he scored eight top 10 hits on the [[Dance Club Songs|''Billboard'' Dance Club Songs]] chart including \"[[Move (Moby song)|Move (You Make Me Feel So Good)]]\", \"[[Feeling So Real]]\", and \"[[James Bond Theme#Moby's remix|James Bond Theme (Moby Re-Version)]]\". Throughout the decade he also produced music under various pseudonyms, released the critically acclaimed ''[[Everything Is Wrong (album)|Everything Is Wrong]]'' (1995). His punk-oriented album ''[[Animal Rights (album)|Animal Rights]]'' (1996) alienated much of his fan base.\n\nMoby found commercial and critical success with his fifth album ''[[Play (Moby album)|Play]]'' (1999), which, after receiving little recognition, became an unexpected global hit in 2000. It remains his highest selling album with 12 million copies sold. Its seventh single, \"[[South Side (song)|South Side]]\", featuring [[Gwen Stefani]], appeared on the US [[Billboard Hot 100|''Billboard'' Hot 100]], reaching No. 14. Moby followed ''Play'' with albums of varied styles including electronic, dance, rock, and [[downtempo]] music, starting with ''[[18 (Moby album)|18]]'' (2002), ''[[Hotel (album)|Hotel]]'' (2005), and ''[[Last Night (Moby album)|Last Night]]'' (2008) and continuing with “Wait for Me” (2009), “Destroyed” (2011) and “Innocents” (2013). Returning to his musical roots, he then released two punk rock inspired albums with The Void Pacific Choir, 2016’s “These Systems Are Failing” and 2017’s “More Fast Songs About the Apocalypse,” followed by the more melodic “Everything Was Beautiful and Nothing Hurt” (2018) and “All Visible Objects” (2020). \n\nAfter a performance with the Los Angeles Philharmonic Orchestra in 2018, Moby was approached by a representative from Deutsche Grammophon and was offered the chance to record an orchestral album for the label. The result, 2021’s “Reprise,” saw him revisit his vast catalogue and rework some of his most well known tracks with new vocalists. Recorded with The Budapest Art Orchestra, the album was his highest-charting in over a decade, hitting the charts in 16 countries. The follow up album “Resound NYC” (2023) featured more reworked tracks and more new vocalists. \n\nInterspersed between these later albums were Moby’s explorations of [[ambient music]], including the almost four-hour release [[Long Ambients 1: Calm. Sleep.|''Long Ambients 1: Calm. Sleep.'']] (2016), “Long Ambients 2” (2019), “Live Ambients Improvised Recordings, Volume 1” (2020), and “Ambient 23” (2023) as well as the collaborative “Always Centered at Night” (2024). Moby continues to record and release albums. \n\nIn addition to his music career, Moby is known for his [[veganism]] and support for animal rights and humanitarian aid. In 2020 he founded Little Walnut Productions to support creative activism across film, TV, and theater projects. He is the author of four books, including a collection of his photography and two memoirs: ''[[Porcelain: A Memoir]]'' (2016) and ''[[Then It Fell Apart]]'' (2019).",
  "last_revision_date": "2026-02-01T02:38:07Z",
  "genres": [
    42,
    48,
    367,
    406,
    410,
    577,
    1008,
    1218,
    1251
  ]
}