{
  "name": "Mr. Bungle",
  "description": "'''Mr. Bungle''' is an American [[experimental rock]] band formed in [[Eureka, California]], in 1985. The band is known for its eclecticism, cycling through several musical genres, often within the course of a single song, including [[Heavy metal music|heavy metal]], [[avant-garde jazz]], [[ska]], [[disco]], and [[funk]], further enhanced by frontman [[Mike Patton]]'s versatile singing style. This period also saw the band utilizing unconventional song structures and [[Sampling (music)|samples]]; playing a wide array of instruments; dressing up in masks, jumpsuits, and other costumes; and performing a diverse selection of [[cover song]]s during live performances.\n\nThe band was founded as a [[death metal]] project while the members were in high school. It is named after a character in the 1960 children's [[educational film]] ''Beginning Responsibility: Lunchroom Manners'', as featured in the 1981 [[HBO]] special ''The Pee-wee Herman Show''. Mr. Bungle released four [[Demo (music)|demo tapes]] in the mid-to-late 1980s. On the back of Patton's success as frontman of [[Faith No More]], the band was signed to [[Warner Bros. Records]] in 1990 and released three studio albums between 1991 and 1999 in the eclectic, experimental style it became known for. The band toured in 1999 and 2000 to support its third album before going on an indefinite hiatus that was confirmed as a dissolution in 2004. It reunited as a [[thrash metal]] band for a series of shows in February 2020 to perform its 1986 demo album ''The Raging Wrath of the Easter Bunny'' with [[Anthrax (American band)|Anthrax]] guitarist [[Scott Ian]] and former [[Slayer]] drummer [[Dave Lombardo]]. The band then returned to the studio to re-record the demo as a professional album, released in October of that year.\n\nMr. Bungle has gone through numerous lineup changes, with Patton, guitarist [[Trey Spruance]], and bassist [[Trevor Dunn]] the sole consistent members. The band was based in [[San Francisco]] during its tenure with Warner Bros. During much of the band's existence, it was in a public dispute with [[Red Hot Chili Peppers]], particularly between Patton and Chili Peppers vocalist [[Anthony Kiedis]].",
  "last_revision_date": "2025-05-31T14:34:58Z",
  "genres": [
    418,
    38,
    75,
    458
  ]
}