{
  "name": "N.W.A",
  "description": "'''N.W.A''' (an abbreviation for '''Niggaz Wit Attitudes''') was an American [[hip-hop]] group formed in [[Compton, California]], in 1987. Among the earliest and most significant figures of the [[gangsta rap]] subgenre, the group is widely considered one of the greatest and most influential acts in [[hip-hop]].\n\nActive from 1987 to 1991, N.W.A endured controversy owing to their music's explicit lyrics, which some viewed as misogynistic or homophobic, as well as to its glorification of drugs and crime. The group was subsequently banned from many mainstream American radio stations. In spite of this, they have sold over ten million units in the United States alone. Drawing on its members' own stories of [[Racism in the United States|racism]] and [[Police brutality|excessive policing]], N.W.A made inherently political music. N.W.A's consistent accusations of [[institutional racism]] within the [[Law enforcement in the United States|American police]] significantly contributed to the political awareness and involvement of American youth against [[racism]].\n\nThe original lineup, formed in early 1987, consisted of [[Arabian Prince]], [[Dr. Dre]], [[Eazy-E]], and [[Ice Cube]], with [[DJ Yella]] joining shortly thereafter and [[MC Ren]] recruited as the sixth member of the group in mid-1988. Their first release was the compilation/[[split album]], ''[[N.W.A. and the Posse]]'' (1987), which peaked at No. 39 on ''Billboard'' magazine's Top R&B/Hip-Hop Albums chart, and it was followed by their debut studio album ''[[Straight Outta Compton]]'' (1989). Arabian Prince left N.W.A. in October 1988, about three months before the release of ''Straight Outta Compton'', with Ice Cube following suit in December of the following year. The group continued on as a four-piece, with no replacements for Arabian Prince and Ice Cube, and disbanded shortly after the release of their second album ''[[Niggaz4Life]]'' (1991).\n\nEazy-E, Ice Cube, MC Ren, and Dr. Dre later became [[Music recording sales certification|Platinum]]-selling solo artists in their own right in the 1990s. Eazy-E died from [[HIV/AIDS|AIDS]] on March 26, 1995. The surviving members of N.W.A have continued to occasionally work together since Eazy-E's death, including a reunion of the ''Straight Outta Compton'' lineup (sans Eazy-E and Arabian Prince) from 1999 to 2001, during which a third album was in the works but abandoned due to issues with the rights to the N.W.A name.\n\nThe group's debut album marked the beginning of the new [[gangsta rap]] era, as the production and social commentary in their lyrics were revolutionary within the genre. ''Niggaz4Life'' was the first [[Hardcore hip-hop|hardcore rap]] album to reach number one on the [[Billboard 200|''Billboard'' 200]] sales charts. In general, N.W.A had a lasting impact on generations of hip-hop artists and, in the late 1980s, played a crucial role in shaping [[Rapping|rap]] as it evolved musically and lyrically. Moreover, the group was credited with being the first to open up rap to a [[White Americans|white American]] audience, contributing to the rapid spread of rap within the American population in general, starting from the late 1980s.\n\n''[[Rolling Stone]]'' ranked N.W.A at number 83 on its [[Rolling Stone's 100 Greatest Artists of All Time|list of the \"100 Greatest Artists of All Time\"]]. In 2016, the group was inducted into the [[Rock and Roll Hall of Fame]], following three previous nominations. In 2024 they received the [[Grammy Lifetime Achievement Award]].",
  "last_revision_date": "2026-01-29T13:21:47Z",
  "genres": [
    491,
    1299
  ]
}