{
  "name": "Napalm Death",
  "description": "'''Napalm Death''' are an English [[grindcore]] band formed in [[Meriden, West Midlands]], in 1981. The band currently consists of [[Barney Greenway]] on vocals, [[Shane Embury]] on bass guitar, John Cooke on lead guitar and Danny Herrera on drums. None of the founding band members remain in the band. From 1989 to 2004, Napalm Death were a five-piece band after they added [[Jesse Pintado]] and [[Mitch Harris]] as replacements for guitarist [[Bill Steer]]. Following Pintado's departure, the band reverted to a four-piece. Mitch Harris left the band in 2014. Since Mitch's indefinite hiatus, guitarist John Cooke can be seen on guitar during live shows. \n\nThe band is credited as pioneers of the grindcore genre by incorporating elements of [[crust punk]] and [[death metal]], using a noise-filled sound that uses [[Distortion (music)|distorted]], [[Dropped tuning|down-tuned guitars]], grinding [[Fuzz bass|overdrive bass]], high-speed [[tempo]], [[blast beat]]s, vocals that consist of incomprehensible [[Death growl|growls]] or high-pitched shrieks, extremely short songs, and sociopolitical lyrics. After hiring drummer [[Mick Harris]] in 1985, the band gained immense speed and started pushing the limits of how fast drums can be played. The band's debut album ''[[Scum (Napalm Death album)|Scum]]'', released in 1987 by [[Earache Records]], proved substantially influential throughout the global metal and punk communities. By their third album ''[[Harmony Corruption]]'' (1990), the band shifted to death metal and began writing longer songs.\n\nNapalm Death have released sixteen studio albums, and as of 2003 are listed by [[Nielsen SoundScan]] as the seventh-best-selling death metal band in the United States. According to former vocalist [[Lee Dorrian]], ''Scum'' and ''[[From Enslavement to Obliteration]]'' (1988) have sold a combined total of 400,000 copies worldwide. In 2016, the staff of ''[[Loudwire]]'' named them the 26th best metal band of all time.",
  "last_revision_date": "2026-01-27T21:43:22Z",
  "genres": [
    53,
    308,
    335,
    523
  ]
}