{
  "name": "Natasha St-Pier",
  "description": "'''Natasha St-Pier''' (born 10 February 1981) is a Canadian singer, songwriter and television presenter. She is of [[Acadian]] heritage, and grew up in the [[Saint John River (Bay of Fundy)|Saint John River]] valley of [[New Brunswick]], but has spent most of her career in France. St-Pier represented France in the [[Eurovision Song Contest 2001|2001 Eurovision Song Contest]] with the song \"[[Je n'ai que mon âme]]\" (English translation: \"I have only my soul\"), gaining fourth place from 23 entrants.\n\nShe began her professional career at a young age in Canada, bringing out her first single at the age of 12, followed by her first album (''[[Émergence (Natasha St-Pier album)|Émergence]]'') in 1996, at the age of 15. Her theatrical experience includes roles in the musicals [[Notre-Dame de Paris (musical)|''Notre-Dame de Paris'']] (in Canada and the U.K) and ''[[Don Juan (musical)|Don Juan]]'' (Canada, 2012).\n\nSt-Pier has had considerable commercial success in francophone countries, including France, Canada, Belgium and Switzerland. She has also become popular in a number of other countries, including Spain, Poland, Russia, Turkey and Japan. Her Eurovision song (\"Je n'ai que mon âme\") reached second position on the charts in France and Belgium when released as a single in 2001. In the following year, her single \"[[Tu trouveras]]\" ('You will find') reached position no. 3 in France and Belgium, and position no. 1 in Quebec. In 2006, her single \"Un ange frappe à ma porte\" ('An angel is knocking at my door') reached no. 1 in Belgium and no. 2 in France. In France, her album ''[[De l'amour le mieux]]'' (2002) was certified double platinum, while ''[[L'instant d'après]]'' (2003) and ''[[Longueur d'ondes]]'' (2006) were certified platinum and gold respectively.\n\nIn interviews, Natasha St-Pier has spoken about the importance of her [[Catholic Church|Catholic]] faith. Following the 2013 concept album ''[[Thérèse – Vivre d'amour]]'' (for which she recorded most of the tracks), St-Pier recorded two further albums focusing on Saint [[Thérèse of Lisieux]]: ''[[Aimer c'est tout donner]]'' (2018) and ''Croire'' (2020). Her following album - ''Jeanne'' (2022) - focused on Saint [[Joan of Arc]].\n\nSt-Pier has appeared as a guest in a number of TV series. She was coach in the second and third season of [[The Voice Belgique]] (''The Voice of Belgium''). In 2024, she and her dancing partner were winners in the French TV series [[Danse avec les stars season 13]].",
  "last_revision_date": "2025-07-19T03:14:19Z",
  "genres": [
    273,
    450,
    919,
    10,
    311
  ]
}