{
  "name": "National Health",
  "description": "'''National Health''' were an English [[progressive rock]] band associated with the [[Canterbury scene]]. Founded in 1975, the band featured members of keyboardist [[Dave Stewart (musician, born 1950)|Dave Stewart]]'s band [[Hatfield and the North]] and [[Alan Gowen]]'s band [[Gilgamesh (band)|Gilgamesh]], including guitarists [[Phil Miller]] and [[Phil Lee]] and bassist [[Mont Campbell]] as original members. The band was named after Stewart's [[National Health Service|National Health]] spectacles. [[Bill Bruford]] (previously of [[Yes (band)|Yes]] and [[King Crimson]]) was the initial drummer, but was soon replaced by [[Pip Pyle]]. Campbell was replaced by [[Neil Murray (British musician)|Neil Murray]] and then [[John Greaves (musician)|John Greaves]]. Alan Gowen left the group before its first album (although he appeared on it as a guest musician), but returned for their final tours, replacing Dave Stewart, who resigned after their second album.  Amanda Parsons sang with the group in its original lineup but also appeared on the first album only as a guest; the group never had another full-time vocalist, although [[Richard Sinclair]] appeared a few times as a guest vocalist, and Greaves sang on one track of the second album and occasionally in concerts. Guitarist Phil Miller was National Health's only constant member.\n\nThey toured extensively and released their first album, ''[[National Health (album)|National Health]]'', in 1978. Although it was created during the rise of [[punk rock]], the album is characterized by lengthy, mostly instrumental compositions. National Health continued performing live until winter 1980, but disbanded without recording another album.\n\nAfter the May 1981 death of Gowen, the ''Queues'' lineup of Stewart, Miller, Greaves and Pyle reunited to record the album ''[[D.S. Al Coda]]'', a set of compositions by Gowen, most previously unrecorded. The original albums and additional archival material have subsequently been released on CD.\n\nThe intro of National Health's \"Binoculars\" was used as a sample on American rock band [[Deftones]]' \"Black Moon\".",
  "last_revision_date": "2025-03-14T21:59:25Z"
}