{
  "name": "NCT",
  "description": "'''NCT''' ({{Korean/auto|hangul=^엔시티|rr=yes}}; an acronym for '''Neo Culture Technology''') is a South Korean boy band formed and managed by [[SM Entertainment]]. Introduced in January 2016, the group consists of 25 members divided into seven different sub-units: [[NCT U]], [[NCT 127]], [[NCT Dream]], [[WayV]], [[NCT DoJaeJung]], [[NCT Wish]], and NCT JNJM. They are known for their versatility in music, vocal and rap abilities, and powerful performances, and have been cited as [[K-pop]]'s \"most experimental boy band\" due to their concept of having limitless members. As of June 2024, NCT has recorded more than 45 million album sales in Korea across all sub-units, making them the best-selling K-pop artist of all time.\n\nThe group debuted their first sub-unit, the rotational NCT U, on April 9, 2016, with the double digital single \"[[The 7th Sense]]\" and \"Without You\". It was followed by the Seoul-based sub-unit NCT 127 on July 7, 2016, with their [[NCT 127 (EP)|eponymous extended play]] and the then-teenaged sub-unit NCT Dream on August 24, 2016, with the digital single \"Chewing Gum\". WayV, a seven-member sub-unit based in China and NCT's first overseas sub-unit, debuted on January 17, 2019, with the single album ''[[The Vision (single album)|The Vision]]''. On April 17, 2023, a fixed sub-unit featuring members [[Doyoung (singer)|Doyoung]], [[Jaehyun (singer)|Jaehyun]], and [[Jungwoo]] debuted as NCT DoJaeJung with the EP [[Perfume (EP)|''Perfume'']]. NCT's last overseas unit based in Japan, [[NCT Wish]], debuted with the single \"[[Wish (NCT Wish song)|Wish]]\" on February 28, 2024. [[Jeno (singer)|Jeno]] and [[Jaemin]] formed NCT JNJM and will debut on February 23, 2026, with the EP ''Both Sides''.\n\nAlthough each sub-unit promotes separately, NCT has united four times as a group to record four full-length albums: ''[[NCT 2018 Empathy|Empathy]]'' (2018), ''[[NCT 2020 Resonance|Resonance]]'' (2020), ''[[Universe (NCT album)|Universe]]'' (2021), and ''[[Golden Age (album)|Golden Age]]'' (2023). Within two months of release, ''Resonance'' sold over 2.6 million copies across its two parts, becoming the highest-selling physical album released by an act from SM Entertainment at the time and earning the group their first Daesang (Grand Prize) Award at the 2020 [[Asia Artist Awards]]. ''Universe'', which was released in December 2021, became their most pre-ordered album at 1.7 million copies, and later surpassed 1.8 million sales after its release.",
  "last_revision_date": "2026-01-29T21:58:56Z",
  "genres": [
    191,
    281,
    404,
    564,
    630,
    660
  ]
}