{
  "name": "New Edition",
  "description": "'''New Edition''' is an American [[Contemporary R&B|R&B]]/[[Pop music|pop]] group from the [[Roxbury, Boston|Roxbury]] neighborhood of [[Boston]], [[Massachusetts]], formed in 1978 by singer/rapper [[Bobby Brown]]. Their name is taken to mean a new edition of the [[Jackson 5]]. The group reached its height of popularity in the 1980s and is considered the blueprint for what would become the modern [[boy band]]. The lineup originally consisted of [[Ricky Bell (singer)|Ricky Bell]], [[Michael Bivins]], [[Ronnie DeVoe]], [[Bobby Brown]], and [[Ralph Tresvant]]. Brown departed the group in late 1985 to begin a successful solo career, and they continued as a quartet for one album, before adding [[Johnny Gill]] to the lineup in 1987.  Early hits included \"[[Candy Girl (New Edition song)|Candy Girl]]\", \"[[Cool It Now]]\", and \"[[Mr. Telephone Man]]\". Tresvant was the lead singer on most of the songs.  In 1990, both Gill and Tresvant released their own solo albums, while the remaining three members formed the trio [[Bell Biv DeVoe]]; the group ceased to work together for the first half of the 1990s.\n\nAll six members of New Edition reunited in 1996 to record the group's sixth studio album ''[[Home Again (New Edition album)|Home Again]]''. During the ill-fated ''Home Again Tour'', both Brown and Bivins quit the group, forcing the remainder of the tour to be canceled. Various reunions have occurred since, usually with the 1987–1990 lineup, though occasionally also including Brown. Their last studio album was 2004's ''[[One Love (New Edition album)|One Love]]''.\n\nOn May 3, 2011, New Edition issued a press release on their official website announcing that all six members were reuniting as New Edition to kick off the 30th anniversary celebration of ''[[Candy Girl (album)|Candy Girl]]'' with their fans. They received their star on the Hollywood Walk of Fame on January 23, 2017. On January 24, 2017, a three-part docuseries, ''[[The New Edition Story]]'', premiered on [[BET]] about the group's career and personal life. It was later announced that all six members will reunite to record another album and go on tour. On February 17, 2022, the group was inducted into the [[Black Music & Entertainment Walk of Fame]].\n\nOn December 31, 2022, New Edition performed on ''Dick Clark's New Year's Rocking Eve'' with [[Ryan Seacrest]]. All six members were in attendance and performed various songs from both their group and solo careers. On September 24, 2023, in Farmington Hills, Michigan, New Edition was inducted into the [[National Rhythm & Blues Hall of Fame]].",
  "last_revision_date": "2025-12-07T19:56:04Z",
  "genres": [
    277,
    558,
    842,
    941
  ]
}