{
  "name": "Nightwish",
  "description": "'''Nightwish''' is a Finnish [[symphonic metal]] band from [[Kitee]]. The band was formed in 1996 by lead songwriter and keyboardist [[Tuomas Holopainen]], guitarist [[Emppu Vuorinen]], and former lead singer [[Tarja Turunen]]. The band soon picked up drummer [[Jukka Nevalainen]], and then bassist [[Sami V채nsk채]] after the release of their debut album, ''[[Angels Fall First]]'' (1997). In 2001, V채nsk채 was replaced by [[Marko Hietala]], who also took over the male vocalist role previously filled by Holopainen or guest singers. Although Nightwish have been prominent in their home country since ''Angels Fall First'', they did not achieve wider success until the release of the albums ''[[Oceanborn]]'' (1998), ''[[Wishmaster (album)|Wishmaster]]'' (2000) and ''[[Century Child]]'' (2002).\n\nTheir 2004 album, ''[[Once (Nightwish album)|Once]]'', has sold more than one million copies and was the band's breakthrough in the United States. Their biggest US hit single, \"[[Wish I Had an Angel]]\" (2004), received [[MTV]] airplay and was included on three US film soundtracks. The band produced three more singles and two music videos for ''Once'', as well as a re-recording of \"[[Sleeping Sun]]\" for the compilation album, ''[[Highest Hopes: The Best of Nightwish]]'' (2005), before Turunen's dismissal in October 2005. In May 2007, Nightwish announced [[Anette Olzon]] as Turunen's replacement. That September, the band released their sixth album, ''[[Dark Passion Play]]'', which has sold almost 2 million copies. The album's lead single, \"[[Amaranth (song)|Amaranth]]\", became one of Nightwish's most successful in Europe. Their seventh studio album, ''[[Imaginaerum]]'', was released in November 2011. Nightwish parted ways with Olzon in October 2012 and finished the [[Imaginaerum World Tour|tour]] with [[Floor Jansen]], who later became a permanent member of the band alongside longtime session [[uilleann pipes]] player [[Troy Donockley]] in October 2013.\n\nIn July 2019, Nevalainen, who had been inactive since 2014 due to severe [[insomnia]], announced that he would not be returning to the band, with [[Kai Hahto]], who had acted as his replacement since 2014, becoming the official drummer. Bassist [[Marko Hietala]] parted ways with the band in January 2021, and [[Jukka Koskinen]] was announced as Hietala's replacement in August 2022.\n\nNightwish is the third-best-selling band and musical entity in Finland with [[List of music recording certifications|certified]] sales of nearly 900,000 [[List of music recording certifications|certified]] copies. The group is also the most successful Finnish band worldwide, selling more than 10 million records and receiving more than 60 gold and platinum awards, having released six Number 1 albums and thirteen Number 1 singles. On October 26, 2018, Nightwish was inducted into the Finnish Music Hall of Fame, becoming the honorary gallery's 11th member.",
  "last_revision_date": "2025-06-12T16:09:59Z",
  "genres": [
    504,
    934,
    432,
    1153,
    942
  ]
}