{
  "name": "Nitin Sawhney",
  "description": "'''Nitin Sawhney''' ({{IPAc-en|ˈ|n|ɪ|t|ɪ|n|_|ˈ|s|ɔː|n|i}}; born 1964) is a British musician, producer and composer. A recipient of the [[Ivor Novello Awards|Ivor Novello Lifetime Achievement award]] in 2017, among multiple international awards throughout his career. Sawhney's work combines [[Asian Underground|Asian]] and other worldwide influences with elements of [[electronica]] and often explores themes such as multiculturalism, politics, and [[spirituality]]. Sawhney is also active in the promotion of arts and [[culture|cultural matters]], is chair of the PRS Foundation, sits on the board of trustees of theatre company [[Complicité]], and is a patron of numerous film festivals, venues, and educational institutions. In 2021, he was an ambassador for the [[Royal Albert Hall]].\n\nSawhney has scored for and performed with orchestras, and collaborated with and written for [[Paul McCartney]], [[Sting (musician)|Sting]], the [[London Symphony Orchestra]], [[A. R. Rahman]], [[Brian Eno]], [[Sinéad O'Connor]], [[Jacob Golden]], [[Anoushka Shankar]], [[Jeff Beck]], [[Shakira]], [[Will Young]], [[Joss Stone]], [[Taio Cruz]], [[Ellie Goulding]], [[Horace Andy]], [[Cirque du Soleil]], [[Akram Khan (dancer)|Akram Khan]], [[Deepa Mehta]], [[Mira Nair]], [[Nelson Mandela]], [[Ojos de Brujo]], [[Hélène Grimaud]], [[Natacha Atlas]], [[Jools Holland]], [[Jorja Smith]], [[John Hurt]] and [[Pink Floyd]]. Performing extensively around the world, Sawhney has achieved an international reputation across multiple artistic mediums.\n\nOften appearing as Artist in Residence, Curator or Musical Director at international festivals, Sawhney contributes to musical education, having acted as patron of the British Government's Access-to-music programme, the East London Film festival and, currently, Artis as well as acting as a judge for The [[Ivor Novello Awards]], [[British Academy of Film and Television Arts|BAFTA]], [[BIFA Award for Best British Independent Film|BIFA]], and a new role as Patron for the PRS Foundation. He is a recipient of seven honorary doctorates from British universities, is a fellow of [[Liverpool Institute for Performing Arts|LIPA]] and the [[London South Bank University|Southbank University]], an Associate of [[Sadler's Wells Theatre|Sadler's Wells]], and sits on the board for British theatre company [[Complicite]]. In 2017, Sawhney received the [[Ivor Novello Awards|Ivor Novello]] Lifetime Achievement award.\n\nHaving turned down an [[Order of the British Empire|OBE]] in 2007, stating that it was associated with \"a colonial past\", Sawhney accepted a higher-grade [[CBE]] in the [[2019 New Year Honours]]. He accepted it for his father, who he said had died regretting that Sawhney had rejected the OBE.{{Primary source inline|date=December 2021}}\n \nSince 2014, the publishing interest of Nitin Sawhney's catalogue has been represented by Reservoir Media Management.",
  "last_revision_date": "2025-09-15T12:24:00Z",
  "genres": [
    276,
    360,
    368,
    398,
    863,
    1227
  ]
}