{
  "name": "No Te Va Gustar",
  "description": "'''No Te Va Gustar''', also known by their initials '''NTVG''', is an Uruguayan [[Rock music|rock]] band formed in 1994 in [[Malvín]], [[Montevideo]]. The group consists of lead vocalist and guitarist [[Emiliano Brancciari]], bassist Guzmán Silveira, drummer Diego Bartaburu, trumpeter Martín Gil, trombonist Denis Ramos, tenor saxophonist Mauricio Ortiz, guitarist Pablo Coniberti, and keyboardist Francisco Nasser. The group was founded by Brancciari, Mateo Moreno, and Pablo Abdala as a group of friends that played at a small festival. It is considered as the most popular and international [[Uruguayan rock]] band and one of the most recognized Latin American groups.\n\nFive years after its founding, No Te Va Gustar independently released their debut studio album ''Solo de Noche'', inspired by the emerging [[Latin rock]]. They signed to Bizarro Records to release the album ''Este Fuerte Viento que Sopla'' (2002), which solidified their success in Uruguay. During the launch of three albums between 2004 and 2008 and a series of concert tours, they found an internacional commercial breakthrough. The band's sixth record, ''[[Por Lo Menos Hoy]]'' (2010), was presented in front of 60,000 people in Montevideo. ''[[El Calor del Pleno Invierno]]'' (2012) marked No Te Va Gustar's first album to reach number one in both Uruguay and Argentina.\n\nNo Te Va Gustar's subsequent albums—''[[El Tiempo Otra Vez Avanza]]'' (2014) and ''[[Suenan las Alarmas]]'' (2017)—topped the [[Cámara Uruguaya de Productores de Fonogramas y Videogramas]]' chart in their native country. In 2019, the band founded their own record label, Elefante Blanco, to release ''[[Otras Canciones]]'', which featured collaborations with various Latin American musicians. Their tenth album, ''[[Luz (No Te Va Gustar album)|Luz]]'', also peaked at number one in Uruguay.\n\nThroughout their career, though respecting their usual combination of [[Rock music|rock]] and [[Pop music|pop]], the band experimented with other musical styles, such as [[murga]], [[candombe]], and [[Punk music|punk]]. They have received nominations for ten [[Latin Grammy Awards|Latin Grammy]], two [[MTV Europe Music Awards]], one [[MTV MIAW Awards]], and one [[Premios Gardel]], while winning an [[Iris Award (Uruguay)|Iris Award]].",
  "last_revision_date": "2025-10-04T06:44:14Z",
  "genres": [
    205,
    951,
    1061,
    1131
  ]
}