{
  "name": "Nortec Collective",
  "description": "'''Nortec Collective''' was a Mexican musical ensemble formed by various individual one- or two-man production projects. The group came together in [[Tijuana]], [[Baja California]], Mexico. Their genre mixes [[electronic music]] with musical elements and instrumentation of [[Tambora (Mexican drum)|tambora]] and [[Norteño (music)|norteño]] music, resulting in the [[nortec]] (\"norteño\" + \"techno\") style. The various projects began producing and performing nortec music around 1999. In 2001, they were signed to a recording contract with Palm Pictures, and released their first album, ''Tijuana Session Volume 1'', under the name Nortec Collective. The line-up for that album included Bostich, [[Clorofila (Jorge Verdín)|Clorofila]], Fussible, Hiperboreal, Panoptica, Plankton Man and Terrestre. The latter two would leave Nortec Collective in 2002.\n\nNortec Collective's second album, ''Tijuana Sessions, Vol. 3'' ([[Nacional Records]]), received much critical praise and was nominated for two [[Latin Grammy]] awards in 2006.\n\nIn 2008, Nortec Collective ceased to function as a proper collective, with the various individual projects performing and recording separately. According to the Collective's [[Myspace]] page, \"For the time being, Nortec Collective has decided to release music separately...\" and \"Until further notice, there will be not be any bookings for Nortec, Nortec Collective or Colectivo Nortec with the full four member line-up.\"\n\nThe various individual projects went on to release and perform separately. 2008's ''Tijuana Sound Machine'' by Bostich and Fussible (Nacional Records) was nominated for the [[Grammy Award for Best Latin Rock/Alternative Album]].\n\nThe Nortec Collective has borrowed several elements of [[Banda music]] sub-culture and have used them both in their songs (\"Narcoteque\", \"Almada\") and in their visuals and album covers.{{cn|date=December 2018}}",
  "last_revision_date": "2025-08-27T18:52:10Z",
  "genres": [
    405,
    874,
    1219
  ]
}