{
  "name": "Nox Arcana",
  "description": "'''Nox Arcana''' is the American [[neoclassical dark wave]], [[dark ambient]] musical project of Joseph Vargo. It was founded in 2003 as a duo with William Piotrowski, who left in 2008 to pursue a career in [[film score]] composing but still acts as its studio engineer while Vargo continued on as sole composer and musician performing under the name. According to the Nox Arcana biography, the name is derived from two Latin words that roughly translate to \"mysteries of the night.\"\n\nAll of Nox Arcana's music is released [[independent music|independently]] on the Monolith Graphics label, a publishing company owned by Vargo. With their third album, Nox Arcana became a ''[[Billboard Magazine|Billboard]]'' Top Ten charting artist in the holiday genre.\n\nWilliam Piotrowski released his first solo film soundtrack with ''[[Crimson Winter: Original Motion Picture Soundtrack|Crimson Winter]]''. Joseph Vargo wrote and recorded solo for later albums, ''[[Blackthorn Asylum]]'', ''[[Winter's Eve]]'', ''[[Theater of Illusion]]'', ''[[The Dark Tower (Nox Arcana album)|The Dark Tower]]'', ''[[Winter's Majesty]]'' and ''[[Legion of Shadows]]'', which was a dedication to fans, and marked Nox Arcana's 10-year anniversary.   For the next decade Joseph Vargo performed solo on ''[[Gothic (Nox Arcana album)|Gothic]]'', ''[[Season of the Witch (Nox Arcana album)|Season of the Witch]]'', and ''[[Ebonshire]]'', which has become a series of holiday music EPs released each year, culminating in 2018 with the full collection on CD. \n\nNox Arcana published four releases during 2025: ''Pandora's Box'', a theme based on the ancient Greek myth of [[Pandora]]; ''Darkfall, Vol. 4'', a follow-up to the earlier Billboard charting releases; ''Doctor Arcana Official Gaming Soundtrack'', a collection of all the songs from both game soundtracks onto one CD; and delved into the rock genre with ''Hard Nox'', which features vocals on the majority of tracks, along with electric guitars and bass drums.",
  "last_revision_date": "2025-11-20T01:12:29Z",
  "genres": [
    324,
    376,
    412,
    510,
    528,
    1048
  ]
}