{
  "name": "Opeth",
  "description": "'''Opeth''' is a Swedish [[progressive metal]] band from [[Stockholm]], formed in 1990. The band incorporates [[folk music|folk]], [[blues]], [[classical music|classical]], and [[jazz]] elements into its usually lengthy compositions, as well as strong influences from [[death metal]], especially in their early works. Songs may include acoustic guitar passages, [[Mellotron]]s, [[death growl]]s, and strong [[dynamics (music)|dynamic]] shifts. \n\nThe group have been through several personnel changes since early in their history, including the replacement of every original member. Lead vocalist, guitarist and primary songwriter [[Mikael Åkerfeldt]] has been Opeth's driving force since the departure of founder and lead vocalist [[David Isberg]] in 1992. The band rarely made live appearances supporting their first four albums, but since their first world tour in support of the 2001 album ''[[Blackwater Park]]'', they have performed several other major world tours. \n\nOpeth have released fourteen studio albums, four live DVDs, four live albums (three that are in conjunction with DVDs), and two boxsets. The band released its debut album ''[[Orchid (album)|Orchid]]'' in 1995. With their eighth studio album, ''[[Ghost Reveries]]'' (2005), the band achieved chart success in several dozen countries, including Top Ten in Sweden. Their ninth studio album, ''[[Watershed (Opeth album)|Watershed]]'' (2008), topped the Finnish albums chart in its first week of release, and reached 23 on the US [[Billboard 200|''Billboard'' 200]] chart. As of November 2009, the band have sold over 1.5 million copies of their albums and DVDs worldwide, including 300,000 collective [[Luminate (company)|SoundScan]]s of their albums ''[[Blackwater Park]]'', ''[[Damnation (album)|Damnation]]'', and ''[[Deliverance (Opeth album)|Deliverance]]'' in the United States. Their 14th studio album ''[[The Last Will and Testament]]'' (2024) won the Swedish [[Grammis]] award for the Best Hard Rock/Metal category.",
  "last_revision_date": "2025-05-02T12:16:37Z"
}