{
  "name": "Orphaned Land",
  "description": "'''Orphaned Land''' is an Israeli [[Heavy metal music|heavy metal]] band formed in 1991. They combine [[Mizrahi music|Mizrahi]] and [[Maghrebi Jews|Maghrebi Jewish]], [[Arabic music|Arabic]], [[Music of Turkey|Turkish]], and other [[Middle Eastern music|Middle Eastern]] and [[Music of North Africa|North African]] musical elements, with metal (with particular influence from [[Yemenite Jews#Music|Yemenite Jewish]] and, in their early years, [[Moroccan Jews#Music|Moroccan Jewish music]]), as well as from [[Sephardic music]], and other sounds from the [[Mediterranean Region]]. They have also included \"metalized\" versions of various [[piyyut]]im in all of their albums since ''[[El Norra Alila]]''. The band are considered pioneers of [[oriental metal]]. Orphaned Land have gone through several lineup changes over the years, but have retained two founding members of the band, [[Kobi Farhi]] (vocals) and Uri Zelcha (bass). Other members are Matan Shmuely (drums), Chen Balbus (guitars/[[Bağlama|saz]]) who replaced co-founding member Matti Svatizky in 2011, and Idan Amsalem (guitars/[[bouzouki]]) who replaced co-founding member [[Yossi Sassi]] in early 2014. Their lyrics promote a message of peace and unity, particularly between the three main [[Abrahamic religions]] (Judaism, Christianity, and Islam). The name \"Orphaned Land\" comes from the lyrics of a [[Yehuda Poliker]] song and reflects \"a paradox\" to the term \"[[Holy Land]]\". Four of their six albums are [[concept album]]s relating to the concept of [[light and darkness]].\n\nDespite Orphaned Land's songs drawing on [[Bible|biblical themes]], the band have said that they are not religious, with the majority of the band members identifying as [[Atheism|atheist]] or [[Agnosticism|agnostic]], and ambivalent towards organized religion, blaming it as the cause of bloodshed and hatred. Orphaned Land's frontman Kobi Farhi claims that metal is a kind of \"religion\".\n\nOrphaned Land has developed a large following across the [[Middle East and North Africa]] as well as Iran, and have been described as \"ambassadors of peace\" for their message of unity, despite the heavy metal genre being considered [[taboo]] in, and with the [[State of Israel]] being considered an [[Arab–Israeli conflict|enemy]] of many of these countries. In 2013, Orphaned Land toured Europe with the Palestinian band [[Khalas]] which Farhi claims proved that Jewish-Muslim coexistence is possible. The two bands issued a split album with each other in 2021, entitled ''The Peace Series Vol. 1''.",
  "last_revision_date": "2026-01-02T22:52:07Z",
  "genres": [
    335,
    443,
    981
  ]
}