{
  "name": "Os Mutantes",
  "description": "'''Os Mutantes''' ({{IPA|pt-BR|uz muˈtɐ̃tʃis|lang}}, ''The Mutants'') is a Brazilian rock band that were linked with the [[Tropicalismo|Tropicália]] movement, a dissident musical movement during the [[Brazilian dictatorship]] of the late 1960s. The band is considered to be one of the main groups of [[Brazilian rock]]. Heavily influenced by Anglo-American [[psychedelic pop]], they bridged Brazilian sensibilities together with studio trickery, [[guitar feedback|feedback]], [[Distortion (music)|distortion]], and [[musique concrète]]. They released their now-acclaimed [[Os Mutantes (album)|self-titled debut album]] in 1968.\n\nOs Mutantes debuted their work in 1966, as a trio, when they presented themselves in the program ''O Pequeno Mundo de Ronnie Von'' of [[TV Record]]. The group was christened ''Mutantes'' by [[Ronnie Von]] himself, right before their first TV appearance. The group until then called themselves ''Os Bruxos'' (meaning ''The Witches'', in Portuguese) and the suggestion came from the book ''Emperor of the Mutants'', by [[Stefan Wul]] (the book's original title in French is ''La Mort Vivante''). The group quickly became one of the main figures of the \"new MPB\" (popular Brazilian music), influenced by [[Tropicália]], until their breakup in 1978, only with Sérgio Dias as an original member. Throughout these twelve years, nine albums were recorded, although two of them – ''[[O A e o Z]]'' and ''[[Tecnicolor]]'' – were only released in the 1990s. It was during this later decade that the importance of Os Mutantes was recognized, by both national and international rock, as one of the most creative dynamic, radical and talented groups of the [[psychedelic music|psychedelic]] era.\n\nAlthough the original line-up ([[Rita Lee]], [[Arnaldo Baptista]] and [[Sérgio Dias]]; and later with [[Liminha (musician)|Liminha]] and Dinho Leme) made the most notable breakthrough for the group, it has gone through numerous personnel changes throughout its existence, with Dias being the band's sole consistent original member, and the only one to appear on every album. After a hiatus from the late 1970s to the early 2000s, the band reunited in 2006, touring and recording new material.",
  "last_revision_date": "2025-07-19T03:40:09Z",
  "genres": [
    959,
    951,
    1214,
    418,
    961
  ]
}