{
  "name": "Osees",
  "description": "'''Osees''' is an American [[rock music|rock]] band formed in [[San Francisco, California]] in 1997, now based in [[Los Angeles, California]]. Originally the solo recording project of [[John Dwyer (musician)|John Dwyer]], the band has evolved through numerous line-up and name changes since its founding, with Dwyer serving as the band leader and primary songwriter throughout. Alongside Dwyer, the band's current line-up includes longtime members, Tim Hellman (bass), Dan Rincon (drums), Paul Quattrone (drums) and Tomas Dolas (keyboards).\n\nThe group's sound draws from a wide variety of influences, including [[garage rock]], [[krautrock]], [[psychedelic music|psychedelia]], and [[folk music]]. Osees are noted for their prolific recording output, energetic live shows, and off-kilter visual aesthetic. The group has released twenty-eight studio albums, to date, alongside various EPs, singles and compilations. \n\nInitially a solo [[freak folk]] recording project, Dwyer evolved the project into a full garage rock band, featuring [[Brigid Dawson]] (keyboards, backing vocals), [[Petey Dammit]] (bass, guitar), Mike Shoun (drums), and Lars Finberg (drums, guitar), while releasing the acclaimed albums, ''[[The Master's Bedroom Is Worth Spending a Night In]]'' (2008), ''[[Carrion Crawler/The Dream]]'' (2011) and ''[[Floating Coffin]]'' (2013).\n\nAfter relocating to Los Angeles in late 2013, Dwyer changed the line-up of the band, with [[Sic Alps]] bass guitarist Tim Hellman and [[White Fence (musician)|White Fence]] drummer [[Nick Murray (musician)|Nick Murray]] replacing Dawson, Dammit!, Shoun and Finberg. Following the release of the band's sixteenth studio album, ''[[Mutilator Defeated At Last]]'' (2015), Dwyer and Hellman began touring with two drummers, Dan Rincon and Ryan Moutinho, replacing Murray. Touring extensively, this line-up recorded the band's seventeenth and eighteenth studio albums, ''[[A Weird Exits]]'' and ''[[An Odd Entrances]]'', with Moutinho departing in late 2016 to focus on his own projects.\n\nWith the arrival of new drummer Paul Quattrone, the band recorded its nineteenth album, ''[[Orc (Oh Sees album)|Orc]]'', with co-producers [[Ty Segall]], Eric Bauer and Enrique Tena. In late 2017, Dwyer reunited with Dawson for a primarily acoustic album, ''[[Memory of a Cut Off Head]]'', which returned to the band's lo-fi roots, and featured several former and current Oh Sees members. After two studio albums featuring a heavy, [[progressive rock]] sound—''[[Smote Reverser]]'' (2018) and ''[[Face Stabber]]'' (2019)—the band changed its name to Osees in July 2020, with the announcement of their twenty-third album, ''[[Protean Threat]]''. The group continued to release prolifically under the new name, putting out ''[[Metamorphosed (album)|Metamorphosed]]'', alongside a remix album and an EP before the end of 2020. The band's twenty-eighth album, ''[[Abomination Revealed at Last]]'', was released on August 8, 2025.",
  "last_revision_date": "2025-10-03T17:46:31Z",
  "genres": [
    42,
    425,
    488,
    982,
    986,
    1000
  ]
}