{
  "page_title": "Otis Rush",
  "description": "'''Otis Rush Jr.''' (April 29, 1934 – September 29, 2018) was an American [[blues]] singer, guitarist, and songwriter who has been long revered as one of the creators of modern Chicago blues; though he was respected and praised, the success he sought eluded him, while others profited from what he created and his career never reached the heights that he deserved.{{cn|date=April 2025}}\n\nAs a performer, Otis was unique. (Everyone called him Otis, or Mr. Rush.) He had an intense and powerful tenor voice that grabbed your attention, and he had big hands so he could make unusual chord inversions on the guitar, which he said he got from Charles Brown, the jazz blues piano player, an acknowledged influence. Also, he played his guitar upside down and backwards.  Albert King, from whom Otis borrowed licks, Jimi Hendrix, and Eddy \"the Chief\" Clearwater played the same way, though Otis' sound was otherworldly. He had the low strings adjusted very low, and the G, B, and high E strings adjusted for slightly higher action, so he could curl his left pinky under the low strings and pull them down, sometimes two or three at a time. Music critic Lester Bangs wrote in one of his last articles that it was the sound of “being mugged by an iceberg”.\n\nOtis ran his amplifiers in such a way that he could sustain his notes. He liked to wring out every sustainable note from his guitars. The term \"slow burn\" is an accurate description of the way he approached his dark and mournful slow blues. Amplifier technology changed drastically during the decades following his beginnings, where in the 1950s, players usually used what was on the venue's bandstand. During the early years of the electric blues ascent, many of the older performers used Masco P.A. head amplifiers, older Ampegs, or beat-up Fender amps that were badly in need of new tubes or other repairs. Through the '80s and '90s, he preferred Mesa Boogie amps. One of his favorites was the Mark 2B channeled into a variety of speaker cabinets.\n\nWhile [[Muddy Waters]] and [[Howlin’ Wolf]], his predecessors on Chicago's South Side, popularized an amplified update of the bare-bones, down-home sound of the Mississippi Delta where the sound of the band was the focus, Otis listened to piano and horn players, which gave him his unique phrasing. He also loved T-bone Walker. He said T-bone Walker was one of the best guitar players because he was a great rhythm guitarist, as well as a great soloist. Otis always felt that if one could not play rhythm guitar very well, and were just a soloist, one would not be a complete guitar player. His modern variations, along with [[Magic Sam ]]'s and [[Buddy Guy]]'s, were more lyrical and more rhythmically complex and are credited with bringing the guitar out front in what came to be known as the West Side sound because it was prevalent in nightclubs on that side of town, influencing a generation of blues and rock musicians, including [[Carlos Santana]], [[Mike Bloomfield|Michael Bloomfield]], [[John Mayall]], [[Peter Green (musician)|Peter Green]], [[Eric Clapton]], and [[Stevie Ray Vaughan]], who named his band after Otis' 1958 hit \"Double Trouble\". Citing Otis as one of the deepest of deep blues men, [[Muddy Waters]] commented to critic and author Robert Palmer in his book, ''Deep Blues'', “He's so good, man.”",
  "last_revision_date": "2025-04-30T17:20:34Z"
}