{
  "name": "Panic! at the Disco",
  "description": "'''Panic! at the Disco'''{{efn|The band went by '''Panic at the Disco''' with no [[exclamation point]] for the duration of the ''[[Pretty. Odd.]]'' album campaign from January 2008 to July 2009.<ref>{{Cite web |last=Connick |first=Tom |date=27 March 2018 |title=Ten years on, Panic! At The Disco's opinion-splitting 'Pretty. Odd.' deserves a second chance |url=https://www.nme.com/blogs/nme-blogs/panic-at-the-disco-pretty-odd-retrospective-2274306 |access-date=21 April 2023 |website=[[NME]]}}</ref><ref>{{Cite web |last=Lindbergh |first=Ben |date=30 July 2022 |title=Panic! at the Disco's 'Pretty. Odd.' & the Death Knell of 3rd-Wave Emo |url=https://www.theringer.com/music/2022/7/30/23283181/panic-at-the-disco-pretty-odd-third-wave-emo |access-date=21 April 2023 |website=[[The Ringer (website)|The Ringer]]}}</ref> }} was an American [[pop rock]] band formed in [[Las Vegas|Las Vegas, Nevada]], in 2004 by high school friends [[Ryan Ross]] (guitar) and [[Spencer Smith (musician)|Spencer Smith]] (drums), who recruited classmates [[Brendon Urie]] (vocals and guitar) and Brent Wilson (bass). Following several lineup changes, Panic! at the Disco operated as the solo project of frontman Urie from 2015 until its discontinuation in 2023.\n\nThe band recorded their first demos while they were in high school. Shortly after, they recorded and released their debut studio album, ''[[A Fever You Can't Sweat Out]]'' (2005). Popularized by the second single, \"[[I Write Sins Not Tragedies]]\", the album was certified [[RIAA certification|triple platinum]] in the US. In 2006, Wilson was fired from the band during an extensive world tour and subsequently replaced by [[Jon Walker]]. The band's second album, ''[[Pretty. Odd.]]'' (2008), was preceded by the single \"[[Nine in the Afternoon]]\". The album marked a significant departure from the sound of the band's debut. Ross and Walker, who favored the band's new direction, departed because Urie and Smith wanted to make further changes to the band's style. Ross and Walker subsequently formed a new band, [[the Young Veins]], leaving Urie and Smith as the sole remaining members of Panic! at the Disco.\n\nContinuing as a duo, Urie and Smith released a new single, \"[[New Perspective (song)|New Perspective]]\", for the film ''[[Jennifer's Body]]'' (2009), and recruited bassist [[Dallon Weekes]] and guitarist [[Ian Crawford (musician)|Ian Crawford]] as touring musicians for live performances. Weekes was later inducted into the band's lineup as a full-time member in 2010. The band's third studio album, ''[[Vices & Virtues]]'' (2011), was recorded solely by Urie and Smith in 2010, produced by [[John Feldmann]] and [[Butch Walker]]. Crawford departed once the tour cycle for ''Vices & Virtues'' ended in 2012. As a three-piece, Urie, Smith, and Weekes recorded and released the band's fourth studio album, ''[[Too Weird to Live, Too Rare to Die!]]'', in 2013. Prior to the release of the album, Smith unofficially left the band due to health- and drug-related issues, leaving Urie and Weekes as the remaining members. The duo recruited guitarist Kenneth Harris and drummer Dan Pawlovich as touring musicians for live performances.\n\nIn 2015, Smith officially left the band after not performing live with them since his departure in 2013. Shortly thereafter, Weekes reverted to being a touring musician once again, resulting in Panic! becoming Urie's solo project. In January 2016, Panic! at the Disco released their fifth studio album, ''[[Death of a Bachelor]]''. In December 2017, Weekes officially announced his departure from the band, with [[Nicole Row]] replacing him in the touring lineup. In June 2018, Panic! at the Disco released their sixth studio album, ''[[Pray for the Wicked]]'', featuring their highest placing single \"[[High Hopes (Panic! at the Disco song)|High Hopes]]\". Panic! at the Disco's seventh studio album, ''[[Viva Las Vengeance]]'', was released on August 19, 2022. Following the conclusion of the [[Viva Las Vengeance Tour]] in March 2023, Urie disbanded Panic! at the Disco.",
  "last_revision_date": "2025-06-19T03:11:58Z"
}