{
  "name": "Pantera",
  "description": "'''Pantera''' ({{IPAc-en|p|æ|n|ˈ|t|ɛr|ə}}) is an American [[Heavy metal music|heavy metal]] band formed in [[Arlington, Texas]] in 1981 by the Abbott brothers (guitarist [[Dimebag Darrell]] and drummer [[Vinnie Paul]]), and currently composed of vocalist [[Phil Anselmo]], bassist [[Rex Brown]], and touring musicians [[Zakk Wylde]] and [[Charlie Benante]]. The group's best-known lineup consisted of the Abbott brothers along with Brown and Anselmo, who joined in 1982 and 1986, respectively. The band is credited for developing and popularizing the subgenre of [[groove metal]] in the 1990s. Regarded as one of the most successful and influential bands in heavy metal history, Pantera has sold around 20 million records worldwide and has received four [[Grammy Awards|Grammy]] nominations.\n\nHaving started as a [[glam metal]] band, Pantera released three albums in the mid-1980s with lead vocalist [[Terry Glaze]] (''[[Metal Magic]]'', ''[[Projects in the Jungle]]'', and ''[[I Am the Night (album)|I Am the Night]]''), with little success. Looking for a new and heavier sound, Pantera recruited Anselmo in 1986 and released ''[[Power Metal (album)|Power Metal]]'' in 1988. They secured a record deal with major label [[Atco Records|Atco]] the following year. Their fifth album (which the band has since declared to be their official debut album), ''[[Cowboys from Hell]]'' (1990), popularized the [[groove metal]] genre, while its follow-up ''[[Vulgar Display of Power]]'' (1992) achieved an even heavier sound and increased their popularity. The subsequent seventh studio album ''[[Far Beyond Driven]]'' (1994) debuted at number one on the [[Billboard 200|''Billboard'' 200]].\n\nTensions began to surface among the band members when Anselmo, reeling from severe back problems brought on by years of intense on-stage performances, began growing distant from his bandmates in 1995, eventually becoming addicted to [[heroin]] as a result of his pain issues (he almost died from an [[overdose]] in July 1996). These tensions resulted in the recording sessions for ''[[The Great Southern Trendkill]]'' (1996) being held separately. The ongoing tension lasted for another seven years, during which one more studio album, ''[[Reinventing the Steel]]'' (2000), was recorded. Pantera went on hiatus in 2001, but lingering disputes led to the band breaking up in 2003. The Abbott brothers went on to form [[Damageplan]] while Anselmo continued to work on several side projects, including [[Down (band)|Down]], which Brown joined as well.\n\nOn December 8, 2004, Dimebag Darrell was [[Columbus nightclub shooting|shot and killed]] on stage by a mentally unstable fan during a Damageplan concert in [[Columbus, Ohio]]. Vinnie Paul went on to form [[Hellyeah]] after his brother's death and died of heart failure in 2018, leaving Brown and Anselmo as the only surviving members of the band's best-known lineup. In July 2022, it was announced that Brown and Anselmo were reuniting in 2023 for Pantera's first tour in 22 years, with [[Zakk Wylde]] and [[Charlie Benante]] filling in for the Abbott brothers on guitar and drums, respectively. The new lineup played its first show in 21 years at the Hell and Heaven festival in Mexico on December 2, 2022, and the tour will continue into 2026.",
  "last_revision_date": "2025-06-20T01:01:24Z"
}