{
  "name": "Parni Valjak",
  "description": "'''Parni Valjak''' ({{IPA|sh|pâːrniː ʋǎːʎak|pron}}; trans. ''[[Steamroller|Steam Roller]]'') is a [[Croatia]]n and [[SFRY|Yugoslav]] [[rock music|rock]] band formed in [[Zagreb]] in 1975. They were one of the most popular acts of the [[Popular music in the Socialist Federal Republic of Yugoslavia|Yugoslav rock scene]], and have maintained large popularity in all former Yugoslav republics after the [[Breakup of Yugoslavia|breakup of the country]].\n\nThe band was formed by guitarists [[Husein Hasanefendić|Husein Hasanefendić \"Hus\"]] and [[Jurica Pađen]] (both former members of [[Grupa 220]]), vocalist [[Aki Rahimovski]], bass guitarist Zlatko Miksić \"Fuma\" and drummer Srećko Antonioli. Immediately attracting the attention of the public with their energetic live performances and [[boogie rock]] sound, the band gained popularity with their early studio albums, ''Dođite na show!'' and ''Glavom kroz zid''. Following the release of their second studio album, Pađen left the band to form [[Aerodrom (band)|Aerodrom]], and was for a very brief period of time replaced by [[Branimir Štulić|Branimir \"Johnny\" Štulić]], later of [[Azra (band)|Azra]] fame. During the following decades, Hasanefendić and Rahimovski would remain the key figures and the only two mainstay members of the band. After a brief attempt to break into international market with an [[English language]] album released under the name '''Steam Roller''', the band joined in on the [[New wave music in Yugoslavia|Yugoslav new wave scene]] with the 1980 album ''Vruće igre'', which launched them to the top of the Yugoslav rock scene. With their following releases the band made a shift towards mainstream rock sound, scoring a large number of hits and remaining one of the most popular Yugoslav rock acts until the country's dissolution. They maintained large popularity in Croatia during the early 1990s, also restoring their popularity in other former Yugoslav republics in the following years and decades. In 2005, the group announced their disbandment, only to reunite four years later. After Rahimovski's death in 2022, the band continued their activity with vocalist Igor Drvenkar.",
  "last_revision_date": "2025-11-05T15:48:46Z",
  "genres": [
    148,
    535,
    846,
    943,
    1054
  ]
}