{
  "name": "Parov Stelar",
  "description": "'''Marcus Füreder''' (born November 27, 1974), known professionally as '''Parov Stelar''', is an Austrian music producer and DJ. He is considered a pioneer of [[electro swing]] and is one of the most internationally successful artists from Austria. In addition to his music, he is also known for his [[visual artwork]], which has been shown in numerous galleries and exhibitions.\n\nHis musical style blends [[electronic music]] with elements of [[jazz]], [[swing music|swing]], and [[blues]], characterized by a fusion of modern beats, vintage sounds, and distinctive brass sections. Many of his tracks have been used in [[films]], [[commercials]], and [[TV series]], and remain in demand worldwide.\n\nHe first gained recognition in the international [[club scene|club]] and [[festival|festival scene]] in 2004 with the release of the  [[EP]] ''KissKiss'', followed shortly by the album ''Rough Cuts''. These early works laid the foundation for his distinctive sound. With later tracks such as ''Catgroove'', ''Booty Swing'' and ''All Night'', he became one of the most-streamed electro swing artists and played a key role in shaping the genre. His music has consistently charted, including reaching #1 on the US iTunes Electronic Charts with ''The Sun'' (2018) and ''Voodoo Sonic Pt. 2'' (2020). His song ''All Night'' received double platinum certification in Italy (2017), and platinum in Germany (2023) and Austria (2025).\n\nSince 2005, Parov Stelar has brought his music to the stage with the Parov Stelar Band, a blend of DJ set and live instrumentation. The band has toured around the world, performing at major festivals such as [[Coachella]] (US), [[Glastonbury Festival|Glastonbury]] (UK), [[Sziget Festival|Sziget]] (HU), and [[Lollapalooza]] (DE)  and in sold-out venues like [[PlayStation Theater]] in New York, [[Alexandra Palace]] in London, and [[Zénith Paris|Zénith]] in Paris.\n\nTo date, Parov Stelar has released ten studio albums, one live album, and more than twenty EPs. He has received ten [[Amadeus Austrian Music Awards]] for his work.",
  "last_revision_date": "2025-11-14T10:52:58Z",
  "genres": [
    394,
    567
  ]
}