{
  "name": "Patsy Cline",
  "description": "'''Patsy Cline''' (born '''Virginia Patterson Hensley'''; September 8, 1932 – March 5, 1963) was an American singer. One of the most influential vocalists of the 20th century, she was known as one of the first [[country music]] artists to successfully [[Crossover music|cross over]] into [[pop music]]. Cline had several major hits during her eight-year recording career, including two number-one hits on the ''[[Billboard (magazine)|Billboard]]'' [[Hot Country Songs|Hot Country and Western Sides]] chart.\n\nBorn in [[Winchester, Virginia]], Cline's first professional performances began in 1948 at local radio station [[WINC (AM)|WINC]] when she was 15. In the early 1950s, Cline began appearing in a local band led by performer Bill Peer. Various local appearances led to featured performances on [[Connie B. Gay]]'s ''Town and Country'' television broadcasts. She signed her first recording contract with the [[Four Star Records|Four Star]] label in 1954, and had minor success with her earliest Four Star singles, including \"[[A Church, a Courtroom, Then Goodbye]]\" (1955) and \"I've Loved and Lost Again\" (1956). In 1957, Cline made her first national television appearance on ''[[Arthur Godfrey's Talent Scouts]]''. After performing \"[[Walkin' After Midnight]]\", the single became her first major hit on both the country and pop charts.\n\nCline's further singles with Four Star Records were unsuccessful, although she continued performing and recording. In 1958, she relocated to [[Nashville, Tennessee]], to further her career. Working with new manager Randy Hughes, Cline became a member of the [[Grand Ole Opry]] and then moved to [[Decca Records]] in 1960. Under the direction of producer [[Owen Bradley]], her musical sound shifted, and she achieved consistent success. The 1961 single \"[[I Fall to Pieces]]\" became her first to top the ''Billboard'' country chart. Cline was severely injured in an automobile accident, which caused her to spend a month in the hospital. After she recovered, her next single, \"[[Crazy (Willie Nelson song)|Crazy]]\", also became a major hit.\n\nDuring her final years, Cline had hits with \"[[She's Got You]]\", \"[[When I Get Through with You]]\", \"[[So Wrong]]\", and \"[[Leavin' on Your Mind]]\". She also toured and headlined shows with more frequency. On March 5, 1963, she was killed in the [[1963 Camden PA-24 crash]] along with country musicians [[Cowboy Copas]] and [[Hawkshaw Hawkins]], and manager Randy Hughes, during a flight from [[Kansas City, Missouri]], back to Nashville.\n\nSince her death, Cline has been cited as one of the most celebrated, respected, and influential performers of the 20th century. Her music has influenced performers of various styles and genres. She has also been seen as a forerunner for women in country music, being among the first to sell records and headline concerts. In 1973, she became the first female performer to be inducted into the [[Country Music Hall of Fame]]. In the 1980s, Cline's posthumous successes continued in the mass media. She was portrayed twice in major motion pictures, including the 1985 biopic ''[[Sweet Dreams (1985 film)|Sweet Dreams]]'' starring [[Jessica Lange]]. Several documentaries and stage shows about her have been made, including the 1988 musical ''Always...Patsy Cline''. A 1991 box set of her recordings received critical acclaim. Her [[Patsy Cline's Greatest Hits|greatest-hits album]] sold over 10 million copies in 2005. In 2011, Cline's [[Patsy Cline House|childhood home]] in [[Winchester, Virginia|Winchester]] was restored as a museum for visitors and fans to tour.",
  "last_revision_date": "2025-06-13T22:28:17Z",
  "genres": [
    1030,
    500,
    786,
    287,
    1200
  ]
}