{
  "name": "Paul Whiteman",
  "description": "'''Paul Samuel Whiteman''' (March 28, 1890 – December 29, 1967) was an American Jazz [[bandleader]], composer, orchestral director, and violinist.\n\nAs the leader of one of the most popular dance bands in the United States during the 1920s and early 1930s, Whiteman produced recordings that were immensely successful, and press notices often referred to him as the \"'''King of Jazz'''\". His most popular recordings include \"[[Whispering (song)|Whispering]]\", \"[[Valencia (song)|Valencia]]\", \"[[Three O'Clock in the Morning]]\", \"[[In a Little Spanish Town]]\", and \"[[The Parade of the Tin Soldiers|Parade of the Wooden Soldiers]]\". Whiteman led a usually large ensemble and explored many styles of music, such as blending [[symphonic music]] and [[jazz]], as in his debut of ''[[Rhapsody in Blue]]'' by [[George Gershwin]].\n\nWhiteman recorded many jazz and pop standards during his career, including \"[[Wang Wang Blues]]\", \"[[Mississippi Mud]]\", \"Rhapsody in Blue\", \"[[Wonderful One]]\", \"[[Hot Lips]] (He's Got Hot Lips When He Plays Jazz)\", \"[[Mississippi Suite]]\", \"[[Grand Canyon Suite]]\", and \"[[Trav'lin' Light (song)|Trav'lin' Light]]\". He co-wrote the 1925 jazz classic \"[[Flamin' Mamie]]\". His popularity faded in the [[swing music]] era of the mid-1930s, and by the 1940s he was semi-retired from music. He experienced a revival and had a comeback in the 1950s with his own network television series, ''[[Paul Whiteman's Goodyear Revue]]'', which ran for three seasons on [[American Broadcasting Company|ABC]]. He also hosted the 1954 ABC talent contest show ''[[On the Boardwalk with Paul Whiteman]]''.\n\nWhiteman's place in the history of early jazz is somewhat controversial. Detractors suggest that his ornately orchestrated music was jazz in name only, lacking the genre's [[musical improvisation|improvisational]] and emotional depth, and co-opted the innovations of black musicians. Historians however note that Whiteman's fondness for jazz was genuine. He worked with black musicians as much as was feasible during an era of [[Racial segregation in the United States|racial segregation]]. His bands included many of the era's most esteemed white musicians, and his groups handled jazz admirably as part of a larger repertoire.\n\nCritic [[Scott Yanow]] declares that Whiteman's orchestra \"did play very good jazz. ... His superior dance band used some of the most technically skilled musicians of the era in a versatile show that included everything from pop tunes and waltzes to semi-classical works and jazz. ... Many of his recordings (particularly those with [[Bix Beiderbecke]]) have been reissued numerous times and are more rewarding than his detractors would lead one to believe.\"\n\nIn his autobiography, [[Duke Ellington]] declared, \"Paul Whiteman was known as the [[Jazz royalty|King of Jazz]], and no one as yet has come near carrying that title with more certainty and dignity.\"",
  "last_revision_date": "2026-01-04T22:44:34Z",
  "genres": [
    949,
    1192
  ]
}