{
  "name": "Pete Townshend",
  "description": "'''Peter Dennis Blandford Townshend''' ({{IPAc-en|'|t|aʊ|n|z|ən|d}}; born 19 May 1945) is an English musician. He is the co-founder, guitarist, keyboardist, second lead vocalist, principal songwriter and leader of [[the Who]], one of the most influential rock bands of the 1960s and 1970s. His aggressive playing style, poetic songwriting techniques and authorship of two [[rock opera]]s with the Who, as well as other projects, have earned him critical acclaim.\n\nTownshend has written more than 100 songs for 12 of the Who's studio albums. These include [[concept album]]s, the [[rock opera]]s ''[[Tommy (The Who album)|Tommy]]'' (1969) and ''[[Quadrophenia]]'' (1973), plus popular rock radio staples such as ''[[Who's Next]]'' (1971); as well as dozens more that appeared as non-album singles, bonus tracks on reissues, and tracks on rarities compilation albums such as ''[[Odds & Sods]]'' (1974). He has also written more than 100 songs that have appeared on his solo albums, as well as [[radio jingles]] and [[Theme music|television theme songs]].\n\nWhile known primarily as a guitarist, Townshend also plays keyboards, [[banjo]], [[accordion]], harmonica, [[ukulele]], [[mandolin]], violin, synthesiser, bass guitar, and drums; he is self-taught on all of these instruments and plays on his own solo albums, several Who albums, and as a guest contributor to an array of other artists' recordings. Townshend has also contributed to and authored many newspaper and magazine articles, book reviews, essays, books, and scripts, and he has collaborated as a lyricist and composer for many other musical acts.\n\nIn 1983, Townshend received the [[Brit Award]] for Lifetime Achievement and in 1990 he was inducted into the [[Rock and Roll Hall of Fame]] as a member of the Who. Townshend was ranked No. 3 in [[Dave Marsh]]'s 1994 list of Best Guitarists in ''The New Book of Rock Lists''. In 2001, he received a [[Grammy Lifetime Achievement Award]] as a member of the Who; and in 2008 he received [[Kennedy Center Honors]]. He was ranked No. 10 in Gibson.com's 2011 list of the top 50 guitarists, and No. 37 on ''Rolling Stone''{{'}}s 2023 list of 250 greatest guitarists of all time. He and [[Roger Daltrey]] received [[The George and Ira Gershwin Award]] for Lifetime Musical Achievement at [[UCLA]] on 21 May 2016.",
  "last_revision_date": "2025-06-04T18:10:10Z"
}