{
  "name": "Pete Burns",
  "description": "'''Peter Jozzeppi Burns''' (5 August 1959 – 23 October 2016) was an English singer, songwriter and television personality who formed the band [[Dead or Alive (band)|Dead or Alive]] in 1980 during the [[New wave music|new wave]] era and was the band's lead vocalist. Dead or Alive sold over 17 million albums and 36&nbsp;million singles worldwide, and their 1985 hit \"[[You Spin Me Round (Like a Record)]]\" was produced by the trio [[Stock Aitken Waterman]] (SAW) and became their first UK No. 1 [[Hit song|hit]] single. Dead or Alive's first three albums all reached the UK Top 30, with ''[[Youthquake (album)|Youthquake]]'' reaching the Top 10. Additionally, the band had seven UK Top 40 singles, two US Top 20 singles and another two singles which went to No. 1 on the US [[Hot Dance Music/Club Play]] chart. In 2016, ''[[Billboard (magazine)|Billboard]]'' magazine ranked Dead or Alive as one of the most successful dance artists of all time.\n\nDead or Alive's debut album, ''[[Sophisticated Boom Boom]]'', was released in 1984, producing a series of minor hits in the United Kingdom, most notably their version of \"[[That's the Way (I Like It)]]\" (originally recorded by [[KC and the Sunshine Band]]) which gave the band their first UK Top 40 hit. Their second album, ''[[Youthquake (album)|Youthquake]]'', brought Burns and the band international recognition, largely due to the success of the lead single, \"You Spin Me Round (Like a Record)\" which reached No. 1 on the [[UK Singles Chart]] and No. 11 on the US [[Billboard Hot 100|''Billboard'' Hot 100]] in 1985. In 2020, ''[[The Guardian]]'' ranked the song No. 5 in their list of \"The 100 Greatest UK No. 1s\" and ''[[Classic Pop]]'' ranked it No. 1 in their 2021 list of \"Top 40 Stock Aitken Waterman songs\". The album also contained three other UK Top 30 hits and was certified Gold by both the [[British Phonographic Industry (BPI)]] and the [[Recording Industry Association of America (RIAA)]].\n\nThe band's third album, ''[[Mad, Bad and Dangerous to Know (Dead or Alive album)|Mad, Bad and Dangerous to Know]]'', was released in 1986, scoring several further hit singles including \"[[Brand New Lover]]\", which peaked at No. 15 on the ''Billboard'' Hot 100 chart, and spent two weeks at No. 1 on the [[Hot Dance Club Songs|American dance chart]], in addition to \"[[Something in My House]]\", which peaked at No. 12 on the UK Singles Chart and No. 3 on the American dance chart. In 1987, a greatest hits album was released titled ''[[Rip It Up (Dead or Alive album)|Rip It Up]]'' containing singles from their two prior albums. The following year, ''[[Nude (Dead or Alive album)|Nude]]'' was released with singles \"[[Turn Around and Count 2 Ten]]\" and \"Come Home with Me Baby\" being chart successes in Japan and on the American dance chart. Burns had a significant impact and influence on Japanese [[pop culture]] especially with [[J-pop]] and [[visual kei]]. At the time, he was considered to have achieved greater [[superstar]] status in the region than both [[Michael Jackson]] and [[Madonna]].\n\nBurns continued to achieve attention in the British media following his appearance on ''[[Celebrity Big Brother (British series 4)|Celebrity Big Brother 4]]'', most prominently for his verbal tirades against housemates [[Jodie Marsh]] and [[Traci Bingham]]. He finished in fifth place on the finale, receiving 13.6% of the vote, and appeared on further television reality shows, including as a presenter. \n\nBurns was noted for his powerful, deep [[baritone]] voice along with his flamboyant dress style, [[eyepatch]], and [[androgynous]] [[gender bender]] appearance. Though he avoided labelling himself, Burns has been referred to as a gay icon and an individual who helped bring [[gay music]] into mainstream popularity, even though he was married to a woman during the height of his fame. Burns was also the subject of [[Tabloid (newspaper format)|tabloid]] speculation over his addiction to [[Plastic surgery|cosmetic surgery]] which bankrupted him and caused health problems.",
  "last_revision_date": "2025-12-07T23:47:49Z",
  "genres": [
    315,
    421,
    553,
    846,
    943,
    1192
  ]
}