{
  "name": "Pete Astudillo",
  "description": "'''Pedro Astudillo''' (born on December 1, 1963), is an American singer-songwriter, record producer, and dancer. Referred to as \"the Latino [[Babyface (musician)|Babyface]]\" by ''[[The Daily Journal (New Jersey)|The Daily Journal]]'', he is credited as a key figure behind [[Selena]]'s signature music style. Astudillo wrote or collaborated on some of the most popular [[Tejano music]] songs of the 1990s and was inducted into the [[Tejano Roots Hall of Fame]] in 2019. His impact on the United States [[Latin music]] scene lies in his role as a songwriter collaborator, according to ''[[Billboard (magazine)|Billboard]]'' magazine.\n\nAfter high school, he pursued [[music education]], forming Los Bad Boyz with [[Joe Ojeda]]. Discovered by a local DJ, they joined [[Selena y Los Dinos]], integrating in December 1988. Astudillo's addition involved harmonizing with Selena and performing various roles within the band's dynamic. Astudillo's contribution to songwriting for the group began with \"[[Besitos]]\" (1989), co-written with the group's producer-songwriter [[A. B. Quintanilla]], leading Selena y Los Dinos to explore the [[Cumbia music|cumbia]] genre. His compositions for ''[[Ven Conmigo (album)|Ven Conmigo]]'' (1990) contributed to its commercial success, ranking among the longest-running albums on the US ''Billboard'' [[Regional Mexican Albums]] chart. Supported by Los Dinos and signed to [[Q-Productions]], Astudillo released his debut solo album, ''Entregate a Mi'', in January 1992.\n\nAstudillo remained dedicated to Selena y Los Dinos, contributing to songwriting while on tour. He and A. B. co-wrote \"[[Como la Flor]]\" (1992), which became one of the most popular songs recorded by an artist of Mexican descent in the US. At the 1994 [[Broadcast Music Incorporated|BMI]] Latin Music Awards, Astudillo received Songwriter of the Year honors. He co-wrote \"[[Amor Prohibido (song)|Amor Prohibido]]\" and \"[[Bidi Bidi Bom Bom]]\" for Selena's ''[[Amor Prohibido]]'' (1994), both becoming chart-toppers on ''Billboard''{{'}}s [[Hot Latin Songs]] chart, while the latter became [[Billboard Top Latin Songs Year-End Chart#1994|the most successful US Latin single of 1994]]. On March 31, 1995, Selena was [[Murder of Selena|shot and killed]] and Astudillo resumed performing during the opening of [[Sea World Texas]], while still recovering from his mother's death the year prior.\n\nAstudillo released ''[[Como Te Extrano]]'' on December 1, 1995, as the title track served as a tribute to Selena and Astudillo's mother, Paz. The titular track peaked at number one on the [[Regional Mexican Songs]] chart, remaining for ten consecutive weeks. Astudillo received Most Promising Band honors at the [[1996 Tejano Music Awards]] and began to be hailed as the \"next big thing\" in the Tejano market. At the 1996 BMI Latin Music Awards, Astudillo tied with [[Juan Luis Guerra]] for Songwriter of the Year. ''Si Tu No Estas'' (1997) failed to replicate the commercial success achieved by its predecessor, as well as ''¿Dónde Estás Amor?'' (1999). Astudillo left Q-Productions in 2001 to forge his label, Peace Rock Records, and released his albums independently. After a stint as a [[Rock music|rocker]] with Ruido Añejo in the early 2010s, Astudillo returned to Tejano music with his band, Pete Astudillo y Tekno-Mex. His collaboration with A. B., on \"Pelón\" for Boyz of Kumbia, peaked at number 38 on ''Billboard''{{'}}s Regional Mexican Songs chart in April 2021.",
  "last_revision_date": "2025-12-15T12:04:01Z",
  "genres": [
    698,
    1214
  ]
}