{
  "description": "'''Petra''' is an American music group regarded as a pioneer of the [[Christian rock]] and [[contemporary Christian music]] genres and was, for many years, regarded as the \"world's most popular Christian rock band\". Formed in 1972, the band took its name from the Greek word for \"rock\". Though it disbanded formally in 2006, incarnations have played reunion shows in the years since and released two albums in November 2010, and in November 2017. In 2013, it reformed with a new drummer, Cristian Borneo, and recorded a new song titled \"Holy is Your Name\", before going back on tour.\n\nWith a style initially similar to [[The Eagles]] and [[Lynyrd Skynyrd]], Petra's sound evolved into a more energetic, driving rock sound in the early 1980s akin to [[Foreigner (band)|Foreigner]], [[Styx (band)|Styx]] and [[Journey (band)|Journey]]. Throughout the 1980s and into the early 1990s, Petra was one of the world's most popular Christian rock bands, with each of its albums during that period selling hundreds of thousands of copies while the band sold-out arenas and regularly placed songs at the top of Christian radio charts. With its lyrics, music and style, Petra influenced numerous other artists at a time when Christian rock experienced strong opposition from many conservative pastors and churches.\n\nIn more than three decades, the band experienced numerous lineup changes yet released [[Petra discography|20 studio albums]], as well as two Spanish-language and two live albums, selling nearly 10 million copies while being nominated for 13 [[Grammy Awards]], winning four, and winning 10 [[Dove Awards]]. Its biggest hit, \"The Coloring Song\", reached the top position on three Christian radio charts simultaneously, and at its peak, the band's tours rivaled [[Amy Grant]]'s in popularity among Christian audiences. Petra was the first rock band inducted into the [[Gospel Music Hall of Fame]] and the first Christian band whose memorabilia was included in the [[Hard Rock Cafe]] restaurant chain.\n\nThe band announced its retirement in 2005, launching a farewell tour that was recorded for release on CD and DVD. Petra's 33-year career ended with a performance in the early hours of January 1, 2006, in Murphy, North Carolina. However, the band has continued to perform sporadically since then. In November 2010, an incarnation of the band's mid-1980s lineup surfaced under the name Classic Petra. It released an album, ''Back to the Rock'', featuring one new song (\"Too Big To Fail\"), one song taken from Greg X. Volz's 2009 album ''God Only Knows'' (\"[Back To] The Rock\"), as well as re-recordings of hits from that era. The band released a companion live CD and DVD in 2011.  In 2023, the band celebrated its 50th anniversary with a US and world tour.\n\n{{TOC limit|limit=3}}",
  "last_revision_date": "2025-05-26T12:05:25Z"
}