{
  "name": "Phish",
  "description": "'''Phish''' is an American rock band formed in [[Burlington, Vermont]], in 1983. The band consists of guitarist [[Trey Anastasio]], bassist [[Mike Gordon]], drummer [[Jon Fishman]], and keyboardist [[Page McConnell]]. All four members perform vocals, with Anastasio being the primary lead vocalist. The band is known for their [[musical improvisation]] and [[Jam session#Rock|jams]] during their concert performances and for their devoted fan following.\n\nThe band was formed by Anastasio, Gordon, Fishman and guitarist [[Jeff Holdsworth]], who were joined by McConnell in 1985. Holdsworth left the band in 1986, and the lineup has remained stable since. Most of the band's songs are co-written by Anastasio and lyricist [[Tom Marshall (singer)|Tom Marshall]]. Phish began to perform outside of [[New England]] in the late 1980s and experienced a rise in popularity in the mid-1990s. In October 2000, the band began a two-year hiatus that ended in December 2002, and they disbanded again in August 2004. Phish reunited officially in October 2008 for subsequent reunion shows in March 2009 and since then have resumed performing regularly. All four members pursued solo careers or performed with side-projects and these projects have continued after the band reunited.\n\nPhish's music blends elements of a wide variety of genres including [[funk]], [[reggae]], [[progressive rock]], [[psychedelic rock]], [[Folk music|folk]], [[country music|country]], [[jazz]], [[blues]], [[Bluegrass music|bluegrass]], [[electronic music]], and pop. The band is part of a movement of improvisational rock groups, inspired by the format of the [[Grateful Dead]]'s live performances and colloquially known as \"[[jam band]]s\", that gained considerable popularity as touring concert acts in the 1990s. Phish has developed a large and dedicated following by word of mouth and the exchange of live recordings. As of 2020, the band had sold more than 8 million albums and DVDs in the United States.\n\nPhish were signed to major label [[Elektra Records]] from 1991 to 2005, when the band formed their own independent label, [[JEMP Records]], to release archival CD and DVD sets.",
  "last_revision_date": "2026-01-30T16:10:45Z",
  "genres": [
    42,
    430,
    473,
    632,
    638,
    986,
    995,
    1062
  ]
}