{
  "name": "PJ Harvey",
  "description": "'''Polly Jean Harvey''' {{postnominals|country=GBR|MBE}} (born 9 October 1969) is an English singer-songwriter. Primarily known as a vocalist and guitarist, she is also proficient with a wide range of instruments.\n\nHarvey began her career in 1988 when she joined local band Automatic Dlamini as a vocalist, guitarist and saxophonist. The band's frontman, [[John Parish]], is still her long-term collaborator. In 1991, she formed a trio called PJ Harvey and this began her career as PJ Harvey. The trio released two acclaimed studio albums called ''[[Dry (album)|Dry]]'' (1992) and ''[[Rid of Me]]'' (1993) before disbanding, after which Harvey continued as a solo artist. Since 1995, she has released a further ten studio albums with collaborations from various musicians including Parish, former bandmate [[Rob Ellis (producer)|Rob Ellis]], [[Mick Harvey]], and [[Eric Drew Feldman]], and has also worked extensively with record producer [[Flood (producer)|Flood]].\n\nAmong the [[List of awards and nominations received by PJ Harvey|accolades Harvey has received]] are both the 2001 and 2011 [[Mercury Prize]] for ''[[Stories from the City, Stories from the Sea]]'' (2000) and ''[[Let England Shake]]'' (2011), respectively, making her the only artist to have been awarded the prize twice. She has also received a [[BAFTA Award]], eight [[Brit Awards|Brit Award]] nominations, eight [[Grammy Awards|Grammy Award]] nominations and two further Mercury Prize nominations. ''[[Rolling Stone]]'' awarded her three accolades: 1992's Best New Artist and Best Singer Songwriter, and 1995's Artist of the Year. She was awarded for Outstanding Contribution to Music at the [[NME Awards|''NME'' Awards]]. In the [[2013 Birthday Honours]], she was appointed a [[Member of the Order of the British Empire]] (MBE) for services to music.\n{{TOC limit|3}}",
  "last_revision_date": "2025-06-14T21:41:23Z",
  "genres": [
    435,
    40,
    964,
    514,
    65,
    575,
    418
  ]
}