{
  "description": "'''Plena Libre''' is a [[plena]] and [[bomba (Puerto Rico)|bomba]] group. Their music follows traditional forms while also drawing on other styles of music. In a biographical summary of the group, Steve Huey of ''[[Allmusic]]'' observed that the group's blend of \"contemporary dance arrangements... (and) the long-ignored Puerto Rican folklore-derived plena style... return(ed) the style to prominence.\" A popular live act over the course of a 20-year, 14-album career, the Puerto Rican ensemble are known for strong musicianship; for example, Chris Nickson of ''Allmusic'', in noting the blending of [[jazz]] elements with plena on the ''Mas Libre'' CD, described the group's delivery of said as \"highly accomplished\".\n\nPlena Libre have toured internationally, with notable live dates including the [[Morocco|Moroccan]] ''Fes Festival'' in 2008, and the [[Playboy Jazz Festival]] at the [[Hollywood Bowl]] that same year. Regarding their performance at the latter event, the ''[[LA Times]]'' praised the \"sizzling Latin jazz and [[salsa music|salsa]] grooves\" that both Plena Libre and another act on the bill, [[Poncho Sanchez]], displayed. September 2013 saw the group play [[World Music Festival Chicago]].\n\nPlena Libre have received multiple [[Grammy]] and [[Latin Grammy]] nominations. The group received their first Latin Grammy nomination, in the category “Best Tropical Traditional Album”, for their 2001 recording ''Mas Libre''. The nomination represented the first nomination for a Puerto Rican group in the category. In 2003 the recording ''Mi Ritmo'' was Grammy and Latin Grammy nominated, again in the “Best Tropical Traditional Album” category.  The 2006 Latin Grammys saw an additional nomination for Best Tropical Traditional Album for the group, this time for their recording ''Evolucion''.\n\nAmong the notable musicians that have recorded with Plena Libre are master pianist [[Eddie Palmieri]] and [[Nestor Torres]].\n  \n''[[National Geographic (magazine)|National Geographic]]'' has recognized Plena Libre as one of four Puerto Rican musical acts, along with [[Ricky Martin]], [[Marc Anthony]], and [[Jennifer Lopez]], that are \"spearheading the Latin invasion of American popular music\".",
  "last_revision_date": "2024-11-10T03:26:35Z"
}