{
  "name": "Presuntos Implicados",
  "description": "'''Presuntos Implicados''' was a Spanish [[pop music|pop]] band, created in March 1983 in [[Yecla]], Murcia. The band was originally composed of the siblings [[:es:Sole Giménez|Sole Giménez]] and Juan Luís Giménez, and their friend Pablo Gómez. In the same year 1983, they won a radio contest and their first recording, ''Danzad, Danzad Malditos'', appeared one year later under the [[RCA Corporation|RCA]] label. But the record company forced them to write more commercial songs outside their style, and they left in 1986 to work with an independent label, Discos Intermitentes. Pablo Gómez left the group and Javier Vela arrived to replace him.\n\nIn 1987, they recorded their ''De sol a sol'' album and their song \"En la oscuridad\" (In the darkness) was chosen as best single of the year by [[Radio Nacional de España|RNE]]. This recording went to be double platinum and allowed them to sign a contract with [[Warner Music Group|WEA Records]]. Javier Vela left and was replaced by Nacho Mañó, who had produced ''De sol a sol''.\n\nOver an eight year period, the band prolifically released new recordings, each time adding more Latino, Brazilian, and [[jazz]] sounds to their usual pop and [[funk]] repertoire, and always led by the distinctive voice of [[:es:Soledad Giménez|Sole Giménez]]. The three members of the group controlled all aspects of their recordings, including [[musical composition|composition]], [[arrangement]]s, and record production.\n\nIn 1995, they gave a big concert in the [[Palau de la Música de València|Palau de la Música]] in [[Valencia (city in Spain)|Valencia]] producing a double live album called ''La Noche'', which featured a duet between [[:es:Sole Giménez|Sole Giménez]] and [[Randy Crawford]] and another one with [[Ana Torroja]] (vocalist of the Spanish pop group [[Mecano]]) in Torroja's first public appearance after Mecano's first break up, singing with Sole Giménez on one of Presuntos' hits, \"Cada historia\".\n\nAfter a two year break, the band released ''Siete'' in 1997, supported by a long tour. ''Versión Original'' (1999), their next album, is an homage to some of their favourite songs, especially dedicated to their Latin influences. ''Gente'' (2001) resulted in a breaking album, with the title track as a hit.\n\nThe album ''Postales'' (2005), changed the tone of their lyrics to tackle social and pacifist topics. As with previous albums, the band supported this release with a tour, at first with the core band, and later in an acoustic lineup in theatres and small venues.\n\nTwenty years after their debut, Presuntos Implicados became one of the top groups in the Spanish music landscape. However, in February 2006, lead vocalist [[:es:Sole Giménez|Sole Giménez]] announced she was leaving the band in May at the close of the tour.  Sole and Juan Luís went on to establish solo careers; Juan Luís would record under different names and many more records. Nacho and Juan Luís are also top producers for many bands in Spain.\n\nPresuntos Implicados' final lead vocalist was [[Lydia (singer)|Lydia]]., heard on the album ''Será'' (September 2008), with 14 tracks.",
  "last_revision_date": "2025-11-18T02:34:04Z",
  "genres": [
    319,
    1143,
    1152
  ]
}