{
  "name": "Presuntos Implicados",
  "description": "'''Presuntos Implicados''' was a Spanish [[pop music|pop]] band, created in March 1983 in [[Yecla]], Murcia. The band was originally composed of the siblings [[:es:Sole Giménez|Sole Giménez]] and Juan Luis Giménez, and their friend Pablo Gómez. In the same year 1983, they won a radio contest and their first recording, ''Danzad, Danzad Malditos'', appeared one year later under the [[RCA]] label. But the record company forced them to write more commercial songs outside their style, and they left in 1986 to work with an independent label, Discos Intermitentes. Pablo Gómez left the group and Javier Vela arrived to replace him.\n\nIn 1987, they recorded their ''De sol a sol'' album and their song \"En la oscuridad\" (In the darkness) was chosen as best single of the year by [[Radio Nacional de España|RNE]]. This recording went to be double platinum and allowed them to sign a contract with [[Warner Music Group|WEA Records]]. Javier Vela left and was replaced by Nacho Mañó, who had produced ''De sol a sol''.\n\nThey kept releasing recordings, adding more Latino, Brazilian and [[jazz]] sounds to their usual pop and [[funk]] combination, always led by the characteristic voice of [[:es:Soledad Giménez|Sole Giménez]]. The three members of the group controlled all aspects of their recordings, from the [[musical composition|composition]], the [[arrangement]]s to the record production.\n\nIn 1995, they gave a big concert in the [[Palau de la Música de València|Palau de la Música]] in [[Valencia (city in Spain)|Valencia]] and it was also recorded into a double live album called ''La Noche'', which featured a duet between [[:es:Sole Giménez|Sole Giménez]] and [[Randy Crawford]] and another one with [[Ana Torroja]] (vocalist of the Spanish pop group [[Mecano]]) in her first public appearance after Mecano's first break up, singing with Sole Giménez one of Presuntos' hits, \"Cada historia\".\n\nAfter a long time with no new material they release ''Siete'' in 1997, which takes them on a long tour. ''Versión Original'', their next album, is an homage to some of their favourite songs, especially dedicated to their Latin influences. ''Gente'' turns out to be a breaking album, with the title track becoming a hit.\n\nTheir latest album, ''Postales'', changes the tone of their lyrics and brings in some social and pacifist topics. The band tours the new album in 2005, first with their usual band, then in an acoustic set tour on theatres and small venues.\n\nTwenty years after their debut, Presuntos Implicados is one of the top groups in the Spanish music landscape. However, in February 2006, their singer, [[:es:Sole Giménez|Sole Giménez]] announced she was leaving the band in May after the tour ends. Sole and Juan Luis both have solo careers (Juan Luis under different names and with a lot of more records). Nacho and Juan Luis are also top producers for many bands in Spain.\n\nBut Presuntos Implicados go on with a new singer, [[Lydia (singer)|Lydia]]. With her they release ''Será'' in September 2008, which included 14 new songs.",
  "last_revision_date": "2025-06-02T23:47:10Z"
}