{
  "name": "Primus",
  "description": "'''Primus''' ({{IPAc-en|ˈ|p|r|aɪ|m|ʌ|s}} {{respell|PRY|mus}}) is an American [[Rock music|rock]] band formed in [[El Sobrante, Contra Costa County, California|El Sobrante, California]] in 1984. As of March 2025, the band is composed of bassist/vocalist [[Les Claypool]], guitarist [[Larry LaLonde|Larry \"Ler\" LaLonde]], and drummer John Hoffman. Primus originally formed in 1984 with Claypool and guitarist [[Todd Huth]], later joined by drummer [[Jay Lane]], though the latter two had departed by the beginning of the band's recording career in 1989, replaced by LaLonde and [[Tim Alexander (American drummer)|Tim \"Herb\" Alexander]] respectively.\n\nThe \"classic\" lineup of Claypool, LaLonde and Alexander debuted with the live album ''[[Suck on This]]'', which was self-released in 1989 on Claypool's label [[Prawn Song Records|Prawn Song]] and reissued a year later by [[Caroline Records]]. Caroline also released Primus' debut studio album ''[[Frizzle Fry]]'' (1990), which was critically well received, and its underground success led to interest from major record labels. Their second studio album and major-label debut ''[[Sailing the Seas of Cheese]]'' (1991), released through [[Interscope Records]], launched the band into mainstream exposure, supported by their first charting single \"[[Jerry Was a Race Car Driver]]\" and receiving [[Music recording certification|platinum certification]] within a decade after its release. Primus repeated its success with their next two albums, ''[[Pork Soda]]'' (1993) and ''[[Tales from the Punchbowl]]'' (1995), both charting in the top ten on the [[Billboard 200|''Billboard'' 200]], and being certified platinum and gold respectively by the [[Recording Industry Association of America|RIAA]]. ''Pork Soda'' featured the band's top ten hit on the ''Billboard'' [[Alternative Airplay|rock chart]], \"[[My Name Is Mud]]\", while ''Tales from the Punchbowl''{{'}}s lead single \"[[Wynona's Big Brown Beaver]]\" holds the distinction of being the band's only song to chart anywhere outside of North America.\n\nAlexander left the band in 1996 and was replaced by [[Brain (musician)|Bryan \"Brain\" Mantia]], with whom Primus recorded two more studio albums – ''[[Brown Album]]'' (1997) and ''[[Antipop]]'' (1999) – as well as the covers EP ''[[Rhinoplasty (EP)|Rhinoplasty]]'' (1998) and the original theme song for the TV show ''[[South Park]]''. The band went on hiatus in 2000 but resumed activity in 2003, reuniting with Alexander for the EP/DVD ''[[Animals Should Not Try to Act Like People]]'' and touring sporadically throughout the 2000s before Alexander left a second time in 2010. Lane rejoined the band and appeared on their seventh studio album – and first in twelve years – ''[[Green Naugahyde]]'' (2011). Following Lane's departure in 2013, Alexander returned to the band once again and Primus would record two more albums with him – ''[[Primus & the Chocolate Factory with the Fungi Ensemble]]'' (2014) and ''[[The Desaturating Seven]]'' (2017) – as well as the EP ''[[Conspiranoid]]'' (2022). Alexander announced his third departure from the band in October 2024, and was replaced four months later by John Hoffman.\n\nPrimus is characterized by its irreverent, quirky approach to music distinguished by Claypool's bass-centric songwriting and eccentric lyrical themes. The band's musical style, which draws influences from [[progressive rock]], [[Heavy metal music|metal]], [[funk]], and [[psychedelic music]], has been noted as difficult to categorize and is most frequently described by critics as [[funk metal]], a label the band has rejected. In 1993, [[Robert Christgau]] remarked: \"[Primus is] quite possibly the strangest [[Billboard 200|top-10]] band ever, and good for them.\"",
  "last_revision_date": "2025-12-19T23:08:41Z",
  "genres": [
    39,
    425,
    464,
    976
  ]
}