{
  "name": "Promises",
  "description": "'''Promises''' was a [[Canada|Canadian]]-based pop group which was founded 1978 in [[Thousand Oaks]], [[California]]. The members were siblings Leslie Maria Knauer (born August 20, 1957, Vancouver, vocals, bongos), Jed Knauer (born July 17, 1955, Toronto, guitar, piano) and Benny Knauer (born October 21, 1958, Vancouver, keyboards and vocals). Their father Peter Knauer was a German from [[Hamburg]] who moved with his children from Canada to California in the late 1960s.\n \nPromises was formed, recorded and produced by Steve Verroca, who leased the group's album to [[EMI]] in the Netherlands on its Bovema Negram imprint. In February 1979, the [[soft rock]] single \"Baby It's You\" became a smash hit around the world, especially in Europe, where it reached number 4 in the German charts, and Promises received a [[Gold album]] there for selling more than 260,000 units. The song was also hugely popular in [[Australia]], largely due to programming of its promotional video on Sunday evening television music show [[Countdown (Australian TV series)|Countdown]]. The song was subsequently released on a highly popular compilation album in that market. It also reached number one on the [[RIANZ|New Zealand Singles Chart]] for five weeks. \"Baby It's You\" was a success in [[South Africa]] as well, also appearing on Volume 7 of that country's long-running compilation album series \"Pop Shop\". The video also received a lot of airplay on South African television.\n\nWith their second single \"Lets Get Back Together\" being much less successful (only reaching number 18 in Germany), and Leslie wanting the group to become more of a [[punk rock|punk]] band, they broke up. It is often said that Promises was a flop in the United States, but due to disagreements between EMI-EAR and [[Capitol Records]] in Los Angeles, Capitol refused to sign the group and Promises was never released in the U.S. Once the group was no longer signed to EMI-EAR, and under new manager Toby Mamis, they entered the studio to record a U.S. album for Capitol, produced by [[Jack Nitzsche]]. Producer Verroca had used many recording tricks for Leslie's voice that Nitzsche was unaware of, leading to friction with the new producer. Leslie insisted on recording full takes without overdubs. The album's recording sessions were subsequently halted, and the group broke up.\n\nLeslie Knauer (Knauer-Wasser during a relationship with photographer Julian Wasser) went on to join and release a single with the group Roxy Roller with former [[London (heavy metal band)|London]] guitarist [[Lizzie Grey]], and later became a member of the group [[Precious Metal (band)|Precious Metal]] (1983-1992), represented by music attorney Stann Findelle, who made their first recording deal with [[PolyGram]] and went on to record on [[Chameleon (label)|Chameleon Records]]. Leslie was later a member of Kanary (2004), and sang two songs for the [[Dennis Hopper]] [[film|movie]], ''Choke'' (2001). Leslie's daughter Alexi Wasser is an actress.",
  "last_revision_date": "2025-04-27T09:05:13Z",
  "genres": [
    1156
  ]
}