{
  "description": "'''Ramdew Chaitoe''' (19 December 1942 - 6 June 1994) was a [[Suriname]]se musician and a [[Pump organ|harmonium]] player, who released a [[Baithak Gana]] album called ''The King Of Suriname a.k.a The Star Melodies of Ramdew Chaitoe in 1976''. Rumors exist about how Chaitoe started his career singing in jail after being arrested in a bar fight.\n \nRamdew grew up on a farm. His father, songwriter/lyricist and harmonium instrumentalist [[Pandit|Pundit]] Shastrie Sewpersad Chaitoe, was a considerable influence on Ramdew, inaugurating his son early in the musical art form, by having him perform weekly at Hindu temple ceremonies. This allowed the young Chaitoe to become skilled at his craft, thus allowing him to perform with the top singers and composers in Suriname as he matured. Throughout his travels in the [[Caribbean]], Chaitoe acquired a strong reputation as a skilled harmonium player and singer. Ramdew Chaitoe traveled from the West Indies to Europe, and also had a show in New York.\n\nIn 1976, Chaitoe released ''The King Of Suriname a.k.a The Star Melodies of Ramdew Chaitoe''. This album is considered to be the first [[Baithak Gana]] album ever in [[Suriname]]. Moreover, due to the exposure that he received from this album, Chaitoe became a household name not just in [[Suriname]] but in the [[Indo-Caribbean]] world as well. In the popular manner of composition at the time, Chaitoe composed this album with religious and folk songs from the [[Purvanchal]]-[[Bhojpuri region|Bhojpur]], and [[Awadh]] regions of the present-day states of [[Uttar Pradesh]] and [[Bihar]] in [[India]]. These songs, like blue bhajans, captivated audiences with Chaitoe's artistic trend not just in Suriname but all over the [[Indo-Caribbean]] community. Chaitoe is regarded as one of the best singers of the [[Caribbean]] genre of [[Baithak Gana]], which is still seen as the authoritative music genre in the Hindustani community. Though on the evening of June 6, 1994, Ramdew Chaitoe's life was cut short of a massive heart attack during his sleep in his home in [[Rotterdam]], he left behind dozens of pieces of music for his thousands of fans throughout the [[Indo-Caribbean]] world. He suffered from [[alcoholism]]. Chaitoe is outlived by his son Pradeep Chaitoe, who is carrying on his legacy and tradition of singing and a sister Bidjanwatie Chaitoe, who is also a singer.",
  "last_revision_date": "2024-11-29T13:30:20Z"
}