{
  "name": "Ramones",
  "description": "The '''Ramones'''{{efn|The band is often referred to as '''the Ramones''', though most of the band's releases refer to them as simply \"Ramones\". Some compilation albums use \"The Ramones\".}} were an American [[punk rock]] band formed in the [[New York City]] neighborhood [[Forest Hills, Queens]] in 1974. Known for helping establish the punk movement in the United States and elsewhere, the Ramones are often recognized as one of the first bands of the genre. Although they had never achieved significant commercial success during their existence, the band is seen today as highly influential in [[Punk subculture|punk culture]].\n\nAll members adopted pseudonyms ending with the surname Ramone, although none were biologically related; they were inspired by [[Paul McCartney]], who would check into hotels under the alias Paul Ramon. The Ramones performed 2,263&nbsp;concerts, touring virtually nonstop for 22&nbsp;years, and released fourteen studio albums. In 1996, after a tour as part of the [[Lollapalooza]] music festival, they played a [[We're Outta Here!|farewell concert]] in Los Angeles and disbanded.\n\nBy 2014, all four original members had died: lead singer [[Joey Ramone]] (1951–2001), bassist [[Dee Dee Ramone]] (1951–2002), guitarist [[Johnny Ramone]] (1948–2004) and drummer [[Tommy Ramone]] (1949–2014). The Ramones had experienced a few lineup changes, with Joey and Johnny as the only constant members. Tommy left the band in 1978 to pursue a career in [[Record producer|record production]], and was replaced by [[Marky Ramone]], who himself was replaced by [[Richie Ramone]] in 1983. Following Richie's departure in 1987, and a brief stint with [[Clem Burke|Elvis Ramone]], Marky rejoined the band and Dee Dee departed two years later, being replaced by [[C. J. Ramone]]. From 1989 to their breakup in 1996, the Ramones consisted of Joey, Johnny, Marky and C. J. Ramone.\n\nRecognition of the band's importance has built over the years. The Ramones were ranked number 26 in ''[[Rolling Stone]]'' magazine's 2004 list of the \"[[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]\" and number 17 in [[VH1]]'s 2012 television series ''100 Greatest Artists of Hard Rock''. In 2002, the Ramones were ranked the second-greatest band of all time by ''[[Spin (magazine)|Spin]]'', trailing only [[the Beatles]]. On March 18, 2002, the original four members and Tommy's replacement on drums, Marky Ramone, were all inducted into the [[Rock and Roll Hall of Fame]] in their first year of eligibility. In 2011, the band was awarded a [[Grammy Lifetime Achievement Award]].",
  "last_revision_date": "2025-12-21T00:11:16Z",
  "genres": [
    944,
    1000
  ]
}