{
  "name": "RBD",
  "description": "'''RBD''' was a Mexican [[Latin pop]] group that gained popularity from [[Televisa]]'s telenovela ''[[Rebelde]]'' (2004–2006). It was composed of [[Anahí]], [[Dulce María]], [[Maite Perroni]], [[Alfonso Herrera]], [[Christopher von Uckermann]] and [[Christian Chávez]]. The group achieved international success from 2004 until their separation in 2009 and sold over 15 million records worldwide, making them one of the [[List of best-selling Latin music artists|best-selling Latin music artists of all time]].\n\nIn November 2004, the group released their debut studio album, ''[[Rebelde (album)|Rebelde]]'', to great success. In September 2005, the group released their second album, ''[[Nuestro Amor]]'', receiving their first [[Latin Grammy Awards|Latin Grammy Award]] nomination at the [[7th Annual Latin Grammy Awards|2006 ceremony]]. In 2006, the group released their third album, ''[[Celestial (RBD album)|Celestial]];'' this was their first album to be released simultaneously in all countries. The album's [[lead single]], \"[[Ser o Parecer]]\", topped the [[Hot Latin Songs|''Billboard'' Hot Latin Songs]] chart for two consecutive weeks. In the same year, the group released their fourth album, and first English-language project titled ''[[Rebels (album)|Rebels]]''. In 2007, the group released their fifth album  ''[[Empezar Desde Cero]]'', which was nominated at the [[Latin Grammy Awards]]. In 2009, the group released their sixth and final album, ''[[Para olvidarte de mí|Para Olvidarte De Mí]]''.\n\nRBD officially formed on 30 October 2004, and announced on 15 August 2008, through a press release, that they would disband on 10 March 2009. In September 2020, the band announced they would reunite through a virtual show in December, and their music was released on digital platforms the same month. Four of the original members returned: Maite Perroni, Anahí, Christopher von Uckermann and Christian Chávez. Almost three years later, on 19 January 2023, they announced that all members would return for a one-off tour, titled [[Soy Rebelde Tour]], with the exception of Alfonso Herrera.",
  "last_revision_date": "2026-01-18T02:59:33Z",
  "genres": [
    705,
    951,
    1222
  ]
}