{
  "name": "Rhapsody of Fire",
  "description": "'''Rhapsody of Fire''' (formerly known as '''Rhapsody''') is an Italian [[symphonic power metal]] band formed by [[Luca Turilli]] and [[Alex Staropoli]], widely seen as a pioneer of the symphonic power metal subgenre.\n\nSince forming in 1993 as '''Thundercross''', the band has released fourteen [[studio albums]], two [[live albums]], three [[Extended play|EP]]s, and a [[Album#Live|live DVD]]. Rhapsody of Fire is known for its [[concept album|conceptual]] lyrics that constitute a [[fantasy]] story throughout all of their albums from [[Legendary Tales|1997]] to [[From Chaos to Eternity|2011]]. After using the moniker of Rhapsody for nearly ten years, the band changed its name to Rhapsody of Fire in 2006 due to trademark issues.\n\nIn 2011, following the release of their album ''[[From Chaos to Eternity]]'' which concluded The Dark Secret Saga, and after 18 years as co-leader of the band, Turilli left Rhapsody of Fire (on good terms) to form a new Rhapsody band, [[Luca Turilli's Rhapsody]], along with two other members who left with him, Dominique Leurquin, [[Patrice Guers]]. They describe their discography as a parallel continuation of Rhapsody of Fire's discography, with their [[Ascending to Infinity|first album]] being their own \"Rhapsody's 11th album\" and consider that they didn't leave the band, rather that it amicably split in two.\n\nIn 2016, other long-term members [[Fabio Lione]] and Alex Holzwarth left the band, and reunited with Turilli, Leurquin, and Guers, to play again under the name Rhapsody for their 20th Anniversary Farewell Tour; in December 2018, several months after announcing that Luca Turilli's Rhapsody was now inactive, Turilli announced the creation of a new Rhapsody band named [[Turilli / Lione Rhapsody]], with the lineup of the 20th Anniversary Farewell Tour (recreating, minus Staropoli, the original band's 2002–2011 lineup), which had since disbanded in 2023.",
  "last_revision_date": "2026-01-16T18:45:35Z",
  "genres": [
    828,
    1200
  ]
}