{
  "name": "Richard Ramirez",
  "description": "'''Richard Ramirez''' is an American [[noise music]] artist originally from [[Houston]], [[Texas]], recording and performing both as a solo artist and as part of several groups, including [[Black Leather Jesus]], Priest in Shit, An Innocent Young Throat-Cutter, [[House of the Black Death]], Martyr of Sores, Last Rape and the \"static noise\" solo project Werewolf Jerusalem. He is notable for being one of the earliest American [[harsh noise]] artists{{Citation needed|date=August 2009}}.\n\nRamirez draws a distinction between his relatively few professionally printed [[Compact disc|CDs]] and [[Gramophone record|LPs]] and the many [[CD-R]]s and [[Compact audio cassette|tapes]] he produces for smaller record labels.{{Citation needed|date=November 2007}}  He has done collaborations and split releases with many important figures in the noise field, including [[Merzbow]], [[Emil Beaulieau]], [[Kommissar Hjuler]] & [[Mama Baer]], Skin Crime, [[The Haters]], [[Prurient]], Smell & Quim, [[Macronympha]], Stabat Mors, Kenji Siratori, Sudden Infant, and MSBR.{{Citation needed|date=November 2007}}\n\nRamirez's work tends to consist of long, slowly changing or static tracks of heavily [[Distortion|distorted]] low- to mid-range noise, with a gradual move over the last several years toward more [[Dronology|drone]]-influenced sounds in addition to his harsh noise work. Parallel to this evolution has been a shift in thematic concerns, with album covers, titles, and general themes changing from more typical noise music concerns such as violence and war (largely borrowed from [[Industrial music|industrial]] culture) to a focus on homosexual themes and [[gay pornography]] artwork. In addition to his musical work, Ramirez also runs the noise and [[experimental music]] label Deadline Recordings. Ramirez is also an \"avant-garde\" fashion designer under the alias, Richard Saenz.\nHe recently collaborated with Giovanni Mori, musician power noise, mind of the project L.C.B., his album ''Born'' ([[Old Europa Cafe]] in 2015) and has also made with L.C.B. an album on cassette entitled \"Homo Sense\" (Black Leather Jesus - Le Cose Bianche, Signora Ward Records).",
  "last_revision_date": "2024-09-23T15:43:07Z",
  "genres": [
    539,
    933,
    363
  ]
}