{
  "name": "Richard Thompson",
  "description": "'''Richard Thompson''' {{Post-nominals|country=UK|OBE}} (born 3 April 1949) is an English singer, songwriter, and guitarist.\n\nThompson first gained prominence in the late 1960s as the lead guitarist and songwriter for the folk rock group [[Fairport Convention]], which he had co-founded in 1967. After departing the group in 1971, Thompson released his debut solo album ''[[Henry the Human Fly]]'' in 1972. The next year, he formed a duo with his wife [[Linda Thompson (singer)|Linda Thompson]], which produced six albums, including the critically acclaimed ''[[I Want to See the Bright Lights Tonight]]'' (1974) and ''[[Shoot Out the Lights]]'' (1982). After the dissolution of the duo, Thompson revived his solo career with the release of ''[[Hand of Kindness]]'' in 1983. He has released eighteen solo studio albums. Three of his albums{{--}}''[[Rumor and Sigh]]'' (1991), ''[[You? Me? Us?]]'' (1996), and ''[[Dream Attic]]'' (2010){{--}}have been nominated for [[Grammy Award]]s, while ''[[Still (Richard Thompson album)|Still]]'' (2015) was his first UK Top Ten album. He continues to write and record new material and has frequently performed at venues throughout the world, although the [[COVID-19 pandemic]] forced him to suspend his touring.\n\nMusic critic [[Neil McCormick]] described Thompson as \"a versatile [[virtuoso]] guitarist and a sharp observational singer-songwriter whose work burns with intelligence and dark emotion\". His songwriting has earned him an [[Ivor Novello Awards|Ivor Novello Award]] and, in 2006, a lifetime achievement award from BBC Radio. His 1991 song \"[[1952 Vincent Black Lightning]]\" was included in ''[[Time (magazine)|Time]]'' magazine's \"All-TIME 100 Songs\" list of the best English-language musical compositions released between 1923 and 2011. Thompson was appointed [[Officer of the Order of the British Empire]] (OBE) in the [[2011 New Year Honours]] for services to music. Many varied musicians have recorded Thompson's compositions.\n\nHis memoir, ''Beeswing: Losing My Way and Finding My Voice, 1967–1975'', was published in 2021.",
  "last_revision_date": "2025-09-17T07:20:47Z",
  "genres": [
    170,
    277
  ]
}