{
  "name": "Rising Appalachia",
  "description": "'''Rising Appalachia''' is an American [[Appalachian music|Appalachian folk music]] group, led by [[multi-instrumentalist]] sisters [[Leah Song]] and [[Chloe Smith (musician)|Chloe Smith]]. Their music is deeply rooted in the landscapes of [[Atlanta]], [[New Orleans]], and the southern [[Blue Ridge Mountains]] of [[Appalachia]].{{sfn|Orris|n.d.}} What distinguishes Rising Appalachia is their ability to blend a diverse range of instruments and styles. Their musical palette spans from sister harmonies, ballads, [[banjo]]s, fiddle, cello, [[Double bass|upright bass]], baritone guitar, [[djembe]] and world percussion. This distinctive combination gives rise to a musical mosaic that seamlessly interweaves elements of [[Americana music|Americana]], [[world music|world]], [[folk music|folk]], and [[soul music]].\n\nThe essence of Rising Appalachia's uniqueness lies in their nonconformity to the mainstream [[music industry]]. From the outset, the project was a labor of love for the Smith sisters, who independently managed and financed their music. Their musical journey began with an intimate gesture—a gift of music for their close circle. The unexpectedly positive reception spurred them to establish Rising Appalachia as a musical force. Their artistic trajectory mirrors their sonic explorations: a fusion of Appalachian heritage, music of the Celtic Isles with the vibrant pulse of urban genres, all adorned with a rich tapestry of world music collected during their global travels and musical studies.\n\nThe collective's identity has evolved through various phases, including a stint as R.I.S.E., during which they released the live album ''Evolutions in Sound''. Their commitment to uniting art with [[activism]] and community engagement led to the inception of the Rise Collective—a diverse assembly of performers, educators, activists, and artists. This collaborative effort encompasses an array of artistic expressions, from [[acro-yoga]] to [[fire spinning]] and sound workshops. The Smith sisters' dedication to leveraging their art for positive change and cultural development remains at the core of their creative ethos.\n\nRising Appalachia's journey has seen them traverse continents, gracing stages at musical festivals across the globe—from the United States to countries like Colombia, Costa Rica, Canada, India, Italy,{{sfn|Brooklyn Daily|2008}} Bulgaria, Hungary, the Czech Republic, Sweden, Ireland and Scotland.{{sfn|Alexander|2011}}{{sfn|NPR|2006}} Albums like the [[crowd-funded]] ''Filthy Dirty South''{{sfn|Rising Appalachia|2011k}} as well as ''Leylines'' reflect the group's evolution both musically and ideologically. These records mark pivotal moments in their artistic maturation. Rising Appalachia's commitment to their craft and their steadfast autonomy continue to define their unique presence in the music scene.",
  "last_revision_date": "2025-08-13T01:22:01Z",
  "genres": [
    52,
    59,
    1277,
    1128
  ]
}