{
  "name": "Rob Zombie",
  "description": "'''Robert Bartleh Cummings''' (born January 12, 1965), known professionally as '''Rob Zombie''', is an American singer, songwriter, record producer, filmmaker, and actor. His music and lyrics are notable for their horror and sci-fi themes, and his live shows have been praised for their elaborate [[shock rock]] theatricality. He has sold an estimated 15 million albums worldwide. He rose to fame as a founding member and the frontman of [[heavy metal music|heavy metal]] band [[White Zombie (band)|White Zombie]], with whom he released five studio albums and one techno remix album.\n\nHis first solo effort, the 1996 song \"[[Hands of Death (Burn Baby Burn)]]\" (with [[Alice Cooper]]), was nominated for a [[Grammy Award for Best Metal Performance]]. His debut solo studio album, ''[[Hellbilly Deluxe]]'', was released in 1998. ''Hellbilly Deluxe'' sold over 3 million copies worldwide and spawned three singles. His second studio album, ''[[The Sinister Urge (album)|The Sinister Urge]]'', was released in 2001 and became his second platinum album in the U.S. His third studio album, ''[[Educated Horses]]'', was released in 2006. It became his third album to enter the top 10 of the [[Billboard 200|''Billboard'' 200]], but saw a decrease in sales compared to his previous releases. His fourth studio album, ''[[Hellbilly Deluxe 2]]'', released in 2010 and peaked at no. 8 in the U.S. A remix album, ''[[Mondo Sex Head]]'', released in 2012 and was followed by his fifth album ''[[Venomous Rat Regeneration Vendor]]'' in 2013. In 2016, Zombie released his sixth album, ''[[The Electric Warlock Acid Witch Satanic Orgy Celebration Dispenser]]'', and his seventh studio album, ''[[The Lunar Injection Kool Aid Eclipse Conspiracy]]'', was released in 2021.\n\nZombie directed the horror film ''[[House of 1000 Corpses]]'' in 2000, though the controversial project was not released until 2003, and has since been described as a cult classic. Zombie followed the film with two sequels in his ''Rejects'' trilogy: ''[[The Devil's Rejects]]'' (2005) and ''[[3 from Hell]]'' (2019). After the success of his first two films he directed ''[[Halloween (2007 film)|Halloween]]'' (2007), a remake of the classic [[Halloween (1978 film)|1978 horror film]]. The film became his highest-grossing to date, though was generally received negatively by critics. He later directed ''[[Halloween II (2009 film)|Halloween II]]'' (2009), which failed to match the commercial success of its predecessor. Zombie has also directed the films ''[[The Haunted World of El Superbeasto]]'' (2009), ''[[The Lords of Salem (film)|The Lords of Salem]]'' (2012), ''[[31 (film)|31]]'' (2016), and [[The Munsters (2022 film)|''The Munsters'']] (2022).",
  "last_revision_date": "2025-08-07T14:08:03Z",
  "genres": [
    533,
    517,
    859,
    1099,
    39,
    591
  ]
}