{
  "name": "Rocket from the Crypt",
  "description": "'''Rocket from the Crypt''' is an American [[punk rock]] band from [[San Diego]], [[California]], originally active from 1990 to 2005, then active during 2011 and again from 2013 to the present.\n\nThe band gained critical praise and the attention of major [[record labels]] after the release of their 1992 album ''[[Circa: Now!]]'', leading to a recording contract with [[Interscope Records]]. They experienced a surge of popularity with the release of the albums ''[[Scream, Dracula, Scream!]]'' (1995) and ''[[RFTC (Rocket from the Crypt album)|RFTC]]'' (1998), accompanied by numerous vinyl singles and [[Extended play|EP]]s released on independent labels. However, album sales did not meet expectations and Interscope soon turned their attention to higher-grossing acts. The band left the label, and shortly thereafter drummer [[Adam Willard|Atom Willard]] departed the group.\n\nAfter a period of inactivity in 1999 and 2000, during which singer/guitarist [[John Reis]] formed [[Hot Snakes]] and [[Sultans (band)|Sultans]] and launched his [[Swami Records]] label, the band signed to [[Vagrant Records]] and recruited new drummer [[Mario Rubalcaba|Ruby Mars]]. They experienced a revitalization of creative energy and released two more albums, but were not as prolific as in the past.\n\nOver the next few years the band members became increasingly involved with other projects and Rocket from the Crypt became less of a focus. They decided to disband in 2005, playing a sold-out farewell show on [[Halloween]] in their hometown of San Diego.\n\nThe band reunited in 2011 for a one-off appearance on the television program ''[[Yo Gabba Gabba!]]'', and in 2013 reformed once more for a series of performances in the US, Europe and Australia.\n\nRocket From the Crypt have had a significant impact on alternative music, being cited as an influence by such bands as [[Jimmy Eat World]], [[the Get Up Kids]], and [[Unbroken (band)|Unbroken]].",
  "last_revision_date": "2025-11-05T09:06:06Z",
  "genres": [
    42,
    486,
    540,
    983,
    994,
    1046
  ]
}