{
  "name": "Rockets",
  "description": "'''Rockets''' is a French [[space rock]] band that formed in [[Paris]] in 1974 and relocated to [[Italy]] in 1978. In their most successful era (1977–1982) the line-up comprised vocalist Christian Le Bartz (1951-2025), bassist and vocalist \"Little\" Gérard L'Her (1952), guitarist and keyboardist Alain Maratrat (1956-2025), drummer and percussionist Alain Groetzinger (1955), and keyboardist Fabrice Quagliotti (1961). Their initial genre was rock, immediately defined by the press as 'space rock' due to the sci-fi veins in the lyrics, the electronic sounds and the stage appearance. Later it was instead associated with 'disco music' and finally 'synth-pop'.\n\nThe Rockets never had any significant success abroad, except in a few countries such as Italy. Mainly responsible for the band's success in Italy was producer Maurizio Cannici, manager of CGD-Messaggerie Musicali, who, in 1978, after seeing them perform in a discotheque in Cannes, succeeded in making them celebrities in that country. In the same year, the group held their first concert in Italy, at the Pesaro Summer Show. Contributing most to their popularity in Italy was the performance they gave a short time later at the Teatro Lirico in Milan.\n\nThe group's vocals were heavily processed to sound like they were from another world. The group used distinctive spatial aesthetics of lamé suits, musical instruments shaped like stars and faces painted in silver. Already during their early concerts, the group made use of eccentric and elaborate choreography, for instance ‘landing’ on stage from small spaceships, using smoke bombs and lasers. The group's daring set designs led to some controversial episodes. During an episode of Discoring in April 1979, during the performance of \"Electric Delight\", singer Christian Le Bartz, fired incendiary firecrackers into the audience with a fake bazooka, inadvertently hitting a girl in the face and burning the audience's clothes (this would later become known). Similarly, during the spring of the same year, the band's choreography led to some injuries in the audience during a performance at a Riccione nightclub.\n\nThe band went through a number of name changes very early in their career and in later years, being known as '''Les Rockets''', '''Rocket Men''' and '''Rok-Etz''', among others. In the year 2000, Fabrice Quagliotti decided to reform the band (initially with the name '''Rockets N.D.P.'''), but with a totally new line-up. This brought to an anomalous situation, as far as none of the former members agreed to hold a reunion. In fact, the last former member to leave the band was Alain Maratrat, in 1992.",
  "last_revision_date": "2025-11-13T01:31:34Z",
  "genres": [
    619,
    1157,
    1192
  ]
}