{
  "name": "Roger Waters",
  "description": "'''George Roger Waters''' (born 6 September 1943) is an English musician and singer-songwriter. In 1965, he co-founded the rock band [[Pink Floyd]] as the bassist. Following the departure of the group's main songwriter [[Syd Barrett]] in 1968, Waters became Pink Floyd's lyricist, co-lead vocalist and conceptual leader until his departure in 1985.\n\nPink Floyd achieved international success with the concept albums ''[[The Dark Side of the Moon]]'' (1973), ''[[Wish You Were Here (Pink Floyd album)|Wish You Were Here]]'' (1975), ''[[Animals (Pink Floyd album)|Animals]]'' (1977), ''[[The Wall]]'' (1979), and ''[[The Final Cut (album)|The Final Cut]]'' (1983). By the early 1980s, they had become one of the most acclaimed and commercially successful groups in popular music. Amid creative differences, Waters left in 1985 and began a legal dispute over the use of the band's name and material. They settled out of court in 1987. Waters's solo work includes the studio albums ''[[The Pros and Cons of Hitch Hiking]]'' (1984), ''[[Radio K.A.O.S.]]'' (1987), ''[[Amused to Death]]'' (1992), and ''[[Is This the Life We Really Want?]]'' (2017). In 2005, he released ''{{lang|fr|[[Ça Ira (opera)|Ça Ira]]}}'', an opera translated from [[Étienne Roda-Gil|Étienne]] and Nadine Roda-Gils's [[libretto]] about the [[French Revolution]].\n\nIn 1990, Waters staged one of the largest rock concerts in history, ''[[The Wall&nbsp;– Live in Berlin]]'', with an attendance of 450,000. As a member of Pink Floyd, he was inducted into the US [[Rock and Roll Hall of Fame]] in 1996 and the [[UK Music Hall of Fame]] in 2005. Later in 2005, he reunited with Pink Floyd for the [[Live 8]] global awareness event, their only appearance with Waters since 1981. He has toured extensively as a solo act since 1999. He performed ''The Dark Side of the Moon'' for his [[The Dark Side of the Moon Live|world tour of 2006–2008]], and [[The Wall Live (2010–13)|The Wall Live]], his tour of 2010–2013, was the [[List of highest-grossing concert tours|highest-grossing tour by a solo artist at the time]].\n\nWaters incorporates political themes in his work and is a prominent [[Pro-Palestine|supporter of Palestine]] in the [[Israeli–Palestinian conflict]]. He supports the [[Boycott, Divestment and Sanctions|Boycott, Divestment and Sanctions (BDS)]] movement against Israel, and describes Israel's treatment of Palestinians [[Israel and apartheid|as apartheid]]. Elements of his live show and some of his comments, such as his likening of Israel to [[Nazi Germany]], have drawn accusations of [[antisemitism]], which Waters has dismissed as a conflation with [[anti-Zionism]].",
  "last_revision_date": "2025-06-10T03:36:19Z",
  "genres": [
    946,
    139,
    65,
    956
  ]
}