{
  "page_title": "Rogue Male (band)",
  "description": "'''Rogue Male''' are a British [[Heavy metal music|heavy metal]] band, formed in 1984.\n\nRogue Male was the brainchild of [[Northern Ireland]]-born singer and guitarist Jim Lyttle, who had previously been in the [[Northern Irish]] punk rock band Pretty Boy Floyd and The Gems. Moving to [[London]] in the late 1970s, he decided to put together a band that would mix punk rock styles and aggression, with the more heavy metal sounds of the [[new wave of British heavy metal|NWOBHM]] bands of the time. The band signed to the UK heavy metal label [[Music for Nations]] and subsequently [[Elektra Records|Elektra]] in the US., Shortly afterwards, the band were invited to appear on the ''E.C.T. (Extra Celestial Transmission)'' Heavy Metal music programme on England's [[Channel 4]] where they performed two songs live on 19 April 1985.\n\nThe first Rogue Male album, ''First Visit'', was written and arranged by Jim Lyttle, recorded by Jim Lyttle on guitar and vocals, John Fraser-Binnie on [[ guitar]], Phil Clark on bass, later replaced by Kevin Collier Bass, and Steve Kingsley on drums., Kingsley was later replaced by [[Danny Fury]]., The album was produced by Steve James. Rogue Male toured the UK, Europe and the US in support of it. ''[[Kerrang!]]'' magazine in the UK gave the band several features, and a front cover article, they also got featured in several main rock mags throughout europe and Japan and were awarded Top International New Artist by number one French mag Enfer. \"All Over You\" was released as a 12-inch single. Their second album also written and arranged by Jim Lyttle ''Animal Man'', was released a year later. Rogue Male subsequently dropped their record companies and started legal proceedings for infringement and conflict of interest against them and their manager Martin Hooker (MFN). The 1980s incarnation of the band played their final show in late 1987. After a 6 year long protracted legal battle, Jim Lyttle won the copyright to all Rogue Male material, including the trading name Rogue Male.{{cn|date=December 2023}} \n\nBoth the original albums were re-released on the Polish label Metal Mind records in 2007. In an interview in the March 2009 edition of ''[[Classic Rock Magazine]]'', Lyttle stated that he had recently written, arranged, recorded and produced a new Rogue Male album. Released in 2010, this album guested [[Bernie Tormé]] on guitar on some tracks, with John McCoy on bass and Robin Guy on drums providing the rhythm section and was called ''Nail It''.  A new track, \"Cold Blooded Man\", appeared on the CD which accompanied the magazine. Original guitarist John Fraser Binnie subsequently rejoined the band and a new DVD entitled ''Liar'' was recorded and released. The album HARDCASE was released in 2023 on their own RM2K music label featuring all the original members, including Danny Fury and also session drummer Greg Brown (drums), recorded at Alvic Studio London and Rockfield Studio Wales. The first 4 tracks recorded at Alvic were produced by Steve James, and the rest at Rockfield were produced by Jim Lyttle.",
  "last_revision_date": "2025-05-26T00:49:06Z"
}