{
  "name": "Romanovsky & Phillips",
  "description": "'''Romanovsky & Phillips''' is a [[gay]] singing duo named after its members, '''Ron Romanovsky''' and '''Paul Phillips'''. They are best known for their original recordings and live performances featuring songs combining humor with poignant observations about the lives of gay men (and to a lesser extent, lesbian women) in contemporary American society.\n\n\nRomanovsky & Phillips began their career at [[San Francisco]]'s Valencia Rose Cafe, in 1982, as the musical break for Gay Comedy Open Mike Night. They mounted their first national tour in the fall of 1983. They toured extensively in the [[United States]], [[Canada]] and [[Australia]]. Over the years the duo released seven albums under the \"Fresh Fruit\" label. ''Sydney Daily Mirror'' described them as \"delightful and entertaining Ambassadors of Homosexuality.\" Originally a romantic couple, the two ended that aspect of their relationship in the early 1990s, but continued to record and perform together, describing themselves as \"a gay [[Sonny and Cher]]\" (who had also briefly continued their professional collaboration following their divorce).  In 1998 they presented their full-length musical, ''Jayson'', at the 45th Street theatre in New York, in collaboration with book writer and producer [[Jeff Krell]]. A year later the duo decided to take some time off the road.  While Phillips put music on hold to pursue other interests, Romanovsky took up a new instrument: the accordion.  In 2002 he released a solo album in French, ''Je m'appelle Dadou''.\n\nIn 2004, Ron was commissioned to write a \"circus opera\" for Nurses for the Rights of the Child, a group of labor and delivery nurses who are conscientious objectors to male circumcision.  After two years of writing and several workshop performances, ''It's A Boy!'' was premiered in August, 2006 at the 9th International Symposium on Circumcision, Genital Integrity and Human Rights at the University of Washington in Seattle.  The opera featured  music written for accordion, violin and five vocalists. A recording was released concurrently.\n\nImmediately following up ''It's A Boy!'' came the release of ''Pittsburgh to Paris'', marking Ron's return to song writing.\n\nIn December 2006, Fresh Fruit Records re-released all of R&P's recordings. In 2007, Ron returned to the concert stage, this time fronting a four-piece band and performing his newest material along with several updated R&P chestnuts.  The year culminated in a sold-out show in Taos, New Mexico, where Ron shared the bill with comic Vicki Shaw.  His newest recording, ''Turn Up the Fun!'', released in January 2008, is a return to his queer music roots, offering 14 original tracks featuring the characteristic satire, off-beat observations and poignancy that fans have come to expect.\n\nCurrently, Romanovsky performs frequently in and around his adopted hometown of Santa Fe with his quartet, \"Welcome to Bohemia\", in addition to performing with pianist/vocalist Charles Tichenor in their annual musical tribute to France, \"April in Paris\".\n\nIn February 2010, Ron made his first music video \"The Sanctity of Marriage\" which can be seen on YouTube [https://www.youtube.com/watch?v=IYnT-Ef6U1A].",
  "last_revision_date": "2025-10-28T08:39:10Z",
  "genres": [
    270,
    682
  ]
}