{
  "name": "Rosanne Cash",
  "description": "'''Rosanne Cash''' (born May 24, 1955) is an American singer-songwriter and author. She is the eldest daughter of [[country music]]ian [[Johnny Cash]] and his first wife, [[Vivian Cash]].\n\nAlthough Cash is often classified as a country artist, her music draws from many genres, including [[Folk music|folk]], [[Pop music|pop]], [[Rock music|rock]], [[Blues music|blues]], and in particular, [[Americana (music)|Americana]]. In the 1980s, she had a string of genre-crossing singles that entered both the country and pop charts, the most commercially successful being her 1981 breakthrough hit \"[[Seven Year Ache (song)|Seven Year Ache]]\". It topped the U.S. country singles chart, and reached the Top 30 on the U.S. pop chart.\n\nIn 1990, Cash released ''[[Interiors (Rosanne Cash album)|Interiors]]'', a spare, introspective album that signaled a break from her pop-country past. The following year she ended her marriage to songwriter [[Rodney Crowell]].\n\nShe moved from [[Nashville]] to New York City. She has continued to write, record, and perform, having since released six albums, written three books, and edited a collection of short stories. Her fiction and essays have been published in ''[[The New York Times]]'', ''[[Rolling Stone]]'', the ''[[Oxford American]]'', ''[[New York Magazine]]'', and other periodicals and collections.\n\nCash won a [[Grammy Award]] in 1985 for \"[[I Don't Know Why You Don't Want Me]]\" and has received 12 other Grammy nominations. She has had 11 No.&nbsp;1 country hit singles, 21 Top 40 country singles, and two [[Music recording sales certification|gold record]]s. Cash was the 2014 recipient of ''[[Smithsonian (magazine)|Smithsonian]]'' magazine's American Ingenuity Award, in the Performing Arts category.\n\nOn February 8, 2015, Cash won three Grammy awards: for Best Americana Album for ''The River & the Thread''; Best American Roots Song, with John Leventhal; and Best American Roots Performance for her album ''A Feather's Not A Bird''. Cash was honored further in October that year, when she was inducted into the [[Nashville Songwriters Hall of Fame]].",
  "last_revision_date": "2025-09-11T04:56:58Z",
  "genres": [
    52,
    278,
    289,
    290
  ]
}