{
  "description": "'''Roxy Music''' are an English [[rock music|rock]] band formed in 1970 by [[Bryan Ferry]] (lead vocals/keyboards/principal songwriter) and [[Graham Simpson (musician)|Graham Simpson]] (bass). By the time the band recorded their [[Roxy Music (album)|first album]] in 1972, Ferry and Simpson were joined by [[Andy Mackay]] (saxophone/oboe), [[Phil Manzanera]] (guitar), [[Paul Thompson (musician)|Paul Thompson]] (drums) and [[Brian Eno]] (synthesizer). Other members during the band's history include [[Eddie Jobson]] (synthesizer/keyboards/violin) and [[John Gustafson (musician)|John Gustafson]] (bass).\n\nBeginning with their first album, Roxy Music became a successful act in Europe and Australia during the 1970s. The band pioneered more musically sophisticated elements of [[glam rock]], significantly influencing early English [[punk rock|punk]] music, and provided a model for many [[New wave music|new wave]] acts while innovating elements of [[electronic music|electronic]] composition. The group also conveyed their distinctive brand of visual and musical sophistication with their focus on glamorous fashions.\n\nRoxy Music split in 1976, reformed in 1978, and split again in 1983. Their final studio album was ''[[Avalon (Roxy Music album)|Avalon]]'' (1982), which was certified [[Music recording certification|Platinum]] in the United States, where the band had spent their first ten years as a moderately successful cult band. In 2001, Ferry, Mackay, Manzanera and Thompson reunited for a concert tour and have toured together intermittently ever since, most recently in 2022 to celebrate the 50th anniversary of their first album.\n\nOutside of the band, Ferry and Eno have had influential solo careers. Ferry has frequently enlisted Roxy Music members as backing musicians during his solo career, and Eno became one of the most significant British record producers of the late 20th century. In 2019, Roxy Music were inducted into the [[Rock and Roll Hall of Fame]].",
  "last_revision_date": "2025-06-11T16:58:21Z"
}