{
  "name": "Sade",
  "description": "'''Sade''' ({{IPAc-en|ˈ|ʃ|ɑː|d|eɪ}} {{respell|SHAH|day}} or {{IPAc-en|ʃ|ɑː|ˈ|d|eɪ}} {{respell|shah|DAY}}) are an English band, formed in London in 1982 and named after their lead singer, [[Sade (singer)|Sade Adu]]. The band consists of Sade (vocals), [[Paul Denman]] (bass), [[Stuart Matthewman]] (saxophones, guitars) and Andrew Hale (keyboards, piano); the band does not have a drummer, but employs session musicians for recordings and live shows. Sade's musical style spans genres such as [[Soul music|soul]], [[quiet storm]], [[smooth jazz]] and [[sophisti-pop]].\n\nSade's debut studio album, ''[[Diamond Life]]'' (1984), topped the charts of several countries, sold over four million copies worldwide, won the [[Brit Award]] for Best British Album. The band's second studio effort, ''[[Promise (Sade album)|Promise]]'' (1985), was certified [[British Phonographic Industry|double platinum]] in the UK, and [[RIAA|quadruple platinum]] in the US, peaking at number one in both territories; it also won the band their first [[Grammy Awards|Grammy Award]]. Their following two albums, ''[[Stronger Than Pride]]'' (1988) and ''[[Love Deluxe]]'' (1992), drew further success and [[List of awards and nominations received by Sade|awards]]. \n\nAfter ''Love Deluxe'', Sade went on a hiatus. They returned with their fifth studio album, ''[[Lovers Rock (Sade album)|Lovers Rock]]'' (2000), which won the [[Grammy Award for Best Pop Vocal Album]]. Their sixth studio album, ''[[Soldier of Love (album)|Soldier of Love]]'' (2010), became their first number one debut in the US since ''Promise''; it won the band its fourth Grammy for [[Grammy Award for Best R&B Performance by a Duo or Group with Vocals|Best R&B Performance by a Duo or Group with Vocals]].\n\nAll of Sade's albums, including compilations and a live album, have charted in the US Top Ten. As of 2012, their sales in the US stood at 23 million units, and by 2014, their sales worldwide stood at 75 million. The band was ranked at number 50 on [[VH1]]'s list of the \"100 Greatest Artists of All Time\" and nominated for the [[Rock and Roll Hall of Fame]] in 2024.",
  "last_revision_date": "2026-01-07T16:41:36Z",
  "genres": [
    281,
    987,
    1142,
    1152,
    1156
  ]
}