{
  "description": "'''Sam & Dave''' were an American soul and R&B duo who performed together from 1961 until 1981. The tenor (higher) voice was [[Sam Moore]] (1935–2025) and the baritone/tenor (lower) voice was [[Dave Prater]] (1937–1988).\n\nNicknamed \"Double Dynamite\", \"The Sultans of Sweat\", and \"The Dynamic Duo\" for their gritty, gospel-infused performances, Sam & Dave are considered one of the greatest live acts of the 1960s. Many subsequent musicians have named them as an influence, including [[Bruce Springsteen]], [[Al Green]], [[Tom Petty]], [[Phil Collins]], [[Michael Jackson]], [[Steve Van Zandt]], [[Elvis Costello]], [[The Jam]], [[Teddy Pendergrass]], [[Billy Joel]], and [[Steve Winwood]]. [[The Blues Brothers]], who helped create a resurgence of popularity for [[soul music|soul]], [[rhythm and blues|R&B]], and [[blues music|blues]] in the 1980s, were influenced by Sam & Dave – their biggest hit was a cover of \"[[Soul Man (song)|Soul Man]]\", and their act and stage show contained many homages to the duo.\n\nAccording to the Rock & Roll Hall of Fame, Sam & Dave were the most successful soul duo and brought the sounds of the black gospel church to pop music with their call-and-response records. Recorded primarily at [[Stax Records]] in Memphis, Tennessee, from 1965 through 1968, these included \"Soul Man\", \"[[Hold On, I'm Comin' (song)|Hold On, I'm Comin']]\", \"You Don't Know Like I Know\", \"[[I Thank You (song)|I Thank You]]\", \"[[When Something Is Wrong with My Baby]]\", \"Wrap It Up\", and many other Southern Soul classics. Except for [[Aretha Franklin]], no soul act during Sam & Dave's Stax years (1965–1968) had more consistent R&B chart success, including 10 consecutive top-20 singles and three consecutive top-10 LPs. Their crossover charts appeal (13 straight appearances and two top-10 singles) helped to pave the way for the acceptance of soul music by white pop audiences, and their song \"Soul Man\" was one of the first songs by a black group to top the pop charts using the word \"soul\", helping define the genre. \"Soul Man\" was a number-one Pop Hit (''Cashbox'': November 11, 1967) and has been recognized as one of the most influential songs of the past 50 years by the [[Grammy Hall of Fame]], the Rock & Roll Hall of Fame, ''[[Rolling Stone]]'' magazine, and [[RIAA]] Songs of the Century. \"Soul Man\" was featured as the soundtrack and title for a 1986 film and also a 1997–1998 television series, and ''[[Soul Men]]'' was a 2008 feature film.\n\nSam & Dave are inductees in the [[Rock and Roll Hall of Fame]], the [[Vocal Group Hall of Fame]], the [[Memphis Music Hall of Fame]], and the [[Rhythm and Blues Music Hall of Fame|Rhythm & Blues Music Hall of Fame]]. They won a [[Grammy Award]] for \"Soul Man\" and they received the [[Grammy Lifetime Achievement Award]] in 2019. ''Rolling Stone'' ranked Sam & Dave No. 14 on its list of the 20 Greatest Duos of All Time.",
  "last_revision_date": "2025-04-13T05:48:44Z"
}