{
  "name": "Samantha Fox",
  "description": "'''Samantha Karen Fox''' (born 15 April 1966) is an English pop singer and former [[glamour model]] from [[Crouch End]] in [[North London]]. She has appeared on [[reality television]] shows and has occasionally worked as a television presenter and actress.\n\nFox began her glamour modelling career at age 16. After she placed second in a ''[[Sunday People]]'' amateur modelling contest, ''[[The Sun (United Kingdom)|The Sun]]'' recruited her to pose for [[Page 3]], where she made her first appearance in February 1983. Named ''The Sun''<nowiki/>'s \"Page 3 Girl of the Year\" for 1984, 1985 and 1986, she became one of the most photographed British women of the 1980s and a notable [[sex symbol]] of the era. She left Page 3 in 1986, aged 20, to focus on pop music, but made occasional glamour modelling appearances thereafter, notably featuring in a 1996 ''[[Playboy]]'' pictorial. In 2008, she was voted the top Page 3 model of all time.\n\nReleased in March 1986, Fox's debut single for the [[Jive Records]] label, \"[[Touch Me (I Want Your Body)]]\", became a top-10 hit across Europe, North America and Australia, reaching number one in several countries. Her first three studio albums—''[[Touch Me (Samantha Fox album)|Touch Me]]'' (1986), ''[[Samantha Fox (album)|Samantha Fox]]'' (1987) and ''[[I Wanna Have Some Fun]]'' (1988)—all produced international hit singles and she was nominated in the British Female Solo Artist category at the [[Brit Awards 1988]]. Her subsequent albums—[[Just One Night (Samantha Fox album)|''Just One Night'']] (1991), [[21st Century Fox (album)|''21st Century Fox'']] (1997) and ''[[Angel with an Attitude]]'' (2005)—were less successful, but she has continued to tour and has announced a forthcoming seventh studio album, produced by [[Ian Masterson]].\n\nIn her early career, Fox dated men including [[Peter Foster]], the Australian fraudster, and [[Paul Stanley]], the rhythm guitarist and lead vocalist of rock band [[Kiss (band)|Kiss]]. Following persistent rumours in the 1990s about her sexual orientation, she [[came out]] as a lesbian in 2003. She was in a long-term relationship with her former manager Myra Stratton from 2003 until Stratton died from cancer in 2015. In 2022, she married her tour manager, Linda Birgitte Olsen.",
  "last_revision_date": "2025-06-06T08:55:47Z"
}