{
  "name": "Samhain",
  "description": "'''Samhain''' was an American [[Rock music|rock]] band formed by singer [[Glenn Danzig]] in 1983, immediately following his departure from [[The Misfits (band)|The Misfits]]. Glenn Danzig originally planned Samhain as a side project with [[Eerie Von]]. After the Misfits' contentious 1983 dissolution, Samhain became Danzig's full-time band.\n\nSamhain catalogs a transitional period in Glenn Danzig's musical career, bridging the gap between the [[punk rock]]/[[horror punk]] of the Misfits and the dark, [[heavy metal (music)|heavy metal]]- and [[blues]]-influenced sound of [[Danzig (band)|Danzig]]. Samhain's lyrics were much darker than those of the Misfits, with themes rooted in [[paganism]] and the [[occult]] and eventually the horrors of reality, as opposed to the sometimes cartoonish ghouls and ghosts of the Misfits.\n\nBoth Samhain and its successor, Danzig, use the same horned skull image originally drawn by artist [[Michael Golden (comics)|Michael Golden]] for the cover of the 1984 comic book ''[[The Saga of Crystar]]'' No.&nbsp;8, published by [[Marvel Comics]]. The font often used in the wordmarks of Samhain, and later Danzig, is taken from the film ''[[The Giant Gila Monster]]''. Danzig took the name of the band from the Irish month of November and pre-Christian, Celtic festival [[Samhain]], the origin of the modern [[Halloween]]. Despite the festival being pronounced \"sau-win\", the band's name is often pronounced as \"sam-hane\". Glenn Danzig has said that both pronunciations are correct.\n\nSamhain released two full-length albums and one [[Extended play|EP]] during their three-year career as an active band. Danzig has said that he wrote two songs (\"Death Comes Ripping\" and \"Bloodfeast\") with the intention of using them on the first Samhain album, but instead recorded them with the Misfits for the ''[[Earth A.D./Wolfs Blood]]'' album in order to round out that band's final series of recordings and release a full album.",
  "last_revision_date": "2025-05-14T12:35:06Z"
}