{
  "name": "Sammi Cheng",
  "description": "'''Sammi Cheng Sau-man''' ({{lang-zh|t=鄭秀文|p=Zhèng Xiùwén}}; born 19 August 1972) is a Hong Kong singer and actress. She is one of the most prominent female singers in Hong Kong, with album sales of over 25 million copies throughout the Asia-pacific. Most notably in the 1990s, she was dubbed by the media as the \"Cantopop Diva\". Having success in entertainment industry for over three decades, Cheng also played roles in Hong Kong rom-com films in the early 2000s that were box office hits. For her performance in the 2022 film ''Lost Love'', she won 4 best actress honors including the [[Hong Kong Film Award for Best Actress]].\n\nSince her debut, Cheng has won the IFPI Hong Kong Music Top Sales Awards for the best-selling Local Female Vocalist of the Year nine times. From 1993 to 2010, Cheng won a total of 12 Top Female Vocalist awards, 14 Best-selling Local Female Vocalist Awards and has 7 albums that are the Best-selling Cantonese Release of the Year. She had also previously won the Most Popular Hong Kong Female Artist Award in annual Top Ten Jade Solid Gold Awards Presentation for three times, and in a year winning also the Gold Song Gold Award, the highest-ranked award which is the last to be presented at the ceremony. She also received Honorary Lifetime Achievement Award for Female Singer in 2011 Metro Radio Hits Awards. She had also won many top honors in various Chinese music awards held in Asia, including the [[MTV Asia Award for Favorite Artist Hong Kong]] 3 times, in 2002, 2003 and 2004.\n\nShe has produced over 80 studio albums, 10 live concert albums, over 130 songs with also over 30 cover songs and had received numerous awards from acting to singing. She also starred in close to 40 films and 7 television dramas and had held approximately 200 concerts up to date with over 11 concert tours. She is one of the female artists with most concert shows in [[Hong Kong Coliseum]], at 115.",
  "last_revision_date": "2025-11-19T07:33:10Z",
  "genres": [
    205,
    729
  ]
}