{
  "description": "'''Samuel George Davis Jr.''' (December 8, 1925&nbsp;– May 16, 1990) was an American singer, actor, comedian, dancer, and musician.\n\nAt age two, Davis began his career in [[Vaudeville]] with his father [[Sammy Davis Sr.]] and the [[Will Mastin Trio]], which toured nationally, and his film career began in 1933. After military service, Davis returned to the trio and became a sensation following key nightclub performances at [[Ciro's]] (in [[West Hollywood]]) in 1951, including one after the [[23rd Academy Awards|Academy Awards ceremony]]. With the trio, he became a recording artist. In 1954, at the age of 29, he lost his left eye in a car accident. Several years later, he [[converted to Judaism]], finding commonalities between the oppression experienced both by black Americans and Jewish communities. In 1958, he faced a backlash for his involvement with a white woman at a time when interracial relationships were taboo in the U.S. and when [[interracial marriage]] was not legalized nationwide until 1967.\n\nDavis had a starring role on [[Broadway theatre|Broadway]] in ''[[Mr. Wonderful (musical)|Mr. Wonderful]]'' with [[Chita Rivera]] (1956). In 1960, he appeared in the [[Rat Pack]] film ''[[Ocean's 11]]''. He returned to the stage in 1964 in a musical adaptation of [[Clifford Odets]]'s ''[[Golden Boy (musical)|Golden Boy]]''. Davis was nominated for a [[Tony Award]] for his performance. The show featured the first interracial kiss on Broadway. In 1966, he had his own TV variety show, titled ''The Sammy Davis Jr. Show''. While Davis's career slowed in the late 1960s, his biggest hit, \"[[The Candy Man]]\", reached the top of the [[Billboard Hot 100|''Billboard'' Hot 100]] in June 1972, and he became a star in Las Vegas, earning him the nickname \"Mister Show Business\". Davis's popularity helped break the race barrier of the [[Racial segregation in the United States|segregated]] entertainment industry. One day on a golf course with [[Jack Benny]], he was asked what his [[Handicap (golf)|handicap]] was. \"Handicap?\" he asked. \"Talk about handicap. I'm a one-eyed [[Negro]] who's Jewish.\" This was to become a signature comment.\n\nAfter reuniting with [[Frank Sinatra]] and [[Dean Martin]] in 1987, Davis toured with them and [[Liza Minnelli]] internationally, before his death in 1990. He died in debt to the [[Internal Revenue Service]], and his estate was the subject of legal battles after the death of his wife. His final album was a Country Music Album, a departure from his usual musical style. Davis was awarded the [[Spingarn Medal]] by the [[NAACP]] and was nominated for a [[Golden Globe Award]] and an [[Emmy Award]] for his television performances. He was a recipient of the [[Kennedy Center Honors]] in 1987, and in 2001, he was posthumously awarded the [[Grammy Lifetime Achievement Award]]. In 2017, Davis was inducted into the [[National Rhythm & Blues Hall of Fame]].",
  "last_revision_date": "2025-06-17T05:31:44Z"
}