{
  "name": "Sarah Brightman",
  "description": "'''Sarah Brightman''' (born 14 August 1960) is an English [[classical crossover]] [[soprano]] singer and actress.\n\nBrightman began her career as a member of the dance troupe [[Hot Gossip]] and released several disco singles as a solo performer. In 1981, she made her [[West End theatre|West End]] musical theatre debut in ''[[Cats (musical)|Cats]]'' and met composer [[Andrew Lloyd Webber]], whom she later married. She went on to star in several West End and [[Broadway theatre|Broadway]] musicals, including ''[[The Phantom of the Opera (1986 musical)|The Phantom of the Opera]]'', where she originated the role of [[Christine Daaé]]. Her original London cast album of ''Phantom'' was released in CD format in 1987 and sold 40 million copies worldwide, making it the biggest-selling cast album ever.\n\nAfter retiring from stage acting and divorcing Lloyd Webber, Brightman resumed her music career with former [[Enigma (German band)|Enigma]] producer [[Frank Peterson]], this time as a classical [[crossover (music)|crossover]] artist. She has been credited as the creator and remains among the most prominent performers of this genre, with worldwide sales of more than 25 million albums and two million DVDs, establishing herself as the world's best-selling [[soprano]].\n\nBrightman's 1996 duet with the Italian tenor [[Andrea Bocelli]], \"[[Con te partirò|Time to Say Goodbye]]\", topped the charts all over Europe and became the highest and fastest-selling single of all time in Germany, where it stayed at the top of the charts for 14 consecutive weeks and sold over three million copies. It subsequently became an international success, selling 12 million copies worldwide, making it one of the [[List of best-selling singles|best-selling singles of all-time]]. She has collected over 200 gold and platinum record awards in 38 countries. In 2010, she was named by ''[[Billboard (magazine)|Billboard]]'' the fifth most influential and best-selling classical artist of the 2000s decade in the US and according to [[Nielsen SoundScan]], she has sold 6.5&nbsp;million albums in the country.\n\nBrightman is the first artist to have been invited twice to perform the theme song at the [[Olympic Games]], first at the 1992 [[Barcelona Olympic Games]] where she sang \"[[Amigos Para Siempre]]\" with the Spanish tenor [[José Carreras]] with an estimated global audience of one billion people, and 16 years later in 2008 in [[2008 Summer Olympics|Beijing]], this time with Chinese singer [[Liu Huan]], performing the song \"[[You and Me (Olympic theme song)|You and Me]]\" to an estimated four billion people worldwide.\n\nIn 2012, Brightman was appointed as the [[UNESCO Artist for Peace]] for the period 2012–2014, for her \"commitment to humanitarian and charitable causes, her contribution, throughout her artistic career, to the promotion of cultural dialogue and the exchanges among cultures, and her dedication to the ideals and aims of the Organization\". Since 2010, Brightman has been [[Panasonic]]'s global brand ambassador.",
  "last_revision_date": "2026-01-11T04:46:21Z",
  "genres": [
    898,
    1311
  ]
}