{
  "name": "Seedhe Maut",
  "description": "'''Seedhe Maut''' is a hip hop duo from [[Delhi]], India, consisting of '''Siddhant Sharma''' (stage name '''Calm''') from Nainital and '''Abhijay Negi''' (stage name '''Encore ABJ'''), who met at Spit Dope Inc., a Delhi underground battle rap league organized by MC Kode and the latter. In 2017, they signed to the independent music label Azadi Records. After releasing their final project ''Lunch Break'' with Azadi Records in 2023, they departed from the label and found their own independent label, [https://dl91era.com/ DL91], in 2024.\n\nCalm, who previously rapped in English, switched his language to Hindi, when they collaborated with [[Prabh Deep]] on the track ''Class Sikh Maut Vol.2'', which was a sequel to the track ''Classsikh Maut'', featured on ''2 Ka Pahada'', their debut project. Since then, the duo has released two studio albums—''Bayaan'' in 2018 and ''Nayaab'' in 2022—and 2 mixtapes—''न'' in 2021, and ''Lunch Break'' in 2023, followed by the EPs ''Shakti'' and ''Kshama'' in 2024, as well as a plethora of singles and collaborations, with many tracks produced by Calm and longtime collaborator and producer Sez on the Beat. They released their first compilation album, ''DL91 FM,'' through their newly founded label, DL91 Era, in 2025, featuring appearances from various DL91 artists, namely, Lil Bhavi, Ab-17, OG Lucifer, GhAatak, Bhaskar as well as the comedian [[Samay Raina]] and also announced their [https://discord.gg/aFMQ3uUkqX DL91 Discord Server] which is managed by shvm.Their first album to not feature production from Sez on the Beat, all the tracks were instead produced by the label's signee, Hurricane. The rap duo has made songs on romance, politics, Indian society and the education system, and their lifestyle.\n\nThe duo was selected for the [[YouTube]] 2021 Class of Foundry. In 2023, Seedhe Maut appeared on [[Coke Studio (Indian TV program)|Coke Studio Bharat]] with ''Holi Re Rasiya''. The two were also seen as guest judges on the show, [[India's Got Latent|''India's Got Latent'']].",
  "last_revision_date": "2025-06-18T11:55:13Z",
  "genres": [
    547,
    341
  ]
}