{
  "name": "Serge Gainsbourg",
  "description": "'''Serge Gainsbourg''' ({{IPA|fr|sɛʁʒ(ə) ɡɛ̃zbuʁ|lang|Sergegainsbourg.ogg}}; born '''Lucien Ginsburg''';{{efn|[[Ginsburg]] is sometimes spelled Ginzburg in the media, including print encyclopaedias and dictionaries. Ginsburg is however the spelling on [[:File:Serge Gainsbourg Grave.jpg|Gainsbourg's grave]]; Lucien Ginsburg is the name by which Gainsbourg is referred to, as a performer, in the [[SACEM]] catalogue [http://www.sacem.fr/catel/] (along with ''Serge Gainsbourg'' as the author/composer/adaptor)}} 2 April 1928&nbsp;– 2 March 1991) was a French singer-songwriter, actor, composer, and director. Regarded as one of the most important figures in [[French pop]], he was renowned for often provocative releases which caused uproar in France, dividing public opinion. His artistic output ranged from his early work in [[jazz]], [[chanson]], and [[yé-yé]] to later efforts in [[rock music|rock]], [[zouk]], [[funk]], [[reggae]], and [[electronica]]. Gainsbourg's varied musical style and individuality make him difficult to categorise, although his legacy has been firmly established and he is often regarded as one of the world's most influential popular musicians.\n\nGainsbourg wrote over 550 songs, which have been covered more than 1,000 times by diverse artists. His lyrical works incorporated [[Word play|wordplay]], with humorous, bizarre, provocative, sexual, satirical or subversive overtones. Since his death from a second [[Myocardial infarction|heart attack]] in 1991, Gainsbourg's music has reached legendary stature in France. While controversial in his lifetime, he has become one of France's best-loved public figures. He has also gained a cult following across the world with chart success in the United Kingdom and Belgium with \"[[Je t'aime... moi non plus]]\" and \"[[Bonnie and Clyde (Serge Gainsbourg and Brigitte Bardot song)|Bonnie and Clyde]]\", respectively.",
  "last_revision_date": "2026-01-24T22:38:50Z",
  "genres": [
    462,
    637,
    1062
  ]
}