{
  "name": "Sex Pistols",
  "description": "The '''Sex Pistols''' are an English [[punk rock]] band formed in London in 1975. Although their initial career lasted just two and a half years, they became culturally influential in popular music. The band initiated the [[punk movement]] in the United Kingdom, with their clothes and hairstyles becoming a significant influence on the [[punk subculture]] and [[punk fashion|fashion]]. On 4 June and 20 July 1976, their [[Sex Pistols at the Lesser Free Trade Hall|performances]] at Manchester's [[Lesser Free Trade Hall]] inspired future members of bands such as [[Joy Division]], [[New Order (band)|New Order]], [[the Smiths]], [[The Fall (band)|the Fall]], [[Simply Red]], [[Magazine (band)|Magazine]] and [[Buzzcocks]] to pursue music, as well as [[Martin Hannett]], [[Tony Wilson]] and [[Alan McGee]], the founders of [[Factory Records|Factory]] and [[Creation Records]], who later contributed to the development of England's [[independent music]] scene, and several [[post-punk]], [[Indie rock|indie]], and [[alternative rock]] artists.\n\nThe Sex Pistols' first line-up consisted of vocalist [[Johnny Rotten]] (byname of John Lydon), guitarist [[Steve Jones (musician)|Steve Jones]], drummer [[Paul Cook]], and bassist [[Glen Matlock]], with Matlock replaced by [[Sid Vicious]] in early 1977. Under the management of [[Malcolm McLaren]], the band gained widespread attention from British press after swearing live on-air during a December 1976 television interview. Their May 1977 single \"[[God Save the Queen (Sex Pistols song)|God Save the Queen]]\", which described the monarchy as a \"fascist regime\", was released to coincide with national celebrations for the [[Elizabeth II|Queen's]] [[Silver Jubilee of Elizabeth II|Silver Jubilee]]. The song was promptly banned from being played by the [[BBC]] and by nearly every independent radio station in Britain, making it the most censored record in British history.\n\nTheir sole studio album ''[[Never Mind the Bollocks, Here's the Sex Pistols]]'' (1977) was a UK number one and is regarded as seminal in the development of punk rock. In January 1978, at the final gig of a difficult and media-hyped tour of the US, Rotten announced the band's break-up live on stage. Over the next few months, the three remaining members recorded songs for McLaren's film of the Sex Pistols' story, ''[[The Great Rock 'n' Roll Swindle]]''. Vicious died of a [[heroin overdose]] in February 1979 following his arrest for the alleged murder of his girlfriend, [[Nancy Spungen]]. Rotten, Jones, Cook and Matlock later reunited for a successful tour in 1996.{{sfn|Pingitore|2023}} Further one-off performances and short tours followed over the next decade. In 2024, Jones, Cook, Matlock, and guest vocalist [[Frank Carter (musician)|Frank Carter]], reformed the Sex Pistols to play a series of shows that year, with further dates scheduled for 2025.\n\nThe Sex Pistols have been recognised as a highly influential band.{{sfn|Sheldon|Skinner|2006|pp=29–33}} In 2006, they were inducted into the [[Rock and Roll Hall of Fame]] although they refused to attend the ceremony, with Rotten referring to the museum as \"a piss stain\".{{sfn|Sprague|2006}}",
  "last_revision_date": "2026-01-31T19:10:33Z",
  "genres": [
    1009
  ]
}