{
  "name": "Shane MacGowan",
  "description": "'''Shane Patrick Lysaght MacGowan''' (25 December 1957{{snd}}30 November 2023) was a British-born Irish{{efn|name=nationality}} singer-songwriter and musician, best known as the lead vocalist and primary lyricist of [[Celtic punk]] band [[the Pogues]]. He won acclaim for his lyrics, which often focused on the [[Irish emigrant]] experience; he also received widespread media attention for his lifestyle, which included decades of heavy alcohol and drug abuse. A ''New York Times'' obituary noted his \"twin reputations as a titanically destructive personality and a master songsmith whose lyrics painted vivid portraits of the underbelly of Irish immigrant life.\"\n\nBorn in [[Kent]], England, to Irish parents, MacGowan spent his early childhood in [[County Tipperary|Tipperary]], Ireland, before moving back to England with his family at age six. After attending [[Holmewood House School|Holmewood House]] [[Preparatory school (United Kingdom)|preparatory school]], he won a literary scholarship to [[Westminster School]] but was expelled in his second year for drug offences. At age 17 to 18, he spent six months in [[psychiatric care]] at [[Bethlem Royal Hospital]] due to his drug and alcohol abuse. He became active on the London [[punk scene]] under the alias '''Shane O'Hooligan''', attending gigs, working in the Rocks Off record shop, and writing a punk [[fanzine]]. In 1977, he and his then-girlfriend [[Shanne Bradley]] formed the [[Punk rock|punk band]] the Nipple Erectors (subsequently [[the Nips]]). In 1982, with [[Spider Stacy]] and [[Jem Finer]], he co-founded the Pogues—originally called Pogue Mahone, an [[anglicisation]] of the Irish phrase {{lang|ga|póg mo thóin}}, meaning \"kiss my arse\"—who fused punk influences with [[traditional Irish music]]. He was the principal songwriter and lead vocalist on the band's first five studio albums, including ''[[Rum Sodomy & the Lash]]'' (1985) and the critically acclaimed and commercially successful ''[[If I Should Fall from Grace with God]]'' (1988). With Finer, he co-wrote the Christmas hit single \"[[Fairytale of New York]]\" (1987), which he recorded as a duet with [[Kirsty MacColl]]. A perennial Christmas favourite in Ireland and the UK, the song was certified sextuple platinum in the UK in 2023.\n\nDuring a 1991 tour of Japan, the Pogues dismissed MacGowan due to the impact of his drug and alcohol dependency on their live shows. He formed a new band, [[Shane MacGowan and The Popes]], with which he released two further studio albums, including the singles \"The Church of the Holy Spook\" (1994) and \"That Woman's Got Me Drinking\" (featuring [[Johnny Depp]], 1994). His solo projects after leaving the Pogues included the singles \"[[What a Wonderful World]]\" (a duet with [[Nick Cave]], 1992), \"Haunted\" (a duet with [[Sinéad O'Connor]], 1995) and \"[[My Way]]\" (1996); he also collaborated with artists including [[the Jesus and Mary Chain]], [[Dropkick Murphys]] and [[Cruachan (band)|Cruachan]]. In 2001, he rejoined the Pogues for reunion shows and continued to tour with the group until it dissolved in 2014. At a January 2018 gala concert to celebrate MacGowan's 60th birthday, the [[president of Ireland]], [[Michael D. Higgins]], presented him with a lifetime achievement award for outstanding contributions to Irish life, music and culture. Later that year, he married his long-term partner, journalist and writer [[Victoria Mary Clarke]]. Following years of deteriorating health, he died from pneumonia in Dublin in November 2023, aged 65.",
  "last_revision_date": "2025-10-15T18:35:31Z",
  "genres": [
    214,
    437,
    438
  ]
}