{
  "name": "Shane MacGowan",
  "description": "'''Shane Patrick Lysaght MacGowan''' (25 December 1957{{snd}}30 November 2023) was a British and Irish{{efn|name=nationality}} singer-songwriter, musician, and poet. Best known as the original lead vocalist and primary lyricist of [[Celtic punk]] band [[the Pogues]], MacGowan was an acclaimed songwriter whose lyrics often focused on the [[Irish emigrant]] experience. He also received widespread media attention for his personal life, which included decades of heavy alcohol and drug abuse.\n\nAs a teenager, MacGowan became active on the London [[punk scene]] under the alias '''Shane O'Hooligan'''. In 1977, with then-girlfriend [[Shanne Bradley]], he co-founded his first band, [[the Nips]]. In 1982, with [[Spider Stacy]] and [[Jem Finer]], he co-founded the Pogues, who fused punk influences with [[traditional Irish music]]. MacGowan was the principal songwriter and lead vocalist on the band's first five studio albums, including ''[[Rum Sodomy & the Lash]]'' (1985) and the critically acclaimed and commercially successful ''[[If I Should Fall from Grace with God]]'' (1988). MacGowan and Finer co-wrote the Christmas hit single \"[[Fairytale of New York]]\" (1987), which MacGowan recorded as a duet with [[Kirsty MacColl]]; the song remains a Christmas favourite in Ireland and Britain and was certified sextuple platinum in the UK in 2023.\n\nThe Pogues dismissed MacGowan during a 1991 tour of Japan, as his drug and alcohol dependency increasingly affected their live shows. He formed a new band, [[Shane MacGowan and The Popes]], with which he released two studio albums; he also collaborated with artists including [[Johnny Depp]], [[Nick Cave]], [[Sinéad O'Connor]], [[the Jesus and Mary Chain]], [[Dropkick Murphys]] and [[Cruachan (band)|Cruachan]]. In 2001, he rejoined the Pogues for reunion shows and continued to tour with the group until it dissolved in 2014. In January 2018, to mark his 60th birthday, he was honoured with a gala concert at Dublin's [[National Concert Hall]], where the [[president of Ireland]] presented him with a lifetime achievement award. Later that year, he married his long-term partner, journalist and writer [[Victoria Mary Clarke]]. Following years of deteriorating health, he died from pneumonia in Dublin in November 2023, aged 65.",
  "last_revision_date": "2026-01-31T09:21:33Z",
  "genres": [
    217,
    445,
    446
  ]
}