{
  "name": "Shatta Wale",
  "description": "'''Charles Nii Armah Mensah Jr.''', (born 17 October 1984) known by his [[stage name]] '''Shatta Wale''', formerly Bandana. is a [[Ghanaians|Ghanaian]] [[reggae]]-dancehall artist. Shatta Wale started with stage name \"Bandana<nowiki>''</nowiki>  after senior high school and released the hit track \"Bandana from Ghana\". The song made tremendous air waves in the Ghanaian music industry in 2004. Shatta Wale's sudden rise to the occasion happened in 2013 VGMA awards when he threw lyrical insults to [[VGMusic.com|VGMA]] now Telecel Ghana Music Awards ( TGMA)\". because he proclaimed they robbed him of the Dancehall artist of the year to a female [[Dancehall]] artist [[Kaakie]]. Even though the song had vulgar lyrics, it was so anticipated by the media which created his musical breakthrough.\n\nHis greatest song hit in 2013, Dancehall king took the airwaves by surprise. Shatta wale's musical revenue is mostly generated through hosting shows, which attract thousands of Ghanaian youths.\n\nIn 2015, Shatta Wale asked not to be nominated in the [[Vodafone Ghana Music Awards]] even though he could have won the prestigious Artiste & Song of the year for the second time running with his hit songs Dancehall Commando featuring Sarkodie, Party all night long featuring [[Jah Vinci]], Wine Ya Waist featuring [[Davido]] and Korle Gonno among many hit songs he released the preceding year: because of an impending court case with the organisers of the Awards Charter House Productions Ltd for allegedly making defamatory remarks against the [[Chief executive officer|CEO]] of Charter House in a video he uploaded on his [[Facebook]] page. Shatta Wale's hard work in 2014, got him nominated for the maiden and highly prestigious GN Bank Awards as the People’s Choice Male Musician of the Year.\n\nHis best-known singles are \"Dancehall King\", \"My Level\" and \"Taking Over\". He is also known for \"[[Already (song)|Already]]\" from [[Beyoncé]]'s ''[[The Lion King: The Gift]]'', which also featured [[Major Lazer]]. His song \"Dancehall King\" earned him the Artiste of the Year at the 2014 edition of the [[Vodafone Ghana Music Awards]]. Wale is also an actor who appeared in the films ''Never Say Never,'' ''The trial of Shatta Wale'' and ''Shattered Lives''. Wale's 2004 recording \"Moko Hoo\" was nominated for a [[Ghana Music Awards|Ghana Music Award]].\n\nIn 2014, he peaked to number 38 on [[E.tv]]'s \"Top 100 Most Influential Ghanaian\" Awards chart. He has since then appeared on the chart every year. He was ranked \"Most Influential Musician\" on social media in 2017. He made a record-setting as a dancehall artist to have won 11 awards at the 2019 [[3 Music Awards]] ceremony.",
  "last_revision_date": "2025-10-16T15:58:39Z",
  "genres": [
    25,
    317,
    550,
    559,
    1025
  ]
}