{
  "name": "Shinee",
  "description": "'''Shinee''' ({{IPAc-en|ˈ|ʃ|aɪ|n|iː}} {{respell|SHY|nee}}; {{langx|ko|샤이니|Syaini}}; {{langx|ja|シャイニー|Shainī}}; stylized as '''SHINee''') is a South Korean [[boy band]] formed by [[SM Entertainment]] in 2008. The group consists of four members: [[Onew]], [[Key (entertainer)|Key]], [[Choi Min-ho|Minho]], and [[Taemin]]. Originally a five-piece band, [[Jonghyun]] died on December 18, 2017. The group's musical impact in their native country has earned them numerous accolades and the title \"Princes of K-pop\", and their music has been listed among the greatest boy band songs of all time.\n\nShinee debuted in May 2008 with their first [[extended play]] (EP), ''[[Replay (EP)|Replay]]'', fronted by the single [[Replay (Shinee song)|of the same name]]. The group gained attention for starting a fashion trend amongst students, which the media dubbed the \"Shinee Trend\". In August 2008, the group released their first Korean studio album, ''[[The Shinee World]]'', which won Newcomer Album of the Year at the [[23rd Golden Disc Awards]]. Shinee further consolidated their popularity on the South Korean music scene with follow-up singles \"[[Ring Ding Dong (Shinee song)|Ring Ding Dong]]\" and \"[[Lucifer (Shinee song)|Lucifer]]\". \"Ring Ding Dong\" charted on top of several Korean music charts and gained popularity all over Asia. \"Lucifer\" was nominated for the Best Dance Performance Award at the [[Mnet Asian Music Awards]] in 2010 for its outstanding choreography. In 2012, the group released ''[[Sherlock (EP)|Sherlock]]'', which became the fifth best-selling album of the year with over 180,000 copies sold. Subsequent albums included ''[[The Misconceptions of Us]]'' (2013), ''[[Odd (album)|Odd]]'' (2015), ''[[1 of 1 (Shinee album)|1 of 1]]'' (2016), ''[[The Story of Light (Shinee album)|The Story of Light]]'' (2018), ''[[Don't Call Me (album)|Don't Call Me]]'' (2021), and ''[[Hard (Shinee album)|Hard]]'' (2023). The group has also been included in the [[Forbes Korea Power Celebrity 40|''Forbes'' Korea Power Celebrity 40]] twice (2014, 2016).\n\nIn mid-2011, Shinee signed with [[EMI Music Japan]] to venture into the Japanese music scene. Their Japanese version of their single \"Replay\" sold over 100,000 copies, the highest number of sales for a Japanese debut single recorded by [[Oricon]] for a South Korean group at the time. It was followed by their first Japanese studio album, ''[[The First (Shinee album)|The First]]'', on December 7, 2011 – both were certified Gold by [[Recording Industry Association of Japan|RIAJ]] for selling over 100,000 copies. In 2011, the group also held their Japan Debut Premium Reception at [[Abbey Road Studios]] in London, making them the first Asian artists to perform there. Two years later, they released their second Japanese album ''[[Boys Meet U (album)|Boys Meet U]]'' (2013), followed by ''[[I'm Your Boy]]'' (2014), ''[[D×D×D]]'' (2016), and ''[[Five (Shinee album)|Five]]'' (2017).\n\nShinee is considered to be one of the best live vocal groups in K-pop and is known for their highly synchronized and complex dance routines, having been awarded the Best Dance Performance Award at the Mnet Asian Music Awards [[List of awards and nominations received by Shinee|three times]] in a row for their dance performances to \"[[Sherlock (Clue + Note)]]\", \"[[Dream Girl – The Misconceptions of You|Dream Girl]]\" and \"[[View (Shinee song)|View]]\". Shinee's signature musical style is contemporary R&B, but the group is known for their experimental sound, incorporating various genres including [[funk rock]], [[hip hop]], and [[Electronic dance music|EDM]].",
  "last_revision_date": "2025-09-11T18:53:48Z",
  "genres": [
    276,
    397,
    554,
    618,
    648
  ]
}