{
  "name": "Show of Hands",
  "description": "'''Show of Hands''' is an English acoustic [[Traditional music|roots]]/[[Folk music|folk]] duo formed in 1986 by singer-songwriter [[Steve Knightley]] (guitars, [[mandolin]], [[mandocello]], [[cuatro (instrument)|cuatro]]) and composer and multi-instrumentalist [[Phil Beer]] (vocals, guitars, violin, [[viola]], [[mandolin]], [[mandocello]]). Joined by singer and double-bassist [[Miranda Sykes]] for a tour in 2004, Show of Hands continued to regularly perform as a trio with Sykes, as well as in their original format. The line-up was further expanded in 2019 by the addition of Irish percussionist Cormac Byrne.\n\nKnown for their songs with rousing choruses that address contemporary social issues, (notably their \"singalong attack on the bankers,\" [[Arrogance Ignorance and Greed]]) these often illustrate current concerns through historical narratives and have earned Knightley the label the 'Gravel voiced spokesman of the rural poor'. Rooted in English traditional music the songs are shot through with diverse influences from music across the world, including the blues, Americana, and Latin rhythms. Nominating Knightley as 'songwriter of the '90s,' [[Tom Robinson]] of [[BBC Radio 6]] noted that the songs spring from \"the soil of the [[West Country]],\" where, as Robin Denselow writes in the Guardian, \"Beer and Knightley have become folk heroes\".\n\nWidely recognised as pioneers in the folk/roots arena, both for their enduring emphasis on stagecraft and their radical business model, Show of Hands are noted for the high level of professionalism they bring to their performances, whether in a small club or the [[Royal Albert Hall]]. Their \"much vaunted cottage industry,\" set up Show of Hands as an independent concern before the internet made this common practice. Beer and Knightley, with their then manager, Gerard O'Farrell, built on their close relationship with their growing and \"devoted\" fanbase to create a completely self-contained way of working. This included their record label and production company Hands On Music, that gave them control of their consistently 'classy' output.\n\nShow of Hands have received widespread critical acclaim over their 30 album (and continuing) career, and in 2006 were voted \"Greatest Devonians Ever\" in a poll run by Devon Country Council beating [[Francis Drake|Sir Francis Drake]], [[Agatha Christie]] and [[Chris Martin]] amongst others to the title.",
  "last_revision_date": "2025-10-08T17:17:46Z",
  "genres": [
    8,
    436
  ]
}