{
  "name": "Siouxsie and the Banshees",
  "description": "'''Siouxsie and the Banshees''' ({{IPAc-en|ˈ|s|u|z|i|_|æ|n|d|_|ð|ə|_|ˈ|b|æ|n|ʃ|i|z}} {{respell|SU|zi|and|the|BAN|shees}}) were a [[British rock]] band formed in London in 1976 by vocalist [[Siouxsie Sioux]] and bassist [[Steven Severin]]. [[Post-punk]] pioneers, they have been widely influential, both over their contemporaries and later acts. ''[[The Times]]'' called the group \"one of the most audacious and uncompromising musical adventurers of the post-punk era\".\n\nInitially associated with the [[punk rock|punk]] scene, the band – including guitarist [[John McKay (guitarist)|John McKay]] and drummer [[Kenny Morris (musician)|Kenny Morris]] – rapidly evolved to create \"a form of post-punk discord full of daring rhythmic and sonic experimentation\". Their debut album ''[[The Scream (album)|The Scream]]'' was released to widespread critical acclaim in 1978. Following membership changes, including the addition of guitarist [[John McGeoch]] and drummer [[Budgie (musician)|Budgie]], they changed their musical direction and became one of the most successful [[alternative pop]] groups of the 1980s. Their third album ''[[Kaleidoscope (Siouxsie and the Banshees album)|Kaleidoscope]]'' (1980) peaked at number 5 on the [[UK Albums Chart]]. With ''[[Juju (Siouxsie and the Banshees album)|Juju]]'' (1981) which also reached the top 10, they became an influence on the emerging [[Gothic rock|gothic]] scene.\n\nIn 1988, the band made a breakthrough in North America with the multifaceted album ''[[Peepshow (album)|Peepshow]]'', which received critical praise. With substantial support from [[alternative rock]] radio stations, they achieved a mainstream hit in the US in 1991 with the pop single \"[[Kiss Them for Me (song)|Kiss Them for Me]]\".\n\nDuring their career, Siouxsie and the Banshees released 11 studio albums and 30 singles. The band experienced several line-up changes, with Siouxsie and Severin being the only constant members. They disbanded in 1996, with Siouxsie and Budgie continuing to record music as [[the Creatures]], a second band they had formed in the early 1980s. In 2004, Siouxsie began a solo career.",
  "last_revision_date": "2026-01-30T05:35:20Z",
  "genres": [
    40,
    42,
    518,
    853,
    969
  ]
}