{
  "description": "'''Skiltron''' is a [[folk metal]] band formed in [[Buenos Aires]] in 2004 by Emilio Souto. Since 2018, the band has moved to Europe (Finland, Spain and France). Skiltron are considered one of the few Southern American metal bands to fuse [[Heavy metal music|heavy metal]] and [[Celtic music]], a style usually more common in many parts of [[Europe]]. They are also well known for incorporating [[bagpipes]] into their music. The name \"Skiltron\" derives from a variation of the word [[schiltron]], a formation used by the Scottish during the [[Wars of Scottish Independence|Wars of Independence]].\n\nStarting with a 3 song demo in 2004 called ''Gathering the Clans'', the band released their full length debut album [[The Clans Have United]] in 2006 through the European Record label Underground Symphony. This was followed by their second album [[Beheading the Liars]] in 2008, and their third album in 2010, ''The Highland Way'', with each album continually building on the band's unique style and sound. Their most recent album is ''Legacy of Blood'', released in 2016, released by Trollzorn Records.\n\nMost of their early live concerts took place in Argentina, sharing the stage with bands such as [[Grave Digger (band)|Grave Digger]], [[In Extremo]] and [[Korpiklaani]], with whom the band shared a South American tour in 2010. They made their debut playing in Europe in the UK in 2012, where they were joined by [[Sabbat (English band)|Sabbat]] and [[Skyclad (band)|Skyclad]] singer [[Martin Walkyier]] as a guest.\n\nAfter the release of fourth album ''Into the Battleground'' in 2013 the band started to tour Europe regularly, playing festivals such as [[Wacken Open Air|Wacken]], [[Bloodstock Open Air|Bloodstock]] and more. They were thus able to share the stage with bands such as [[Judas Priest]], [[Slayer]], [[In Flames]], [[King Diamond (band)|King Diamond]], [[Avantasia]], and more. The release of their latest album in 2016 was followed by a European tour, where they played 50 shows in two months in twenty countries. They toured the UK alongside [[pirate metal]] band Iron Seawolf. In early 2017 they played for the first time in Japan, sharing three shows with German bands [[Equilibrium (band)|Equilibrium]] and [[Suidakra]].",
  "last_revision_date": "2025-06-04T21:35:11Z"
}