{
  "name": "Slade",
  "description": "'''Slade''' are  an English [[Rock music|rock]] band formed in [[Wolverhampton]] in 1966. They rose to prominence during the [[glam rock]] era in the early 1970s, achieving 17 consecutive top 20 hits and six number ones on the [[UK Singles Chart]]. The ''[[British Hit Singles & Albums]]'' names them the most successful British group of the 1970s based on sales of singles. They were the first act to have three [[single (music)|singles]] enter the charts at number one; all six of the band's [[record chart|chart-toppers]] were [[songwriter|written]] by [[Noddy Holder]] and [[Jim Lea (musician)|Jim Lea]]. As of 2006, total UK sales stood at over 6,500,000. Their best-selling single, \"[[Merry Xmas Everybody]]\", has sold in excess of one million copies.{{sfn|Roberts|2006|p=506}} According to the 1999 BBC documentary ''It's Slade'', the band have sold more than 50 million records worldwide.\n\nAll four members of Slade grew up in the area of England known as the [[Black Country]]. After a period in different groups, the four members came together by 1966 as 'N Betweens, and recorded some unsuccessful singles. In 1969 Jack Baverstock of [[Philips Records]] signed them and recorded their debut album, changing their name to \"Ambrose Slade\", a name inspired by Baverstock's secretary, who had named her handbag Ambrose and her shoes Slade. Slade dominated the UK singles charts during the early 1970s. Slade achieved twelve Top 5 hit singles in the UK between 1971 and 1974, three of which went straight to No. 1.{{sfn|Roberts|2006|p=506}} Of the 17 Top 20 hits between 1971 and 1976, six made No. 1, three reached No. 2 and two peaked at No. 3.{{sfn|Roberts|2006|p=506}} No other UK act of the period enjoyed such consistently high chart placings in the UK [[Top 40]] or sold as many singles. In 1973 alone, \"[[Merry Xmas Everybody]]\" sold over one million copies globally, obtaining [[music recording sales certification|gold disc]] status. They toured Europe in 1973 and the US in 1974. Slade have released over 30 albums, three of which reached No. 1 in the [[UK Albums Chart]].{{sfn|Roberts|2006|p=506}} Their releases have spent 315 weeks in the UK charts and they have earned 24 top-30 UK hits {{as of|2016|lc=y}}.\n\nFollowing an unsuccessful move to the U.S. in 1975, Slade's popularity in the UK waned, but was unexpectedly revived in 1980 when they were last-minute replacements for [[Ozzy Osbourne]] at the [[Reading and Leeds Festivals|Reading Rock Festival]]. The band later acknowledged this to have been one of the highlights of their career. For the next two years, the band produced material tailored towards the heavy-metal scene and by 1984, they finally cracked the American market with the hits \"[[Run Runaway]]\" and \"[[My Oh My (Slade song)|My Oh My]]\". This new-found success did not last long, however, and despite a top-25 UK hit in the early 1990s the band split shortly after in 1992. The original line-up split re-formed later in the year as Slade II. The band have continued, with a number of line-up changes, to the present day. They have also shortened the group name back to Slade. \n\nA number of artists from diverse genres have cited Slade as an influence. ''The Illustrated Encyclopaedia of Music'' tells of Holder's powerful vocals, guitarist [[Dave Hill (guitarist)|Dave Hill]]'s equally arresting dress sense and the [[Sensational spelling|deliberate misspelling]] of their song titles (such as \"[[Cum On Feel the Noize]]\" and \"[[Mama Weer All Crazee Now]]\") for which they became well known.{{sfn|Du Noyer|2003|pp=84–85}}",
  "last_revision_date": "2025-08-21T14:01:33Z",
  "genres": [
    533,
    496
  ]
}