{
  "name": "Son House",
  "description": "'''Edward James''' \"'''Son'''\" '''House Jr.''' (March 21, 1902{{efn|name=fn1}} – October 19, 1988) was an American [[Delta blues]] singer and guitarist, noted for his highly emotional style of singing and [[slide guitar]] playing.\n\nAfter years of hostility to [[secular music]], as a preacher and for a few years also working as a church pastor, he turned to blues performance at the age of 25. He quickly developed a unique style by applying the rhythmic drive, vocal power and emotional intensity of his preaching to the newly learned idiom. In a short career interrupted by a spell in [[Parchman Farm]] penitentiary, he developed his musicianship to the point that [[Charley Patton]], the foremost blues artist of the [[Mississippi Delta]] region, invited him to share engagements and to accompany him to a 1930 recording session for [[Paramount Records]].\n\nIssued at the start of the [[Great Depression]], the records did not sell and did not lead to national recognition. Locally, House remained popular, and in the 1930s, together with Patton's associate [[Willie Brown (musician)|Willie Brown]], he was the leading musician of [[Coahoma County, Mississippi|Coahoma County]]. There he was a formative influence on [[Robert Johnson]] and [[Muddy Waters]]. In 1941 and 1942, House and the members of his band were recorded by [[Alan Lomax]] and [[John W. Work III|John W. Work]] for the [[Library of Congress]] and [[Fisk University]]. The following year, he left the Delta for [[Rochester, New York]], and gave up music.\n\nIn 1964, House was rediscovered and encouraged to return to music by figures such as [[Alan Wilson (musician)|Alan Wilson]], co-founder of the band [[Canned Heat]]. The following year, House released ''Father of Folk Blues'' (1965). He relearned his repertoire and established a career as an entertainer, performing for young, mostly white audiences in coffeehouses, at folk festivals and on concert tours during the [[American folk music revival]], billed as a \"[[Country blues|folk blues]]\" singer. He recorded several albums and some informally taped concerts have also been issued as albums.  In 2017, his single \"Preachin' the Blues\" was inducted into the [[Blues Hall of Fame]].",
  "last_revision_date": "2025-06-25T04:10:02Z",
  "genres": [
    336
  ]
}