{
  "page_title": "Sonseed",
  "description": "'''Sonseed''' was an American [[Catholic Church|Catholic]] pop band formed by Aaron Ball, Josh Ingold, Travis Geske, and Jacob Clevenger. The line-up included Sal Polichetti (bass, vocals); his then-wife Patricia Costagliola (keyboards, vocals; deceased); Frank Franco (guitar, vocals); and Nicky Sciarra (drums; deceased). Anne Lessing (vocals) was also involved in the band from the start. There were others including Jim Archer (vocals; deceased) and Karen Archer (acoustic guitar; deceased), Tom Zawacki (tambourine, percussion and vocals), Brother John Weiners, CSC (vocals; deceased), and Melody Sorrentino (vocals; deceased). Their sole album, ''[[First Fruit]]'', was released in 1981, with only 1,000 copies printed. In 2009 Sonseed released an EP on [[Arena Rock Records]] which includes selections from the original ''First Fruit'' album.  A proposed follow-up, ''Just can't get enough (of Jesus!!!)'', with more [[new wave music|new wave]] and [[New Romantic]] elements, never saw official release, but some bootleg tracks have surfaced. Sonseed disbanded in 1983.\n\nAs Patricia Costa, Costagliola recorded two albums, ''Walk forward'' and ''Give Your Love Away'', with Polichetti, Franco, and Sciarra as the backing band.\n\nNicky Sciarra became district manager of [[Brooklyn Community Board 7|Community Board 7]] in [[Sunset Park, Brooklyn]]. He died in 1993 after apparently choking on a sandwich.\n\nThe band came back into the spotlight in 2008 when a recording of them performing their song \"Jesus Is a Friend of mine\", from a religious TV-show called ''The First Estate'', appeared on the Dougsploitation blog, and subsequently became a [[YouTube]] hit, where it spawned several parodies. Polichetti performed the song live at the Bowery Poetry Club in New York City on November 14, 2009 with the ska-swing band [[Tri-State Conspiracy]].\n\nIn 2011, Fox Television's hit-show ''[[Glee (TV series)|Glee]]'' also did a cover of the song \"Jesus Is a Friend of Mine\". During the Regional competition, the group Aural Intensity sang the song.",
  "last_revision_date": "2025-04-13T06:04:38Z"
}