{
  "name": "Soundgarden",
  "description": "'''Soundgarden''' was an American [[Rock music|rock]] band formed in [[Seattle|Seattle, Washington]], in 1984 by singer and drummer [[Chris Cornell]], lead guitarist [[Kim Thayil]], and bassist [[Hiro Yamamoto]]. Cornell switched to rhythm guitar in 1985, replaced on drums initially by Scott Sundquist, and later by [[Matt Cameron]] in 1986. Yamamoto left in 1989 and was replaced initially by [[Jason Everman]] and shortly thereafter by [[Ben Shepherd]]. Soundgarden disbanded in 1997 and reformed in 2010. Following Cornell's death in 2017, Thayil declared in October 2018 that Soundgarden had disbanded a second time. The surviving members of the band have continued to occasionally work together since then, including reuniting for a one-off concert in tribute to Cornell in January 2019, and again in December 2024 for a benefit concert in Seattle with Shaina Shepherd on vocals under the [[anagram]] '''Nudedragons'''.\n\nSoundgarden was one of the pioneers of [[grunge]] music, a style of [[alternative rock]] that developed in the American [[Pacific Northwest]] in the mid-1980s, and helped to popularize it in the early 1990s, alongside such Seattle contemporaries as [[Alice in Chains]], [[Pearl Jam]], and [[Nirvana (band)|Nirvana]]. They were the first of a number of grunge bands to sign to the Seattle-based record label [[Sub Pop]], through which they released two [[Extended play|EP]]s: ''[[Screaming Life]]'' (1987) and ''[[Fopp (EP)|Fopp]]'' (1988). Soundgarden's debut album, ''[[Ultramega OK]]'', was also released in 1988 by the [[Los Angeles]]-based independent label [[SST Records]]; although the album did not sell well nationally, it garnered critical acclaim and the band's first [[Grammy Awards|Grammy Award]] nomination. Soundgarden was the first grunge band to be signed to a major label when they signed to [[A&M Records]] in 1988. The release of their second album, ''[[Louder Than Love]]'' (1989), was the band's first album to enter the [[Billboard 200|''Billboard'' 200]] chart, peaking at number 108, and spawned two radio hits: \"[[Hands All Over (Soundgarden song)|Hands All Over]]\" and \"[[Loud Love]]\".\n\nSoundgarden's third album ''[[Badmotorfinger]]'' (1991) helped usher in the mainstream success of grunge. The album was buoyed by the success of the singles \"[[Jesus Christ Pose]]\", \"[[Outshined]]\", and \"[[Rusty Cage]]\", reached number 39 on the ''Billboard'' 200 and has been certified [[RIAA certification|double-platinum]] by the [[Recording Industry Association of America]] (RIAA). The band's fourth album, ''[[Superunknown]]'' (1994), expanded their popularity; it debuted at number one on the ''Billboard'' 200 and yielded the Grammy Award-winning singles \"[[Spoonman]]\" and \"[[Black Hole Sun]]\". Soundgarden experimented with new sonic textures on their follow-up album ''[[Down on the Upside]]'' (1996), which debuted at number two on the ''Billboard'' 200 and spawned several hit singles of its own, including \"[[Pretty Noose]]\", \"[[Burden in My Hand]]\", and \"[[Blow Up the Outside World]]\". In 1997, the band broke up due to internal strife over its creative direction and exhaustion from touring. After more than a decade of working on projects and other bands, they reunited in 2010. [[Republic Records]] released their sixth and final studio album, ''[[King Animal]]'', in 2012.\n\nBy 2019, Soundgarden had sold more than 14 million records in the United States and an estimated 30 million worldwide. [[VH1]] ranked them at number 14 in their special, ''100 Greatest Artists of Hard Rock'' list. The band was selected for induction into the [[Rock and Roll Hall of Fame]] in 2025.",
  "last_revision_date": "2025-08-12T23:20:51Z",
  "genres": [
    519,
    547,
    39,
    42
  ]
}