{
  "page_title": "Southern All Stars",
  "description": "{{nihongo|'''Southern All Stars'''|サザンオールスターズ|Sazan Ōrusutaazu}}, also known by the abbreviations {{nihongo|'''Southern'''|サザン|Sazan}} and '''SAS''', are a Japanese rock band formed in Kanagawa in 1974.\n\nThe band is composed of [[Keisuke Kuwata]] (lead vocals and guitars), [[Yuko Hara]] (vocals and keyboards), [[Kazuyuki Sekiguchi]] (bass), {{ill|Hiroshi Matsuda (musician)|lt=Hiroshi Matsuda|ja|松田弘}} (drums) and {{ill|Hideyuki Nozawa (musician)|lt=Hideyuki Nozawa|ja|野沢秀行}} (percussion). In addition to the present lineup, former guitarist {{ill|Takashi Omori|ja|大森隆志}} had worked in the band until 2001.\n\nAfter the contract with Victor Entertainment, the band released their top ten charting debut single \"Katte ni Sindbad\" in 1978. Since then, Southern has been one of the [[Best-selling music artists in Japan|best-selling music groups in Japan]] the past 30 years, selling more than 47 million albums and singles in Japan alone. They have had over 40 top ten hit singles and 16 No. 1 albums on the Japan's [[Oricon]] [[record chart|Charts]] as of 2008.\n\nTheir 1998 [[compilation album|compilation]] ''[[Umi no Yeah!!]]'' has sold more than 3.3 million copies and became the best-selling [[double album]] in Japanese history. Commercially their most successful song \"[[Tsunami (Southern All Stars song)|Tsunami]]\", released in 2000, has sold over 2.9&nbsp;million units in Japan alone, and provided the band with the honor of winning the [[42nd Japan Record Awards]]. The band was also acclaimed and ranked No. 1 in [[HMV#Japan|HMV Japan]]'s 2003 list of \"100 most influential Japanese musicians\". In 2007, ''[[Rolling Stone|Rolling Stone Japan]]'' ranked their album ''{{ill|Ninkimono de Ikō|ja|人気者で行こう}}'' No. 32 on a list of the greatest Japanese rock albums of all time. They are also the only group to ever have 44 songs on the Oricon Top 100 weekly single chart simultaneously.\n\nThe band has occasionally gone into hiatus while individual members worked on solo and other projects and did so again between 2008 and 2013.",
  "last_revision_date": "2025-03-02T00:29:56Z"
}