{
  "description": "'''Spandau Ballet''' ({{IPAc-en|ˈ|s|p|æ|n|d|aʊ|_|ˈ|b|æ|l|eɪ}} {{respell|SPAN|dow|_|BAL|ay}}) were an English [[New wave music|new wave]] band formed in Islington, London, in 1979. Inspired by the capital's [[post-punk]] underground dance scene, they emerged at the start of the 1980s as the house band for the [[Blitz Kids (New Romantics)]], playing \"European Dance Music\" as \"The Applause\" for this new club culture's audience. They became one of the most successful groups of the [[New Romantic]] era of [[British pop music|British pop]] and were part of the [[Second British Invasion]] of the [[Billboard Hot 100|''Billboard'' Top 40]] in the 1980s, selling 25 million albums and having 23 hit singles worldwide. The band have had eight UK top 10 albums, including three greatest hits compilations and an album of re-recorded material.&nbsp;Their musical influences ranged from [[punk rock]] and [[soul music]] to the American crooners [[Frank Sinatra]] and [[Tony Bennett]].\n\nThe band's classic lineup featured [[Gary Kemp]] on guitar, synthesiser and backing vocals; his brother, [[Martin Kemp]], on bass; vocalist [[Tony Hadley]]; saxophonist [[Steve Norman]]; and drummer [[John Keeble]]. Gary Kemp was also the band's songwriter. Their debut single \"[[To Cut a Long Story Short]]\" reached No. 5 in the UK in 1980 and was the first of ten UK top-10 singles. The band peaked in popularity in 1983 with the album ''[[True (Spandau Ballet album)|True]]'', as its [[True (Spandau Ballet song)|title track]] reached No. 1 in the UK and the top 5 in the US. In 2011, it received a [[BMI Awards|BMI]] award as one of the most-played songs in US history with four million airplays. In 1984, they received a [[Brit Awards|Brit Award]] for technical excellence and were the first act to be approached by [[Bob Geldof]] to join the original [[Band Aid (band)|Band Aid]] lineup. In 1985, they performed at the [[Live Aid]] benefit concert at Wembley Stadium.\n\nIn 1990, the band played their last live show before a 19-year absence. In 1999, Hadley, Norman and Keeble launched an unsuccessful case in the High Court against Gary Kemp and his Reformation Publishing Company for a share of the band's songwriting royalties. Spandau Ballet reformed in 2009 for The Reformation Tour, a sell-out \"greatest hits\" world tour. In 2014, their archive-only feature-length documentary biopic, ''Soul Boys of the Western World'', was world-premiered at [[South by Southwest|SXSW]] Film Festival in Austin, Texas. It was officially screened at the Rome, Ghent (Belgium) and NYC Doc film festivals and received its European premiere at the [[Royal Albert Hall]], London.\n\nIn 2017, Hadley left Spandau Ballet. A year later, singer and actor Ross William Wild became their new frontman for a series of European live dates and a one-off show at Eventim's [[Hammersmith Apollo]]. In May 2019, Wild tweeted that he had quit the band \"to pursue my own music with my band Mercutio\", while Spandau bass player Martin Kemp confirmed there were no further plans for Spandau to tour without original singer Hadley.",
  "last_revision_date": "2025-06-18T02:08:45Z"
}