{
  "name": "Sparx",
  "description": "'''Sparx''' is an American [[New Mexico music]] band composed of the four Sanchez sisters Verónica, Rosamaria, Kristyna and Carolina. They were known beginning with their childhood career, in the 1980s. In the 1990s they found fame in Mexico and most Latin American countries in addition to success in the [[United States]], recording a variety of styles of songs including pop songs, as well as [[Latin music]] classics, [[corrido]]s, [[cumbia]]s, [[ballad]]s, and [[bolero]]s.\n\nThey had their beginning taking part in a songwriting competition at the festival [[Juguemos a Cantar]] with the winning song \"Vamos a Jugar\". They appeared as \"[[Lorenzo Antonio]] y Su Grupo\" (Lorenzo Antonio and His Group). They've collaborated with their brother Lorenzo often, including with albums like ''Corridos Famosos'', Latin folk songs like a take on [[Juan Gabriel]]'s and [[Rocío Dúrcal]]'s \"Que Bonito es [[Santa Fe, New Mexico|Santa Fé]]\" and even [[Country music|country]] duets like \"[[The Wild Side of Life]]/[[It Wasn't God Who Made Honky Tonk Angels]]\".\n\nThe sisters came from a musical family. Their father Amador Sanchez was a musician, songwriter, and record producer known as Tiny Morrie who had a huge hit \"Cartas Tristes\". Their mother, Gloria Pohl, was a vocalist who has recorded two albums. Their brother [[Lorenzo Antonio]] is also a renowned singing artist in his own right. Their uncles [[Al Hurricane]] dubbed Godfather of New Mexico music and Baby Gaby, as well as Al's son [[Al Hurricane Jr.]]\n\nMany of their songs have hit the top 10 on Billboards Latin charts. The band has also been nominated for ''Billboard'' awards and the [[Lo Nuestro Award for Pop Group or Duo of the Year]] at the [[Premio Lo Nuestro 1995|7th Lo Nuestro Awards]].\n\nSparx members and their brother Lorenzo Antonio are very much involved in charity through ''Sparx Lorenzo Antonio Foundation''. Since 2001, date of its establishment, the foundation distributes college scholarships for New Mexico high school students.",
  "last_revision_date": "2025-04-13T06:07:26Z",
  "genres": [
    815,
    684,
    1017
  ]
}