{
  "name": "Status Quo",
  "description": "'''Status Quo''' are a British rock band. The group originated in London and was founded in 1962 by [[Francis Rossi]] and [[Alan Lancaster]] while they were still schoolboys. After a number of name and lineup changes, which included the introduction of [[John Coghlan (drummer)|John Coghlan]] in 1963 and [[Rick Parfitt]] in 1967, the band became '''The Status Quo''' in 1967 and Status Quo in 1969. As of 2022, the group have been active for 60 consecutive years (despite announcing a breakup in 1984, they played [[Live Aid]] the following year and resumed normal activities in 1986).\n\nThey have had over 60 chart hits in the UK – more than any other band – including \"[[Pictures of Matchstick Men]]\" (their first charting song), \"[[Caroline (Status Quo song)|Caroline]]\" (their first top 5 hit), and \"[[Down Down]]\" (their only No. 1 hit). Twenty-two of these reached the Top 10 in the [[UK Singles Chart]], and fifty-seven reached the Top 40. They have released over 100 singles and 33 studio albums, most of which were bestsellers. Since reaching number 5 on the UK albums chart in 1972 with ''[[Piledriver (Status Quo album)|Piledriver]]'', Status Quo have placed 29 consecutive studio albums on the UK charts, including 20 in the top ten studio albums, extending all the way up to their most recent release, ''[[Backbone (Status Quo album)|Backbone]]'', in 2019. In 2012, they were announced as the tenth best-selling group of all time on the UK Singles Chart with 7.2 million singles sales in their homeland alone. As of 2015, they were one of only 50 artists to have achieved more than 500 total weeks on the [[UK Albums Chart]].\n\nIn July 1985 the band opened Live Aid at [[Wembley Stadium (1923)|Wembley Stadium]] with \"Rockin' All Over the World\". In 1991, Status Quo received a [[Brit Awards|Brit Award]] for Outstanding Contribution to Music. In 2014, preparing to headline that year's [[Download Festival]], Status Quo won the ''Service to Rock'' award at the [[Kerrang! Awards]]. Status Quo appeared on the BBC's ''[[Top of the Pops]]'' more than any other band. Their success and longevity as well, in part, as their connections to the British [[British royal family|Royal Family]], including philanthropic work with the [[Prince's Trust]], have seen them frequently described as a \"national institution\" by the media. The band claim to have sold over 118 million records worldwide.",
  "last_revision_date": "2025-05-14T14:53:14Z"
}