{
  "name": "Steely Dan",
  "description": "'''Steely Dan''' is an American [[Rock music|rock]] band formed in [[Annandale-on-Hudson, New York|Annandale-on-Hudson]], New York, in 1971 by [[Walter Becker]] (guitars, bass, backing vocals) and [[Donald Fagen]] (keyboards, lead vocals). Originally having a traditional band lineup, Becker and Fagen chose to stop performing live by the end of 1974 and continued Steely Dan as a studio-only duo, utilizing a revolving cast of [[session musicians]]. ''[[Rolling Stone]]'' magazine named them \"the perfect musical [[antihero]]es for the seventies\".\n\nBecker and Fagen played together in a variety of bands from their time together studying at [[Bard College]] in Annandale-on-Hudson. They later moved to [[Los Angeles]], gathered a band of musicians and began recording music. Their debut album, ''[[Can't Buy a Thrill]]'' (1972),  established a template for their career, blending elements of rock, [[jazz]], [[Latin music]], [[rhythm and blues|R&B]], and [[blues]] with sophisticated [[music production|studio production]] and cryptic, irony-infused lyrics. The band enjoyed critical and commercial success with seven studio albums, peaking with their top-selling album ''[[Aja (album)|Aja]]'', released in 1977.  \n\nAfter Steely Dan disbanded in 1981, Becker and Fagen worked sporadically on solo projects through the 1980s, although a [[cult following]] remained devoted to the group's work. Since reuniting in 1993, Steely Dan has toured steadily and released two albums of new material, the first of which, ''[[Two Against Nature]]'' (2000), earned a [[Grammy Award for Album of the Year]] at the [[43rd Annual Grammy Awards|43rd Grammy Awards]]. Their most recent album of new studio material is 2003's ''[[Everything Must Go (Steely Dan album)|Everything Must Go]]'', though they have continued to release compilations, [[box set]]s and live albums on a regular basis. After Becker's death in 2017, Fagen reluctantly continued the group with himself as the sole official member.\n\nSteely Dan was inducted into the [[Rock and Roll Hall of Fame]] in 2001 and have sold more than 40 million records worldwide. [[VH1]] ranked Steely Dan at No. 82 on their list of the \"100 Greatest Musical Artists of All Time\" in 2010, and ''Rolling Stone'' ranked them No. 15 on its list of the \"20 Greatest Duos of All Time\" in 2015.",
  "last_revision_date": "2025-06-16T15:51:20Z",
  "genres": [
    620,
    1267,
    912,
    617,
    1104
  ]
}