{
  "name": "Steven Tyler",
  "description": "'''Steven Victor Tallarico''' (born March 26, 1948), known professionally as '''Steven Tyler''', is an American singer and songwriter. Tyler is best known as the lead singer of the [[Boston]]-based rock band [[Aerosmith]], in which he also plays the keyboards, harmonica and percussion. He has been called the \"Demon of Screamin{{'\"}} due to his high screams and his wide vocal range. He is also known for his on-stage acrobatics. During live performances, Tyler is known for dressing in colorful, sometimes [[androgynous]] outfits and makeup with his trademark scarves hanging from his microphone stand.\n\nIn the 1970s, Tyler rose to prominence as the lead singer of Aerosmith, which released such hard rock albums as ''[[Toys in the Attic (album)|Toys in the Attic]]'' and ''[[Rocks (Aerosmith album)|Rocks]]'' as well as a string of hit singles, including \"[[Dream On (Aerosmith song)|Dream On]]\", \"[[Sweet Emotion]]\" and \"[[Walk This Way]]\". By the late 1970s and early 1980s, Tyler had become addicted to drugs and alcohol, and the band's popularity waned. In 1986, Tyler completed drug rehabilitation and Aerosmith rose to prominence again when Tyler and Joe Perry joined [[Run-DMC]] for a re-make of \"Walk This Way\", which became a Top 5 hit. Aerosmith subsequently launched a comeback, and its multi-platinum albums ''[[Permanent Vacation (Aerosmith album)|Permanent Vacation]]'', ''[[Pump (album)|Pump]]'', ''[[Get a Grip]]'' and ''[[Nine Lives (Aerosmith album)|Nine Lives]]'' produced a combined thirteen Top 40 singles and won the band numerous awards. In 2016, Tyler released his debut solo album, ''[[We're All Somebody from Somewhere]]'', a [[country rock]] album that included the single \"[[Love Is Your Name]]\".\n\nTyler is included in ''[[Rolling Stone]]''{{'}}s list of the 100 greatest singers of all time. In 2001, he was inducted into the [[Rock and Roll Hall of Fame]] with Aerosmith, In 2013, Tyler and his songwriting partner [[Joe Perry (musician)|Joe Perry]] received the [[American Society of Composers, Authors and Publishers|ASCAP]] Founders Award and were inducted into the [[Songwriters Hall of Fame]].",
  "last_revision_date": "2025-07-16T16:27:22Z",
  "genres": [
    542,
    489,
    528,
    290,
    138
  ]
}