{
  "name": "Stratovarius",
  "description": "'''Stratovarius''' is a Finnish [[power metal]] band. Formed in 1984, they have released sixteen studio albums, six DVDs and six live albums. The band's line-up has changed many times, with no founding member left since the departure of drummer [[Tuomo Lassila]] in 1995, and no member from their early recording days left following guitarist [[Timo Tolkki]]'s departure in 2008. Currently, the longest standing member is singer [[Timo Kotipelto]], who joined in 1994.\n\nThe band was founded in August 1984 as Black Water, consisting of Lassila as singer and drummer, guitarist Staffan Stråhlman, bassist John Vihervä, and, later, keyboardist Antti Ikonen. In Summer 1985, the band changed its name to Stratovarius, which was soon followed by line-up changes. Tolkki replaced Stråhlman and with this line-up, the band released its first album ''[[Fright Night (album)|Fright Night]]'' in 1989, with Tolkki as sole songwriter. While going through many bassists, the band released the albums ''[[Twilight Time (album)|Twilight Time]]'' in 1992 and ''[[Dreamspace]]'' in 1994. In 1994, Kotipelto replaced Tolkki as lead vocalist, and after the release of ''[[Fourth Dimension (Stratovarius album)|Fourth Dimension]]'' in 1995, Lassila and Ikonen and both left the band and were replaced by Jörg Michael and [[Jens Johansson]] respectively.\n\nThis line-up, sometimes identified as the \"classic line-up\" of Stratovarius, lasted ten years and saw the releases of eight albums, including most of their popular works, until Tolkki's departure in 2008; Tolkki had originally intended to disband Stratovarius, but allowed the rest of the band to continue Stratovarius without him at their request. The band's following albums were all positively received, and were acknowledged as a return to form for the band. The current line-up, which has remained the same since the arrival of drummer Rolf Pilve in 2012, is the longest in the band's history.",
  "last_revision_date": "2025-06-05T00:14:02Z",
  "genres": [
    797,
    1153,
    934
  ]
}