{
  "name": "Sublime",
  "description": "'''Sublime''' is an American [[ska]] [[Punk rock|punk]] band from [[Long Beach, California]]. Founded in 1988, the band's original lineup consisted of [[Bradley Nowell]] (vocals and guitar), [[Eric Wilson (bassist)|Eric Wilson]] (bass), and [[Bud Gaugh]] (drums). Lou Dog, Nowell's [[Dalmatian (dog)|dalmatian]], was the [[mascot]] of the band. Nowell died of a [[heroin]] [[overdose]] in 1996, resulting in the band's breakup. In 1997, songs such as \"[[What I Got]]\", \"[[Santeria (song)|Santeria]]\", \"[[Wrong Way]]\", \"[[Doin' Time]]\", and \"[[April 29, 1992 (Miami)]]\" were released to U.S. radio.\n\nSublime released three studio albums, one live album, five compilation albums, three EPs, and one box set. Although their first two albums—''[[40oz. to Freedom]]'' (1992) and ''[[Robbin' the Hood]]'' (1994)—were slightly popular in the United States, Sublime did not experience major commercial success until 1996 with their [[Sublime (album)|self-titled third album]], released two months after Nowell's death. Peaking at No. 13 on the [[Billboard 200|''Billboard'' 200]], it spawned the hit single \"[[What I Got]]\", which reached number one on the ''Billboard'' [[Alternative Airplay|Modern Rock Tracks]] chart. As of 2009, the band has sold over 17 million albums worldwide, including about ten million in the U.S. alone. [[Michael Happoldt|Michael \"Miguel\" Happoldt]] and [[Marshall Goodman|Marshall \"Ras MG\" Goodman]] contributed to multiple Sublime songs.\n\nIn 2009, the surviving members attempted to reform the band with [[Rome Ramirez]], a young guitarist and avowed Sublime fan from California. However, not long after performing at [[Cypress Hill]]'s Smokeout Festival, a Los Angeles judge banned the new lineup from using the Sublime name as they needed permission from Nowell's estate, which owns the rights to the Sublime name. This prompted the lineup of Wilson, Gaugh, and Ramirez to change their name to [[Sublime with Rome]], which went on to release three albums, although Gaugh left the group shortly after the release of their 2011 debut ''[[Yours Truly (Sublime with Rome album)|Yours Truly]]''.\n\nIn 2023, Gaugh rejoined Wilson and Bradley Nowell's son [[Jakob Nowell|Jakob]] to reform Sublime. With Wilson subsequently announcing his departure from Sublime with Rome, Sublime with Rome disbanded at the end of 2024.",
  "last_revision_date": "2025-12-16T00:35:48Z",
  "genres": [
    1039,
    1125
  ]
}