{
  "name": "Suede",
  "description": "'''Suede''' (known as '''the London Suede''' in the United States) are an English [[Rock music|rock]] band formed in [[London]] in 1989 by singer [[Brett Anderson]], guitarist [[Justine Frischmann]], and bassist [[Mat Osman]]. Drawing from [[glam rock]] and [[post-punk]], Suede were labeled \"The Best New Band in Britain\" by ''[[Melody Maker]]'' in 1992, attracting significant attention from the British music press. The following year, their debut album, ''[[Suede (album)|Suede]]'', reached number one on the [[UK Albums Chart]], becoming the fastest-selling debut album in nearly a decade. It won the [[Mercury Music Prize]] and helped propel [[Britpop]] as a musical era, though the band distanced themselves from the label.\n\nThe recording sessions for their second album, ''[[Dog Man Star]]'', were tumultuous, ending with guitarist and songwriter [[Bernard Butler]] leaving after conflicts with the other members. Guitarist and songwriter [[Richard Oakes (guitarist)|Richard Oakes]] replaced him and joined the band just before the accompanying tour. Though a commercial disappointment at the time, the album received generally enthusiastic reviews upon release and has since been celebrated as one of rock music's great albums. In 1994, Suede became part of Britpop's \"big four,\" alongside [[Oasis (band)|Oasis]], [[Blur (band)|Blur]], and [[Pulp (band)|Pulp]].\n\nIn 1996, following the addition of keyboardist Neil Codling, Suede achieved greater commercial success with ''[[Coming Up (album)|Coming Up]]''. The album reached number one in the UK, produced five top ten singles, and became Suede's best-selling album worldwide. Despite internal issues, Suede's fourth album, ''[[Head Music]]'' (1999), topped the British charts. Heavily promoted, the album received substantial media attention upon release; however, fan and critical responses were less enthusiastic than for previous records. Codling left the band in 2001, citing [[chronic fatigue syndrome]], and was replaced by Alex Lee. The band's fifth album, ''[[A New Morning]]'' (2002), their first after the collapse of [[Nude Records]], was a commercial and critical disappointment, leading to the band's disbandment the following year. In 2004, Anderson briefly reunited with Butler to form [[The Tears]] before beginning a solo career two years later.\n\nAfter much speculation, Suede reunited in 2010 for a series of concerts. Three years after their reunion performances, Suede released their sixth album, ''[[Bloodsports (album)|Bloodsports]]''. It was well-received by critics and returned the band to the UK top ten. Their seventh album, ''[[Night Thoughts (album)|Night Thoughts]]'', followed in 2016, achieving even greater critical and commercial success than its predecessor. Their eighth studio album, ''[[The Blue Hour (album)|The Blue Hour]]'', was released in September 2018, becoming the group's first top-five record since ''Head Music''. Their ninth studio album, ''[[Autofiction (album)|Autofiction]]'', was released in September 2022. They released their tenth studio album ''[[Antidepressants (album)|Antidepressants]]'' in September 2025.",
  "last_revision_date": "2025-10-21T21:55:15Z",
  "genres": [
    42,
    66,
    174,
    496
  ]
}