{
  "name": "Suge Knight",
  "description": "'''Marion Hugh''' \"'''Suge'''\" '''Knight Jr.''' ({{IPAc-en|ʃ|ʊ|ɡ}} {{respell|SHUUG}}; born April 19, 1965) is an American former record executive, former [[National Football League|NFL]] player, and convicted felon, who is the co-founder and former CEO of [[Death Row Records]]. Knight was a central figure in [[gangsta rap]]'s commercial success in the 1990s. This feat is attributed to the record label's first two album releases: [[Dr. Dre]]'s ''[[The Chronic]]'' in 1992 and [[Snoop Dogg]]'s ''[[Doggystyle]]'' in 1993. Knight is currently serving a 28-year sentence in prison for a fatal hit-and-run in 2015.\n\nBefore founding Death Row Records, Knight played college football at [[UNLV Rebels football|UNLV]] as a defensive end. He briefly played in the [[National Football League|NFL]] for the [[Los Angeles Rams]] as a replacement player during the [[National Football League Players Association#1987 strike|1987 NFL players strike]]. In 1995, [[Tupac Shakur]] began serving a prison sentence of up to {{frac|4|1|2}} years for a sexual abuse conviction. Knight struck a deal with Shakur that October, posting his $1.4 million bail and freeing him from prison pending an appeal of his conviction, while signing him to Death Row Records. In 1996, the label released Shakur's greatest commercial success, ''[[All Eyez on Me]]''. That September, after departing a [[Mike Tyson]] boxing match in [[Las Vegas]], a group that included Knight and Shakur assaulted [[Orlando Anderson]], a Southside Compton [[Crips]] gang member. Three hours later, someone shot into the car Knight was driving, injuring Knight and [[Murder of Tupac Shakur|fatally wounding Shakur]].\n\nDr. Dre left Death Row Records shortly before Shakur's death, followed by Snoop Dogg two years later. The label rapidly declined. Meanwhile, allegations mounted that Knight, beyond employing gang members, often used intimidation and violence in his business dealings. From the late 1990s to the early 2000s, Knight spent a few years incarcerated for assault convictions and associated violations of [[probation]] and [[parole]].\n\nIn September 2018, Knight pled [[Nolo contendere|no contest]] to [[voluntary manslaughter]] in a fatal 2015 [[Hit and run|hit-and-run]]. Knight's conviction, along with his previous felonies, triggered California's [[three-strikes law]]. He was sentenced to 28 years in prison, and is eligible for parole in October 2034, when he will be 69 years old.",
  "last_revision_date": "2025-06-15T11:16:54Z"
}