{
  "name": "Sun Ra",
  "description": "'''Le Sony'r Ra''' (born '''Herman Poole Blount''', May 22, 1914 – May 30, 1993), better known as '''Sun Ra''', was an American [[jazz]] composer, bandleader, piano and [[synthesizer]] player, and [[poet]] known for his [[experimental music]], \"cosmic\" philosophy, prolific output, and theatrical performances. For much of his career, Ra led The Arkestra, an ensemble with an ever-changing name and flexible line-up.\n\nBorn and raised in [[Alabama]], Blount became involved in the [[Music of Chicago|Chicago jazz]] scene during the late [[1940s]]. He soon abandoned his birth name, taking the name Le Sony'r Ra, shortened to Sun Ra (after [[Ra]], the Egyptian god of the Sun). Claiming to be an alien from [[Saturn]] on a mission to preach peace, he developed a mythical persona and an idiosyncratic credo that made him a pioneer of [[Afrofuturism]]. Throughout his life he denied ties to his prior identity saying, \"Any name that I use other than Ra is a pseudonym.\" His widely eclectic and [[avant-garde]] music echoed the entire history of jazz, from [[ragtime]] and early New Orleans hot jazz, to [[swing music]], [[bebop]], [[free jazz]] and [[jazz fusion|fusion]]. His compositions ranged from keyboard solos to works for [[big band]]s of over 30 musicians, along with electronic excursions, songs, chants, percussion pieces, and anthems.\n\nFrom the mid-1950s until his death, Ra led the musical collective The Arkestra, which featured artists such as [[Marshall Allen]], [[John Gilmore (musician)|John Gilmore]] and [[June Tyson]] throughout its various iterations. Its performances often included dancers and musicians dressed in elaborate, [[Future#Futures studies|futuristic]] costumes inspired by [[ancient Egypt]]ian attire and the [[Space Age]]. Following Ra's retirement in 1992 due to illness, the band remained active as [[The Sun Ra Arkestra]], and, as of 2024, continues performing under the leadership of veteran Ra sideman Marshall Allen.\n\nThough his mainstream success was limited, Ra was a prolific recording artist and frequent live performer, and remained influential throughout his life for his music and persona. He is now widely considered an innovator; among his distinctions are his pioneering work in [[free improvisation]] and [[modal jazz]] and his early use of [[electronic keyboard]]s and [[synthesizer]]s. Over his career, he recorded dozens of singles and over 100 full-length albums, comprising well over 1,000 songs, making him one of the most prolific recording artists of the 20th century.",
  "last_revision_date": "2025-07-29T02:04:28Z",
  "genres": [
    77,
    623,
    1137
  ]
}