{
  "name": "Sun Kil Moon",
  "description": "'''Sun Kil Moon''' is an American [[folk rock]] act from [[San Francisco|San Francisco, California]], founded in 2002. Initially a continuation of the defunct [[indie rock]] band [[Red House Painters]], Sun Kil Moon is now the primary recording moniker of vocalist and guitarist [[Mark Kozelek]]. The project is named after the Korean [[super flyweight]] boxer [[Moon Sung-kil|Sung-Kil Moon]].\n\nFollowing the delayed release of Red House Painters' final studio album, ''[[Old Ramon]]'' (2001), vocalist and guitarist Kozelek began recording new material under the name Sun Kil Moon with bandmates Anthony Koutsos (drums) and Jerry Vessel (bass), alongside Geoff Stanfield and [[Tim Mooney]]. The resulting album, ''[[Ghosts of the Great Highway]]'', was released in 2003 to critical acclaim. The project's second studio album, ''[[Tiny Cities]]'' (2005), was composed entirely of [[Modest Mouse]] cover songs.\n\nIn 2008, the band released its third studio album, ''[[April (Sun Kil Moon album)|April]]''. Recorded as a three-piece by Kozelek, Koutsos and Stanfield, the album was well received and featured guest vocal appearances from noted indie rock musicians [[Will Oldham]] and [[Ben Gibbard]].\n\nInspired by [[classical guitar]] music, Kozelek recorded Sun Kil Moon's fourth studio album, ''[[Admiral Fell Promises]]'' (2010), as a solo act, and continued to record mostly alone on its follow-up, ''[[Among the Leaves]]'' (2012). In 2013, Kozelek released three studio albums under his own name before releasing Sun Kil Moon's sixth studio album, ''[[Benji (album)|Benji]]'', in February 2014, to widespread critical acclaim and increased exposure, with the band releasing their seventh studio effort, ''[[Universal Themes]]'', in 2015. Sun Kil Moon's eighth studio album, ''[[Common as Light and Love Are Red Valleys of Blood]]'', was released in February 2017, which was followed by their ninth studio album, ''[[This Is My Dinner]]'', in November 2018. The tenth Sun Kil Moon studio album, ''[[I Also Want to Die in New Orleans]]'', was released in March 2019.",
  "last_revision_date": "2025-07-20T05:49:19Z",
  "genres": [
    573,
    40,
    1103,
    435
  ]
}