{
  "name": "Supergrass",
  "description": "'''Supergrass''' are an English rock band formed in 1993. For the majority of the band's tenure, the line-up consisted of brothers [[Gaz Coombes|Gaz]] (lead vocals, guitar) and [[Rob Coombes]] (keyboards), [[Mick Quinn]] (bass, backing vocals) and [[Danny Goffey]] (drums, backing vocals). Originally a three-piece, the band was officially joined by Rob Coombes in 2002.\n\nThe band signed to [[Parlophone Records]] in 1994 and produced ''[[I Should Coco]]'' (1995), the best-selling debut album for the label since [[the Beatles]]' ''[[Please Please Me]]''. Their first album's fourth single, \"[[Alright (Supergrass song)|Alright]]\", was an international hit. The band went on to release five more albums: ''[[In It for the Money]]'' (1997), ''[[Supergrass (album)|Supergrass]]'' (1999), ''[[Life on Other Planets]]'' (2002), ''[[Road to Rouen]]'' (2005) and ''[[Diamond Hoo Ha]]'' (2008), as well as a compilation called ''[[Supergrass Is 10]]'' (2004).\n\nIn August 2009, the band signed to [[Cooking Vinyl]] and began work on their seventh studio album, ''Release the Drones''. The album remains unreleased and unfinished. On 12 April 2010, the band announced that they were splitting up due to musical and creative differences. The group disbanded after four farewell gigs, the final one at [[La Cigale]], Paris, on 11 June 2010.\n\nThe band reformed in 2019, initially to perform at Pilton Party followed by a \"secret\" gig at Oslo in Hackney, London. The band made their final appearance of their first reunion with a performance in honour of [[Foo Fighters]]' recently deceased drummer [[Taylor Hawkins]] at his tribute concert in 2022, performing some of Hawkins' favourite songs from Supergrass's catalogue. Hawkins had previously expressed his love of the band, and had even made a cameo drum appearance at one of their concerts.\n\nThe band announced a 2025 UK tour at the end of 2024 playing ''I Should Coco'' (for its 30th anniversary) in its entirety plus hits.",
  "last_revision_date": "2025-08-18T11:41:57Z",
  "genres": [
    42,
    175
  ]
}