{
  "description": "'''Super Mama Djombo''' is a band from [[Guinea Bissau]] who sing in [[Guinea-Bissau Creole]]. The band was formed in the mid-1960s, at a [[Boy Scout]] camp, when the members were only children (the youngest was six years old). Mama Djombo is the name of a spirit that many fighters appealed to for protection during Guinea-Bissau's [[Guinea-Bissau War of Independence|War of Independence]].  \n\nIn 1974, the politically conscious band leader Adriano Atchutchi joined. The group became immensely popular in the young country, which had gained its independence the same year. They would often play at President [[Luís Cabral]]'s public speeches, and their concerts were broadcast live on radio.\n\nIn 1978, the group traveled to [[Cuba]] and appeared on the eleventh youth music festival in [[Havana]].{{Citation needed|date=July 2012}} Early in 1980, they went to [[Lisbon]] and recorded six hours of material. The first album ''Na cambança'' was released the same year, and the song ''Pamparida,'' which was based on a children's song, became a huge hit throughout West Africa. In 1980 Cabral was overthrown, and the new regime under [[João Bernardo Vieira]] no longer supported the band. They had fewer opportunities to perform, and broke up in 1986. However, the soundtrack to [[Flora Gomes]]' film ''[[Udju Azul di Yonta]]'' (''The blue eyes of Yonta'') (1993) was recorded by Adriano Atchutchi and other members of the original band under the name of Super Mama Djombo.\n\nThe original members of the band got back together many years later and recorded ''Ar Puro'' in 2008 in [[Iceland]]. \n\nIn 2012, Super Mama Djombo toured Europe appearting at [[Afrika Festival Hertme]]. The band included several of the original members, drummer Zé Manel, guitarist Miguelinho N'Simba, percussionist Armando Vaz Pereira and Djon Motta, together with new members such as solo guitarist Fernando Correia from the band Freaky Sound. Although Adriano Atchutchi, the original lead composer and bandleader, is not part of the current line up, the [[2012 Guinea-Bissau coup d'état|military coup]] in April resulted in him having to leave his post as a provincial governor when the military took over the functions of the government, so he was able to attend rehearsals to help the band prepare for the tour. The band said they hoped the tour would \"show people that Guinea-Bissau's loudest sound is not that of gunfire, but that of music.\"",
  "last_revision_date": "2025-04-08T21:13:56Z"
}