{
  "name": "Super Junior",
  "description": "'''Super Junior ''' ({{Korean |hangul=슈퍼주니어 |rr=Syupeo Junieo}}; stylized in [[all caps]]), also known as '''SJ''' or '''SuJu''', is a South Korean [[boy band]]. The group is composed of [[Leeteuk]], [[Kim Hee-chul|Heechul]], [[Yesung]], [[Shindong]], [[Lee Sung-min (singer)|Sungmin]], [[Eunhyuk]], [[Choi Si-won|Siwon]], [[Lee Donghae|Donghae]], [[Kim Ryeo-wook|Ryeowook]], and [[Cho Kyu-hyun|Kyuhyun]]. [[Han Geng]], [[Kim Ki-bum|Kibum]], and [[Kangin]] were originally part of the group before departing in 2011, 2015 and 2019, respectively. The group was formed by the founder of [[SM Entertainment]], [[Lee Soo-man]] in 2005 as a 12-piece group with rotational members but the concept was abandoned after the addition of Kyuhyun in 2006. They are also dubbed by the media as the \"King of Hallyu Wave\" due to their contributions in [[Korean Wave]].\n\nSuper Junior launched into international recognition following the release of their best-selling single \"[[Sorry, Sorry (Super Junior song)|Sorry, Sorry]]\" in 2009, the title song of their most critically successful album, ''[[Sorry, Sorry (album)|Sorry, Sorry]]''. Over the years, they have been divided into smaller groups, simultaneously targeting different music industries and audiences. The members have also individually branched out into hosting, presenting and acting. Their successes and popularity as all-rounded entertainers have led other Korean entertainment managements to also begin training their music groups in other aspects of the entertainment industry.\n\nSuper Junior was the best-selling [[K-pop]] artist for four years in a row. The group has earned thirteen music awards from the [[Mnet Asian Music Awards]], nineteen from the [[Golden Disc Awards]], and are the second singing group to win Favorite Artist Korea at the 2008 [[MTV Asia Awards]] after [[jtL]] in 2003. In 2012, they were nominated for \"Best Asian Act\" in [[MTV Europe Music Awards]]. They won the \"International Artist\" and \"Best Fandom\" awards at the [[2015 Teen Choice Awards]]. In March 2020, Super Junior broke their own record topping the Korean Album Chart of Taiwan's ''[[KKBOX]]'' for 122 consecutive weeks since 2017 with their 8th album ''[[Play (Super Junior album)|Play]]'', the 8th album repackage ''REPLAY'' in 2018, the 9th album ''[[Time Slip (album)|Time_Slip]]'' from 2019, and  9th album repackage ''Timeless''.",
  "last_revision_date": "2025-08-17T05:57:48Z",
  "genres": [
    277,
    315,
    404,
    552,
    646
  ]
}