{
  "name": "Swedish House Mafia",
  "description": "'''Swedish House Mafia''' ('''SHM''') are a Swedish [[house music|house]] [[Supergroup (music)|supergroup]] consisting of [[Axwell]], [[Steve Angello]] and [[Sebastian Ingrosso]]. The group officially formed in late 2008, were placed at number ten on the ''[[DJ Mag]]'' Top 100 DJ Poll 2011, and have been called \"the faces of mainstream [[progressive house]] music\", while being credited for \"setting the tone for the [[Electronic dance music|EDM]] boom of the early 2010s, more than any other act in modern dance music\". In 2012, they were ranked at number twelve on the ''DJ Mag'' Top 100 Poll. They are recognized for bringing the [[progressive house]] genre into the mainstream around 2009–2010, together with their compatriot [[Avicii]], standardizing a sound that until recently was relegated to the underground EDM.\n\nThe group scored international hits in 2010 with tracks such as \"[[One (Swedish House Mafia song)|One (Your Name)]]\" (featuring [[Pharrell Williams]]) and \"[[Miami 2 Ibiza]]\" (featuring [[Tinie Tempah]]), and their compilation album ''[[Until One]]'' (2010) the top five in the UK and US dance charts. Two years later, Swedish House Mafia embarked on an extensive farewell tour in support of their second compilation album, ''[[Until Now (Swedish House Mafia album)|Until Now]]'' (2012). The compilation album of previously released tracks was certified platinum in Sweden and peaked at number 14 on the [[Billboard 200|''Billboard'' 200]].\n\nOn 24 June 2012, the group announced they would disband. Their final performance before their breakup was at Ultra Miami on 24 March 2013. For the next five years, Angello worked solo, while Axwell and Ingrosso performed as the duo [[Axwell & Ingrosso]]. On 25 March 2018, the group reunited with a surprise closing set at the 20th anniversary of [[Ultra Music Festival]] in Miami, Florida.\n\nStarting in 2021, the group began releasing singles from their first proper studio album, including \"[[It Gets Better (song)|It Gets Better]]\" and \"[[Moth to a Flame]]\" featuring [[The Weeknd]]. The single \"[[Redlight (Swedish House Mafia song)|Redlight]]\" featuring [[Sting (musician)|Sting]] was released in 2022 ahead of the album ''[[Paradise Again]]''. The album reached number one on both the UK Dance Albums chart and ''[[Billboard (magazine)|Billboard]]''<nowiki/>'s [[Top Dance/Electronic Albums]] chart. Shortly after the album's release, they launched their \"[[Paradise Again World Tour]]\" and co-headlined the Coachella festival with The Weeknd. In 2024, the group returned to the Swedish charts with the single \"Lioness\" featuring [[Niki & the Dove]].",
  "last_revision_date": "2026-01-01T23:59:25Z",
  "genres": [
    395,
    981
  ]
}