{
  "description": "'''Roger Keith''' \"'''Syd'''\" '''Barrett''' (6 January 1946&nbsp;– 7 July 2006) was an English singer, guitarist and songwriter who co-founded the rock band [[Pink Floyd]] in 1965. Until his departure in 1968, he was Pink Floyd's [[Lead vocalist|frontman]] and primary songwriter, known for his whimsical style of [[psychedelic music|psychedelia]] and [[stream-of-consciousness]] writing.{{sfn|Chapman|2010|pp=144–148, 381–382}} As a guitarist, he was influential for his [[form (music)|free-form]] playing and for employing effects such as [[Consonance and dissonance|dissonance]], [[Distortion (music)|distortion]], [[echo machine|echo]] and [[Audio feedback|feedback]].\n\nTrained as a painter, Barrett was musically active for just over ten years. With Pink Floyd, he recorded the first three singles, their debut album ''[[The Piper at the Gates of Dawn]]'' (1967), part of their second album ''[[A Saucerful of Secrets]]'' (1968), and several songs that were not released until years later. In April 1968, Barrett left the band amid speculation of [[Mental disorder|mental illness]] and his use of [[psychedelic drug]]s. He began a brief solo career in 1969 with the single \"[[Octopus (Syd Barrett song)|Octopus]]\", followed by albums ''[[The Madcap Laughs]]'' (1970) and ''[[Barrett (album)|Barrett]]'' (1970), recorded with the help of Pink Floyd and the [[Soft Machine]].\n\nIn 1974, Barrett left the music industry, retired from public life and guarded his privacy until his death. He continued painting and dedicated himself to gardening. Pink Floyd recorded several tributes and homages to him, including the 1975 song [[suite (music)|suite]] \"[[Shine On You Crazy Diamond]]\" and parts of the 1979 [[rock opera]] ''[[The Wall]]''. In 1988, [[EMI]] released an album of unreleased tracks and outtakes, ''[[Opel (album)|Opel]]'', with Barrett's approval. In 1996, Barrett was inducted into the [[Rock and Roll Hall of Fame]] as a member of Pink Floyd. He died of [[pancreatic cancer]] in 2006.",
  "last_revision_date": "2025-06-14T00:06:56Z"
}