{
  "name": "T. Rex",
  "description": "'''T. Rex''', originally '''Tyrannosaurus Rex''', were  an English [[Rock music|rock]] band formed in London in 1967 by singer-songwriter and guitarist [[Marc Bolan]], who was their leader, frontman and only consistent member. Originally an acoustic [[psychedelic folk]] band, Bolan began to change the band's style towards electric rock with their fourth album, 1970's ''[[A Beard of Stars]]'', and shortened their name to T. Rex by the time their [[T. Rex (album)|self-titled fifth album]] was released later that same year. This development culminated with their first significant hit single \"[[Ride a White Swan]]\", and the group soon became pioneers of the [[glam rock]] movement.\n\nFrom 1970 to 1973, T. Rex were extremely popular in the UK, with a run of eleven top 10 singles, four of which reached number 1: \"[[Hot Love (T. Rex song)|Hot Love]]\", \"[[Get It On (T. Rex song)|Get It On]]\", \"[[Telegram Sam]]\" and \"[[Metal Guru]]\". Other major hits included \"[[Jeepster (song)|Jeepster]]\", \"[[Children of the Revolution (song)|Children of the Revolution]]\", \"[[Solid Gold Easy Action]]\", \"[[20th Century Boy]]\" and \"[[The Groover (T. Rex song)|The Groover]]\". The band's 1971 album ''[[Electric Warrior]]'' received critical acclaim, reached number 1 in the UK and became a landmark album in glam rock. The 1972 follow-up, ''[[The Slider]]'', was their most successful album in the US, where it went top 20. 1973's ''[[Tanx]]'' saw the band incorporating [[soul music|soul]], [[funk]] and [[gospel music|gospel]] into their sound. From 1974, T. Rex's appeal began to wane, though the band continued releasing albums, with their subsequent work blending rock with [[R&B]] and [[disco]].\n\nIn 1977, Bolan died in a car crash several months after the release of the group's final studio album ''[[Dandy in the Underworld]]'', and the group disbanded. T. Rex have continued to influence a variety of subsequent artists. The band were inducted into the [[Rock and Roll Hall of Fame]] in 2020.",
  "last_revision_date": "2026-01-22T12:59:49Z",
  "genres": [
    504,
    949,
    990
  ]
}