{
  "description": "'''Taymor Travon McIntyre''' (born June 16, 2000), better known by his stage name '''Tay-K''', is an American convicted [[Murder|murderer]] and former rapper. He is best known for his 2017 song \"[[The Race (Tay-K song)|The Race]]\", which peaked at number 44 on the US [[Billboard Hot 100|''Billboard'' Hot 100]] and received platinum certification by the [[Recording Industry Association of America]] (RIAA). Its lyrics detailed criminal activity carried out by McIntyre, and became popular following a nationwide manhunt that led to his arrest and eventual conviction for murder. \n\nMcIntyre spent parts of his childhood in [[California]] and [[Nevada]] before settling in the [[Dallas–Fort Worth metroplex]] in [[Texas]] at the age of ten. After dropping out of high school during his freshman year, he began his music career as a member of the rap group Daytona Boyz in 2014. In July of 2016, he was charged in connection with a home invasion and robbery that left 21-year-old Ethan Walker dead. He was released in January 2017 on house arrest until his trial. In March of that year, Tay-K cut off his ankle monitor and went on the run.\n\nMcIntyre was captured by [[United States Marshals Service|U.S. marshals]] in [[Elizabeth, New Jersey]], on June 30, 2017—the same day \"The Race\" was released—after three months evading authorities. Upon his [[detention (imprisonment)|detainment]] and subsequent [[prisoner transport|transportation]] back to Texas, McIntyre received online support from fans of the song. While being held at Tarrant County Jail in [[Fort Worth, Texas|Fort Worth]], Tay-K's management team released his second mixtape, ''[[Santana World]]'' (2017), which was met with generally positive critical reception and entered the [[Billboard 200|''Billboard'' 200]].\n\nIn July 2019, McIntyre was found guilty of murder for his involvement in the 2016 home invasion resulting in the death of Ethan Walker. He was sentenced to 55 years in prison. In November 2019, McIntyre was [[Indictment|indicted]] on a second murder charge, for shooting 23-year-old Mark Anthony Saldivar while on the run in 2017; he was convicted in April 2025 and sentenced to 80 years in prison.",
  "last_revision_date": "2025-06-14T23:06:51Z"
}