{
  "name": "Tenacious D",
  "description": "'''Tenacious D''' is an American [[comedy rock]] band formed in Los Angeles in 1994 by [[Jack Black]] and [[Kyle Gass]].\n\nThe band started performing on the Los Angeles music scene, eventually befriending [[David Cross]] who invited them to open for the live version of [[Mr. Show with Bob and David|''Mr. Show'']] on [[HBO]]. This led the band to have their own [[Tenacious D (TV series)|variety television series]] on HBO, produced by Cross and [[Bob Odenkirk]]. Towards the end of the 1990s, the duo supported large rock acts such as [[Tool (band)|Tool]], [[Pearl Jam]] and [[Beck]]. The band also befriended [[Dave Grohl]], later appearing in [[Foo Fighters]] music video, ''[[Learn to Fly]]''.\n\nIn 2000, they signed with [[Epic Records]] and the year after they released [[Tenacious D (album)|''Tenacious D'']]'','' their debut album featuring a full band that included Grohl on drums. Their second single, [[Tribute (song)|''Tribute'']], achieved [[Cult following|cult status]], contributing to their popularity in the UK, Sweden and Australia. In 2003, the band released ''[[The Complete Master Works]]'', a live concert DVD, later [[certified platinum]]. In 2006, the duo starred in their own motion-picture, ''[[Tenacious D in The Pick of Destiny]]'', and released the soundtrack as their second album, ''[[The Pick of Destiny]].'' The film was a box office failure and received mixed reviews, but its [[The Pick of Destiny Tour (2006–2007)|supporting tour]] was successful with performances at major arenas, such as [[Madison Square Garden]].\n\nFollowing years of sporadic festival dates and special appearances, the band released their third album, ''[[Rize of the Fenix]]'', in 2012, making light of ''The Pick of Destiny's'' commercial failure. In 2013, Tenacious D hosted the comedy music festival [[Festival Supreme]] in LA, which would host three more additions. In 2014, the band featured on ''[[Ronnie James Dio – This Is Your Life]]'', a compilation album to raise funds for cancer. Their cover of \"[[The Last in Line (song)|The Last in Line]]\" won the [[Grammy Awards|Grammy Award]] for best heavy metal performance at the [[57th Annual Grammy Awards]]. In 2018, the band began independently releasing an animated hand-drawn web series, ''[[Tenacious D in Post-Apocalypto]]'', and released the soundtrack as their fourth album ''[[Post-Apocalypto]]''. In July 2024, the band attracted headlines when they cancelled the remainder of their tour and put all creative work on hold following backlash from a controversial improvised joke from Gass about the [[attempted assassination of Donald Trump in Pennsylvania]] during a show in [[Sydney]].\n\nThe music of Tenacious D showcases Black's theatrical vocal delivery and Gass's acoustic guitar playing. Critics have described their fusion of vulgar absurdist comedy with [[rock music]] as \"mock rock\". Their songs discuss the duo's purported musical and sexual prowess, their friendship and [[cannabis (drug)|cannabis]] usage, in a style critics have compared with the storyteller-style lyrics of [[rock opera]].",
  "last_revision_date": "2025-09-20T03:48:15Z",
  "genres": [
    8,
    271,
    534,
    549
  ]
}