{
  "name": "Tenacious D",
  "description": "'''Tenacious D'''  is an American [[comedy rock]] duo formed in Los Angeles in 1994 by the actors [[Jack Black]] and [[Kyle Gass]]. Their music showcases Black's theatrical vocal delivery and Gass' acoustic guitar playing. Critics have described their fusion of vulgar absurdist comedy with [[rock music]] as \"mock rock\". Their songs discuss the duo's purported musical and sexual prowess, their friendship and [[cannabis (drug)|cannabis]] usage, in a style critics have compared with the storyteller-style lyrics of [[rock opera]].\n\nPrior to the release of the 2001 debut album [[Tenacious D (album)|''Tenacious D'']], the duo had a [[Tenacious D (TV series)|three-episode TV series]] released on [[HBO]] between 1997 and 2000. The series came about after they met [[David Cross]] on the LA music scene and Black featured in episodes of ''[[Mr. Show with Bob and David]]''.{{Clarify|reason=Did the show follow the intro or vice versa?|date=March 2024}} The band befriended the musician [[Dave Grohl]], which began a relationship between Grohl's band the [[Foo Fighters]] and Tenacious D. Towards the end of the 1990s, the duo supported large rock acts such as [[Weezer]], [[Pearl Jam]], [[Tool (band)|Tool]], and [[Beck]].\n\nIn 2000, they signed with [[Epic Records]] and the year after they released ''Tenacious D,'' their debut album featuring a full band, including Grohl. Their second single, \"[[Tribute (song)|Tribute]]\", achieved [[Cult following|cult status]], contributing to their popularity in the UK, Sweden and Australia. In 2003, the band released ''[[The Complete Master Works]]'', a concert DVD, which was [[certified platinum]]. In 2006, the duo starred in a film, ''[[Tenacious D in The Pick of Destiny]]'', and released the soundtrack as their second album, ''[[The Pick of Destiny]].'' The film was a box office failure and received mixed reviews, but the [[The Pick of Destiny Tour (2006–2007)|Pick of Destiny tour]] was successful, with performances at venues including [[Madison Square Garden]].\n\nFollowing years of sporadic festival dates and special appearances, the band released their third album, ''[[Rize of the Fenix]]'', in 2012, making light of ''The Pick of Destiny's'' commercial failure. In 2013, Tenacious D hosted the comedy music festival [[Festival Supreme]] in LA. In 2014, they featured on ''[[Ronnie James Dio – This Is Your Life]]'', a compilation album to raise funds for cancer. Their cover of \"[[The Last in Line (song)|The Last in Line]]\" won the [[Grammy Awards|Grammy Award]] for best heavy metal performance at the [[57th Annual Grammy Awards]]. In 2018, the band began independently releasing an animated hand-drawn web series, ''[[Tenacious D in Post-Apocalypto]]'', and released the album ''[[Post-Apocalypto]]''. In July 2024, Tenacious D cancelled the remainder of their world tour and put their work on hold after Gass made a controversial on-stage joke about the [[attempted assassination of Donald Trump in Pennsylvania]].",
  "last_revision_date": "2025-06-19T18:59:02Z",
  "genres": [
    8,
    528,
    269
  ]
}