{
  "name": "Teresa Teng",
  "description": "'''Teng Li-Chun''' ({{lang-zh|t=鄧麗君|s=|p=Dèng Lìjūn}}; 29 January 1953 – 8 May 1995), commonly known as '''Teresa Teng''', was a Taiwanese singer, television personality, musician, and philanthropist. Widely regarded as one of the most culturally significant figures in the [[Sinophone|Chinese-speaking world]] of the 20th century, she is considered to be one of the most successful and influential Asian musicians of all time. Her contributions to [[Chinese pop]] has given birth to the phrase, \"Wherever there are Chinese-speaking people, there is music of Teresa Teng.\" A [[polyglot]], Teng's music has transcended geographical, linguistic, and political boundaries across Asia for several decades.\n\nWith a career spanning almost 30 years, Teng established herself as a dominant and influential force in Asia throughout most of her career, particularly in [[East Asia|East]] and [[Southeast Asia]], and to some extent [[South Asia]]. Teng is credited as the [[Far East]]'s first pop superstar and a pioneer of modern [[C-pop|Chinese pop music]] — a major force in the development of the Chinese music industry by incorporating western and eastern styles into her music, replacing the mostly [[revolutionary song]]s then prevalent in mainland China and laying the foundation for modern Chinese popular music.\n\nTeng recorded more than 1,700 songs throughout her career, in her native language, [[Mandarin Chinese|Mandarin]], but also [[Hokkien]], [[Cantonese]], [[Shanghainese]], [[Japanese language|Japanese]], [[Indonesian language|Indonesian]], [[English language|English]], and [[Italian language|Italian]]. Teng is considered instrumental in bridging the political and cultural divides across Chinese-speaking regions. She was one of the first artists to connect Japan to East and Southeast Asia. In Taiwan, Teng rose to fame for entertaining the armed forces and singing patriotic songs that appealed to the people of the island. She was nicknamed \"the patriotic entertainer\" and \"the soldiers' sweetheart\". To date, Teng's songs have been covered by hundreds of artists worldwide.\n\nTeng has sold over 48 million albums, excluding sales in [[Mainland China]], according to the [[IFPI]]. In 1986, she was named by [[Time (magazine)|''Time'']] as one of the seven greatest female singers in the world. In 2009, in an online poll by a Chinese government web portal to celebrate the [[60th anniversary of the People's Republic of China]], Teng was deemed the most influential cultural figure in China since 1949 with 8.5 million votes. On the eve of [[International Women's Day]] in 2010, she was named the most influential woman in modern China in a poll conducted by various Chinese media outlets. Teng was inducted into the Popular Music Hall of Fame at the [[Masao Koga|Koga Masao]] Museum of Music in Tokyo in 2007, making her the only non-Japanese person to be inducted.",
  "last_revision_date": "2025-10-13T16:33:26Z",
  "genres": [
    188,
    289,
    319,
    352,
    409,
    561,
    618,
    625,
    660,
    932,
    1135
  ]
}