{
  "name": "The Strypes",
  "description": "'''The Strypes''' were a four-piece rock band from [[Cavan]], [[Ireland]], formed in 2010 consisting of Ross Farrelly (lead vocals/harmonica), Josh McClorey (lead guitar/vocals), Peter O'Hanlon (bass guitar/harmonica) and Evan Walsh (drums). The band played the local scene with various members switching parts as they searched for their sound. They drew inspiration from 1960s [[British blues boom|blues boom]] and 1970s [[Pub rock (United Kingdom)|pub rock]] bands such as [[Dr. Feelgood (band)|Dr. Feelgood]], [[Eddie and the Hot Rods]], [[The Rolling Stones]], [[The Yardbirds]], [[Lew Lewis]] and [[Rockpile]] as well as the original bluesmen and rock 'n' roll artists such as [[Chuck Berry]], [[Bo Diddley]], [[Howlin' Wolf]] and [[Little Walter]], among others.\n\nThe band, with a shared love of [[blues]] and [[rhythm and blues]] music, formed in the town of [[Cavan]], Ireland. After several months gigging around their hometown, the band began playing clubs and pubs around Ireland, playing sets mixing original material with rhythm and blues covers. Their performances became well received by crowds across Ireland and their reputation as a live act grew.\n\nThe band's debut EP ''Young, Gifted & Blue'' brought them surprise success and recognition in 2012, topping the iTunes Blues charts. After signing with [[Elton John]]'s record label, the band released their debut L.P ''[[Snapshot (The Strypes album)|Snapshot]]'' in 2013, bringing them to national fame.\n\nThe band became known for their live performances and supported artists like the [[Arctic Monkeys]], [[Johnny Marr]] and [[Paul Weller]] on tour.\n\nThe band followed up with the release of [[Little Victories (Strypes album)|''Little Victories'']], which received comparatively mixed reviews due to its more indie-rock style. They embarked on a world tour in support of the album.\n\nThe band released ''[[Spitting Image (album)|Spitting Image]]'' in 2017, which enjoyed rave reviews but relatively poor commercial success.\n\nThe band announced their split on social media in November 2018. Three of the former members remain musically active: McClorey as lead singer of Soft Launch, O'Hanlon as touring bassist for Lord Friday the 13th and Walsh as bassist and bandleader for The Savage Hearts.",
  "last_revision_date": "2025-10-19T04:14:01Z",
  "genres": [
    142,
    541,
    594,
    789,
    1000,
    1059
  ]
}