{
  "name": "The Jerks",
  "description": "'''The Jerks''' is a rock band from the [[Philippines]] formed in 1979, and perhaps, is the original [[alternative rock]] and [[blues]] [[musical ensemble|band]] in the country. The band has undergone a lot of member changes and notably a lot of the previous members of the band are now certified icons themselves in the music scene. Members like Chickoy Pura, Nitoy Adriano, [[Jun Lopito]], Angelo Villegas, and others have carved names in their respective niches. Other performers who have played with the Jerks are former [[Put3ska]] drummer Brutus Lacano as a session musician, and drummer Benjie Santos.\n\nDespite having been formed in 1979, they only released their debut record in 1994 entitled ''The Jerks Live'', released under [[Gary Granada|Gary Granada's]] Backdoor Records. It was recorded live at the legendary [[Mayric's]] bar and showcases the raw, passionate musicality of the band never before put into record. The Jerks also released a self-titled album in the late '90s.\n\nBy 1998, [[Star Music]] managed to convince the band to record a major label album called ''Haligi Ng Maynila'', produced by ABS-CBN's Gabby Lopez, which gave the band the opportunity to reach a wider audience. This paved the way to the band winning the 1998 NU Rock Award for Best Album and the 1998 Katha Award for Best Rock Song, \"Reklamo ng Reklamo\".\n\nOn October 29, 2004, the band celebrated their 25th Anniversary at 70s Bistro. Musicians like Bayang Barrios, Cooky Chua, Angelo & Mike Villegas, Jun Lopito, Tots Tolentino, Acoustic Jive will join the anniversary.\n\nThe Jerks still perform regularly around Manila in bars like My Brother's Mustache Folk Bar near Timog Avenue, The 70s Bistro, Tiendesitas and Route 196 along Katipunan Extension.\n\nIn June 2022, the band released a seven-inch extended play, \"The Jerks EP\". Featuring three songs that date back to 1981 that were only played on radio and never released on any format and a reissue of \"The Jerks Live\" album on vinyl.",
  "last_revision_date": "2025-10-31T17:05:50Z",
  "genres": [
    140,
    922,
    994
  ]
}