{
  "name": "The Pogues",
  "description": "'''The Pogues''' are an English  [[Celtic punk]] band{{efn|name=nationality}} founded in [[King's Cross, London]], in 1982, by [[Shane MacGowan]], [[Spider Stacy]] and [[Jem Finer]]. Originally named '''Pogue Mahone'''—an [[anglicisation]] of the [[Irish language|Irish]] phrase [[:wikt:póg mo thóin|''póg mo thóin'']], meaning \"kiss my arse\"—the band fused [[Irish traditional music]] with [[punk rock]] influences. Initially poorly received in traditional circles, they were later credited with reinvigorating the genre.\n\nAfter their founding, the Pogues added more members, including [[James Fearnley]] and [[Cait O'Riordan]], and built a reputation playing raucous live shows in London pubs and clubs. After opening for [[the Clash]] on their 1984 tour, they released their first studio album, ''[[Red Roses for Me]]'', featuring a mix of traditional Irish songs and original compositions by MacGowan. [[Elvis Costello]] produced their second album, ''[[Rum Sodomy & the Lash]]'' (1985), and the follow-up four-track EP ''[[Poguetry in Motion]]'' (1986). The Pogues collaborated with [[the Dubliners]] on a 1987 arrangement of the traditional folk song \"[[The Irish Rover]]\", which reached number one in Ireland and number eight in the UK. Later that year, they released the Christmas single \"[[Fairytale of New York]]\", which reached number one in Ireland and number two in the UK. Written by MacGowan and Finer and recorded as a duet with [[Kirsty MacColl]], it features on their critically acclaimed and commercially successful third studio album, ''[[If I Should Fall from Grace with God]]'' (1988). The Pogues recorded two more albums with MacGowan—[[Peace and Love (The Pogues album)|''Peace and Love'']] (1989) and ''[[Hell's Ditch]]'' (1990)—before sacking him during a 1991 tour as his drug and alcohol dependency increasingly affected their live performances. \n\nMacGowan went on to form a new band, [[Shane MacGowan and The Popes|Shane MacGowan and the Popes]], while the Pogues continued with [[Joe Strummer]] and then Stacy as frontmen, releasing new material on ''[[Waiting for Herb]]'' (1993). They broke up following the critical and commercial failure of their seventh and last studio album, ''[[Pogue Mahone]]'' (1996). The Pogues, again including MacGowan, re-formed in late 2001. Although they recorded no new studio material, they toured regularly in the UK and Ireland, also performing in the USA and mainland Europe. Following the death of longtime guitarist [[Philip Chevron]] in October 2013, the Pogues dissolved again in the summer of 2014. Longtime bassist [[Darryl Hunt (musician)|Darryl Hunt]] died in August 2022 and MacGowan died in November 2023. Surviving members Stacy, Finer and Fearnley re-formed the Pogues in 2024 and toured the UK, Ireland, and North America in 2025.",
  "last_revision_date": "2025-12-14T01:38:02Z",
  "genres": [
    440
  ]
}