{
  "name": "The Black Crowes",
  "description": "'''The Black Crowes''' are an American [[Rock music|rock]] band formed in [[Atlanta|Atlanta, Georgia]], in 1984. Their discography includes ten studio albums, four live albums and several charting singles. The band was signed to [[American Recordings (record label)|Def American Recordings]] in 1989 by producer George Drakoulias and released their debut album, ''[[Shake Your Money Maker (album)|Shake Your Money Maker]]'', the following year. Their follow-up, ''[[The Southern Harmony and Musical Companion]]'', reached the top of the [[Billboard 200|''Billboard'' 200]] in 1992.  The albums ''[[Amorica]]'' (1994), ''[[Three Snakes and One Charm]]'' (1996), ''[[By Your Side (The Black Crowes album)|By Your Side]]'' (1999), and ''[[Lions (album)|Lions]]'' (2001) followed, with each showing moderate popularity but failing to capture the chart successes of the band's first two albums.  After a hiatus from 2002 to 2005, the band regrouped and toured for several years before releasing ''[[Warpaint (The Black Crowes album)|Warpaint]]'' in 2008, which reached number 5 on the Billboard chart.\n\nFollowing the release of their greatest hits/acoustic double album ''[[Croweology]]'' in August 2010, the band started a 20th anniversary tour that was followed by a second hiatus. After touring in 2013, the band announced another breakup in 2015, reforming in late 2019 to announce a 2020 tour in support of the 30th anniversary of ''Shake Your Money Maker''. By this point the band had none of its original line-up left except for Chris and Rich Robinson, the only two constant members of the band over its entire history.\n\nAs of August 2023, the current lineup of the band includes the Robinson brothers, longtime bassist Sven Pipien, and new members Nico Bereciartua (lead guitar), Cully Symington (drums) and [[Erik Deutsch]] (keyboards). Their latest album, ''[[Happiness Bastards]]'', was released in March 2024 and nominated in the Best Rock Album Grammy later that year. In 2025, they were nominated for induction into the [[Rock and Roll Hall of Fame]] for the first time. \n\nThe Black Crowes have sold more than 30 million albums, and are listed at number 92 on [[VH1]]'s ''100 Greatest Artists of Hard Rock''. They were labeled by ''[[Melody Maker]]'' as \"The Most Rock 'n' Roll Rock 'n' Roll Band in the World\" and the readers of ''[[Rolling Stone]]'' voted them 'Best New American Band' in 1990.",
  "last_revision_date": "2026-01-09T21:19:57Z",
  "genres": [
    142,
    541,
    632,
    1071,
    1159
  ]
}