{
  "name": "The Angels",
  "description": "'''The Angels''' are an Australian [[rock music|rock]] band that formed in 1974 in [[Adelaide]] as '''the Keystone Angels''' with [[Doc Neeson|Bernard \"Doc\" Neeson]] on lead vocals and bass guitar, [[John Brewster (musician)|John Brewster]] on [[rhythm guitar]] and vocals, his brother [[Richard Brewster|Rick Brewster]] on lead guitar and backing vocals, and Peter \"Charlie\" King on drums. In 1976, King was replaced by [[Graham Bidstrup|Graham \"Buzz\" Bidstrup]] on drums, [[Chris Bailey (musician, born 1950)|Chris Bailey]] took over bass duties so Neeson could focus solely on vocals, and they changed their name to just 'the Angels'. Their studio albums that peaked in the Australian top&nbsp;10 are ''[[No Exit (The Angels album)|No Exit]]'' (1979), ''[[Dark Room (The Angels album)|Dark Room]]'' (1980), ''[[Night Attack (album)|Night Attack]]'' (1981), ''[[Two Minute Warning (album)|Two Minute Warning]]'' (1984), ''[[Howling (The Angels album)|Howling]]'' (1986) and ''[[Beyond Salvation]]'' (1990). Their top&nbsp;20 singles are \"[[No Secrets (The Angels song)|No Secrets]]\" (1980), \"[[Into the Heat (The Angels song)|Into the Heat]]\" (1981), \"[[We Gotta Get Out of This Place#Other versions|We Gotta Get Out of This Place]]\" (1987), \"[[Am I Ever Gonna See Your Face Again]]\" (live, 1988), \"[[Let the Night Roll On]]\" and \"[[Dogs Are Talking]]\" (both 1990).\n\nTo avoid legal problems with similarly named acts in the international market, their records have been released under the names '''Angel City''' and later '''the Angels from Angel City''', although the group has said numerous times that they dislike these names. Bands that have cited the Angels as having influenced their music include [[Guns N' Roses]] and [[Cheap Trick]], who became friends and touring buddies, [[Great White]], who have covered two of their songs, and [[Seattle]] [[grunge]] band [[Pearl Jam]], among many others. Neeson left the group in 1999 due to spinal injuries sustained in a car accident and they disbanded the following year. Competing versions of the group subsequently performed using the Angels name, until April 2008 when the original 1970s line-up reformed for a series of tours until 2011, when Neeson and Bidstrup left again. Alternative versions continued with new members, with the current line-up featuring the founding Brewster brothers, John Brewster's sons Sam (bass) and Tom (drums) and lead vocalist Nick Norton.\n\nThe Angels were inducted into the [[ARIA Hall of Fame]] in October 1998 with the line-up of Bailey, John and Rick Brewster, Eccles and Neeson. Australian musicologist [[Ian McFarlane]] declared that \"The Angels had a profound effect on the Australian live music scene of the late 1970s/early 1980s. [They] helped redefine the Australian pub rock tradition... [their] brand of no-frills, hard-driving [[boogie rock]] attracted pub goers in unprecedented numbers. In turn, The Angels' shows raised the standard expected of live music. After 20 years on the road, the band showed little sign of easing up on the hard rock fever.\" Chris Bailey died of [[Head and neck cancer|throat cancer]] on 4 April 2013, aged 62. Doc Neeson died of a [[Glioblastoma|brain tumour]] on 4 June 2014, aged 67.",
  "last_revision_date": "2025-10-15T11:38:13Z",
  "genres": [
    532,
    981
  ]
}