{
  "name": "The Byrds",
  "description": "'''The Byrds''' ({{IPAc-en|b|ɜːr|d|z}} {{respell|BURDZ}}) were an American rock band formed in Los Angeles, California, in 1964. The band underwent multiple lineup changes; frontman [[Roger McGuinn]] (known as Jim McGuinn until mid-1967) was the sole consistent member. For a short time in the mid-1960s, the Byrds were among the most popular groups in the world, with critics considering them to be among the most influential rock acts of their era. The band's signature sound of \"angelic harmonies\" and McGuinn's [[jangle|jangly]] [[Twelve-string guitar|12-string]] [[Rickenbacker]] guitar sound was \"absorbed into the vocabulary of rock\" and has continued to be influential. \n\nInitially, the Byrds pioneered the musical genre of [[folk rock]] as a popular format in 1965 by melding the influence of [[the Beatles]] and other [[British Invasion]] bands with contemporary and traditional [[folk music]] on their [[Mr. Tambourine Man (album)|first]] and [[Turn! Turn! Turn! (album)|second]] albums and the hit singles \"[[Turn! Turn! Turn!]]\" and \"[[Mr. Tambourine Man]]\".  As the 1960s progressed, the band was influential in originating [[psychedelic rock]] and [[raga rock]], with their song \"[[Eight Miles High]]\" (1966) and the albums ''[[Fifth Dimension (album)|Fifth Dimension]]'' (1966), ''[[Younger Than Yesterday]]'' (1967), and ''[[The Notorious Byrd Brothers]]'' (1968). The band also helped pioneer [[country rock]], particularly with the 1968 album ''[[Sweetheart of the Rodeo]]''.\n\nThe band's original five-piece lineup consisted of McGuinn (lead guitar, vocals), [[Gene Clark]] (tambourine, vocals), [[David Crosby]] (rhythm guitar, vocals), [[Michael Clarke (musician)|Michael Clarke]] (drums), and [[Chris Hillman]] (bass guitar, vocals). In early 1966, Clark left due to anxiety and his increasing isolation within the group. The Byrds continued as a quartet until late 1967, when Crosby and Clarke departed. McGuinn and Hillman recruited new members, including country rock pioneer [[Gram Parsons]], but by late 1968, Hillman and Parsons had also left the band. McGuinn rebuilt a new version of the Byrds that featured guitarist [[Clarence White]] among others. McGuinn disbanded that iteration of the band in early 1973 to make way for a reunion of the original quintet. The Byrds released their final album in March 1973, with the reunited group disbanding later that year.\n\nSeveral members of the Byrds went on to successful careers as solo artists or as members of such groups as [[Crosby, Stills, Nash & Young]], [[the Flying Burrito Brothers]], [[McGuinn, Clark & Hillman]], and [[the Desert Rose Band]]. In 1991, the Byrds were inducted into the [[Rock and Roll Hall of Fame]] in a ceremony that saw the five original members perform together for the last time. Gene Clark died of a heart attack later that year, while Michael Clarke died of [[liver failure]] in 1993. Crosby died in 2023. McGuinn and Hillman remain musically active.",
  "last_revision_date": "2025-11-02T22:43:56Z",
  "genres": [
    292,
    439,
    623,
    1005
  ]
}