{
  "name": "The Easybeats",
  "description": "'''The Easybeats''' were an Australian [[Rock music|rock]] band that formed in [[Sydney]] in late 1964. They are best known for their 1966 hit single \"[[Friday on My Mind]]\", which is regarded as the first Australian rock song to achieve international success; ''[[Rolling Stone]]'' described it as \"the first international victory for [[Oz rock]]\". One of the most popular and successful bands in the country, they were one of the few Australian bands of their time to foreground their original material; their first album ''[[Easy (Easybeats album)|Easy]]'' (1965) was one of the earliest Australian rock albums featuring all original songs.\n\nThe five founding members, all migrants from Europe, met at the [[Villawood Immigration Detention Centre|Villawood Migrant Hostel]] in Sydney in 1964. They rose to national prominence in 1965 with the song \"[[She's So Fine]]\", which reached No. 3 in Australia. Their concerts and public appearances were marked by an intense [[fanaticism]] frequently compared to [[Beatlemania]]; this phenomenon was subsequently dubbed \"Easyfever\". They relocated to the UK in 1966, where they recorded \"Friday on My Mind\". Following its success, the band struggled to maintain international recognition. Compounded by financial and contractual issues, drug use and the increasing independence of guitarists and songwriters [[Harry Vanda]] and [[George Young (rock musician)|George Young]], they returned to Australia in 1969 amid declining popularity back home and subsequently disbanded.\n\nLead singer [[Stevie Wright]] started a solo career and had a No. 1 Australian hit with \"[[Evie (song)|Evie]]\" in 1974; he died in 2015 after lengthy battles with drugs and alcohol and years of poor health. Guitarists Vanda and Young continued as a [[Vanda & Young|songwriting and producing duo]] and produced several albums by [[AC/DC]]; Young died in 2017. During their six-year run, they scored 15 top 40 hits in Australia, including \"She's So Fine\" and \"[[Women (Make You Feel Alright)]]\", with No. 1 hits including \"Friday on My Mind\" and \"[[Sorry (Easybeats song)|Sorry]]\". They reunited for a tour in 1986. In 2005, they were inducted into the [[ARIA Hall of Fame]].",
  "last_revision_date": "2025-11-11T02:15:40Z",
  "genres": [
    455,
    950,
    1062
  ]
}