{
  "name": "The Beautiful Girls",
  "description": "'''The Beautiful Girls''' are an Australian [[Traditional music|roots music]] group founded in Sydney in 2001 by Mat McHugh, Clay MacDonald, and Mitchell Connelly. They have released three extended plays, ''[[Morning Sun (EP)|Morning Sun]]'' (2002), ''[[Goodtimes]]'' (2002), and ''[[The Weight of the World (The Beautiful Girls album)|The Weight of the World]]'' (2004), plus five studio albums, ''[[Learn Yourself]]'' (2003), ''[[We're Already Gone]]'' (2005), ''[[Ziggurats (album)|Ziggurats]]'' (2007), ''[[Spooks (album)|Spooks]]'' (2010), and ''[[Dancehall Days (album)|Dancehall Days]]'' (2014). The last four albums have all peaked into the top&nbsp;20 on the [[ARIA Charts|ARIA Albums Chart]]. ''Spooks'' and ''Dancehall Days'' also debuted at No.&nbsp;1 on the Australian Independent Chart and No.&nbsp;7&5 on the American ''[[Billboard (magazine)|Billboard]] '' Reggae Albums Chart, respectively. Their single \"I Thought About You\" reached No.&nbsp;60 on the ARIA Singles Chart.\n\nSongwriter/producer/multi-instrumentalist Mat McHugh has issued two solo albums, ''Seperatista!'' (2008) and ''Love Come Save Me'' (2012), as well as an EP, ''Go Don't Stop'' (2011).\n\nClay MacDonald fronts multiple bands, including The Orange Bird, The Lung, The Guilty Conscience, The Oort Cloud, and Hungdonkey. He also plays in fuzz rock group Valley Floor.\n\nMitchell Connelly has written and recorded under the name aliTTLErowBOAT.\n\nMacDonald and Connelly write and record instrumental hip-hop under the name The Undertones. They also have a noise rock band named Salmon Facade. The pair provided the rhythm section on [[Angus & Julia Stone]]'s first two EPs and first two albums, and toured extensively with the siblings from 2007 to 2009.\n\nBy 2014, The Beautiful Girls had toured the world multiple times – including Japan, Canada, Brazil, and the United States – and their total album sales had reached 350,000.",
  "last_revision_date": "2025-06-13T05:09:33Z",
  "genres": [
    42,
    368,
    437,
    926,
    1017
  ]
}