{
  "name": "The Telescopes",
  "description": "'''The Telescopes''' are an English [[noise rock|noise]], [[space rock]], [[dream pop]] and [[psychedelic rock|psychedelic]] band formed in 1987 by artist, composer, and musician Stephen Lawrie, with band members David Fitzgerald and Joanna Doran joining later. The band's line-up is in constant flux; there can be anywhere between 1 and 20 members on a recording.\n\nSome of the initial influences on Lawrie as a songwriter were [[The Beatles]], [[Bob Dylan]], [[David Bowie]], [[Neil Young]], [[Einstürzende Neubauten]], [[Can (band)|Can]], [[Faust (band)|Faust]], [[Lydia Lunch]], [[Sonic Youth]] and [[Sun Ra]]. By the time The Telescopes were formed, influences were drawn from artists such as [[The Velvet Underground]], [[Suicide (band)|Suicide]], [[The Stooges]] and [[The 13th Floor Elevators]].\n\nThe Telescopes have influenced the [[shoegaze]], [[space rock]] and [[Neo-psychedelia|neo-psychedelic]] movement including artists such as [[The Brian Jonestown Massacre]], [[Black Rebel Motorcycle Club]], [[Füxa]], [[The Warlocks]], [[Revolver (British band)|Revolver]], [[Whipping Boy (Irish band)|Whipping Boy]], Vanishing Lines, [[Seefeel]], [[The Ecstasy of Saint Theresa|Ecstasy of Saint Theresa]], [[Frances Bean Cobain]], [[Portishead (band)|Portishead]], [[Mogwai]] and [[Radiohead]].\n\nIn recognition of their ongoing influence on a new generation of artists, a tribute compilation titled ''Anticipating Nowhere, A Homage To The Telescopes'' was released in 2016 by The Blog That Celebrates Itself Records. The album featured 17 Telescopes tracks covered by various artists from the Flavor Crystals, Jaguwar and [[One Unique Signal]].{{fact|date=November 2024}}\n\nThe Telescopes have been described by the British music press as \"more a revolution of the psyche than a revolution of the sidewalk\"; a thread consistent throughout a body of work spanning over 30 years.\n\nThe band has released 16 studio albums across various music labels including but not limited to [[Creation Records]] and [[Tapete Records]] with their most recent album ''Growing Eyes Become String'' out now on Fuzz Club Records. A new album is currently{{when?|date=November 2024}} being recorded for Tapete.{{fact|date=November 2024}}\n\nAs a live band, they are considered to be unique even in their niche, with positive reviews from publications such as Isolation (UK),  \"The Telescopes are such an important band. Such an important concept. They walk where other bands fear to tread and refuse to compromise their art. This is what makes them so vital on record and unmissable on stage.\"\n\nOriginal guitarist David Fitzgerald died of cancer on 17 December 2020, aged 54. In a statement provided to [[NME]], Lawrie wrote, \"As a noise guitarist David was born beyond the realm of natural vision, a true original, in a field of his own.\"",
  "last_revision_date": "2025-10-13T03:30:21Z",
  "genres": [
    42,
    48,
    77,
    367,
    368,
    374,
    410,
    412,
    418,
    430,
    458,
    594,
    637,
    827,
    871,
    995,
    1126,
    1166
  ]
}