{
  "description": "'''The Osmonds''' were an American family music group who reached the height of their fame in the early to mid-1970s. The group had its best-known configurations as a quartet (billed the '''Osmond Brothers''') and a quintet (the Osmonds). The group has consisted of siblings who are all members of a family of musicians from [[Ogden, Utah]], and have been in the public eye since the 1960s.\n\nThe Osmond Brothers began as a [[barbershop quartet]] consisting of brothers [[Alan Osmond|Alan]], [[Wayne Osmond|Wayne]], [[Merrill Osmond|Merrill]] and [[Jay Osmond|Jay]]. They were later joined by younger siblings [[Donny Osmond|Donny]] and [[Jimmy Osmond|Jimmy]], both of whom enjoyed success as solo artists. With the addition of Donny, the group became known as the Osmonds; performing both as [[teen idol]]s and as a [[rock music|rock]] band, their peak lasted from 1971 to 1975. Their only sister [[Marie Osmond|Marie]], who rarely sang with her brothers at that time, launched a successful career in 1973, both as a solo artist and as Donny's duet partner. By 1976, the band was no longer producing hit singles; that year, they transitioned into television with ''[[Donny & Marie (1976 TV series)|Donny & Marie]]'', a popular [[variety show]] that ran until 1979.\n\nA revival of the original Osmond Brothers lineup in the 1980s achieved moderate success in [[country music]], and both Donny and Marie separately made comebacks in their respective fields in the late-1980s. The Osmonds have sold over 77 million records worldwide.\n\nThe quartet continued to perform through their 50th anniversary in 2007, at which point Alan and later Wayne retired due to health issues; Jimmy was recruited after Alan's retirement, with the group performing as a trio until Jimmy suffered a stroke and retired in 2018. On 14 October 2019, the original Osmond Brothers quartet reunited for [[CBS]]' [[The Talk (talk show)|''The Talk'']] for their sister [[Marie Osmond|Marie]]'s 60th birthday, which would be the last appearance for the lineup before Wayne's death in 2025. The brothers performed \"The Last Chapter\", written as a farewell song and introduced in 2018. Donny & Marie ended an 11-year [[Las Vegas]] residency on November 16, 2019. Merrill announced his retirement in 2022 to pursue a church mission, leaving Jay as the last remaining member of the original quartet still performing (Donny continues to perform as a solo artist as well). In later years, Alan's sons, particularly Nathan and David, and Merrill's son Travis have made appearances with their uncles.",
  "last_revision_date": "2025-05-28T02:58:22Z"
}