{
  "name": "The Holy Modal Rounders",
  "description": "'''The Holy Modal Rounders''' was an American [[folk music]] group, originally a duo (members [[Peter Stampfel]] and [[Steve Weber]]) who formed in 1963 on the [[Lower East Side]] of Manhattan. Although they achieved only limited commercial and critical success in the 1960s and 1970s, they earned a dedicated cult following and have been retrospectively praised for their reworking of early 20th century folk music as well as their innovation in several genres, including [[freak folk]] and [[psychedelic folk]]. With a career spanning 40 years, the Holy Modal Rounders were influential both in the New York scene where they began and to subsequent generations of underground musicians.\n\nAs the Holy Modal Rounders, Stampfel and Weber began playing in and around the [[Greenwich Village]] scene, at the heart of the ongoing [[American folk music revival]]. Their sense of humor, irreverent attitude, and novel update of [[old-time music]] brought support from fellow musicians but was controversial amongst some folk traditionalists. In 1964, the Rounders released their [[The Holy Modal Rounders (album)|self-titled debut]], which included the first use of the word \"psychedelic\" in popular music. After their first two studio albums, the duo briefly joined the newly formed underground rock band [[the Fugs]] in 1965 and helped record the band's influential [[The Fugs First Album|debut album]].\n\nFollowing their exit from the Fugs, the duo released two albums that experimented with [[psychedelic folk]] before they expanded their lineup to a full rock band by the end of 1968. The Holy Modal Rounders' expanded lineup included playwright [[Sam Shepard]] as a drummer and many short-lived members before it stabilized in 1971 with keyboardist Richard Tyler, multi-instrumentalist Robin Remaily, bassist Dave Reisch, drummer Roger North, and saxophonist Ted Deane. Beginning in 1975, this backing group would also play with [[Jeffrey Frederick]] as the [[Clamtones]]. In 1972, Weber and the band relocated to [[Portland, Oregon]], while Stampfel stayed behind in New York. Although Stampfel would describe Weber as his \"long lost brother\", they often had a hostile relationship and the two would only reunite sporadically during the next twenty years. After Weber returned to the East Coast in the mid-1990s, the duo began a series of concert reunions starting in 1996 before breaking up for the last time in 2003.",
  "last_revision_date": "2025-12-12T17:02:42Z",
  "genres": [
    441,
    888,
    981,
    982
  ]
}