{
  "name": "The Kinks",
  "description": "'''The Kinks''' were an English rock band formed in London in 1962. The band's original line-up comprised brothers [[Ray Davies]] (lead vocals, rhythm guitar) and [[Dave Davies]] (lead guitar, vocals), [[Pete Quaife]] (bass), and [[Mick Avory]] (drums, percussion). Emerging during the height of [[British rhythm and blues]] and [[Merseybeat]], their breakthrough third single, the Ray Davies-penned \"[[You Really Got Me]]\" (1964), became an international hit, topping the charts in the United Kingdom and reaching the Top 10 in the United States. Other early hits included \"[[All Day and All of the Night]]\" (1964), \"[[Tired of Waiting for You]]\", \"[[Set Me Free (The Kinks song)|Set Me Free]]\", \"[[See My Friends]]\", and \"[[Till the End of the Day]]\" (all 1965). They were part of the [[British Invasion]] of America until several problems during [[The Kinks' 1965 US tour|their 1965 American tour]] led to them being banned from touring there for a number of years.\n\nThe Kinks' music drew from a wide range of influences, including [[Rhythm and blues|American R&B]] and [[rock and roll]] initially, and later adopting British [[music hall]], [[Folk music|folk]], and [[country music|country]]. Beginning with the late 1965  ''[[Kwyet Kinks]]'' EP, the band gained a reputation for reflecting English culture and lifestyle, fuelled by Ray Davies's observational and satirical lyricism, and made apparent in albums such as ''[[Face to Face (The Kinks album)|Face to Face]]'' (1966), ''[[Something Else by the Kinks]]'' (1967), ''[[The Kinks Are the Village Green Preservation Society]]'' (1968), ''[[Arthur (Or the Decline and Fall of the British Empire)]]'' (1969), ''[[Lola Versus Powerman and the Moneygoround, Part One]]'' (1970), and ''[[Muswell Hillbillies]]'' (1971), along with their hit singles during this period, including \"[[Dedicated Follower of Fashion]]\", \"[[Sunny Afternoon]]\", \"[[Dead End Street (song)|Dead End Street]]\" (all 1966), \"[[Waterloo Sunset]]\", \"[[Autumn Almanac]]\" (both 1967), \"[[Days (The Kinks song)|Days]]\" (1968), and \"[[Lola (song)|Lola]]\" (1970). After a fallow period in the mid-1970s, the band experienced a revival with their albums ''[[Sleepwalker (The Kinks album)|Sleepwalker]]'' (1977), ''[[Misfits (The Kinks album)|Misfits]]'' (1978), ''[[Low Budget (album)|Low Budget]]'' (1979), ''[[Give the People What They Want (The Kinks album)|Give the People What They Want]]'' (1981), and ''[[State of Confusion]]'' (1983), the last of which produced one of the band's most successful US hits, \"[[Come Dancing (song)|Come Dancing]]\".\n\nThe Davies brothers remained with the band throughout its history. Quaife briefly left the band in 1966 and was replaced by [[John Dalton (musician)|John Dalton]], though Quaife returned by the end of that year before leaving permanently in 1969, once again being replaced by Dalton. Keyboardist [[John Gosling (The Kinks musician)|John Gosling]] was added in 1970, with this line-up remaining in place until Dalton's 1976 departure. After several changes during the late 1970s, the line-up stabilised in 1979 with the Davies brothers, Avory, bassist [[Jim Rodford]], and keyboardist [[Ian Gibbons (musician)|Ian Gibbons]]. Avory left in 1984, after which the band underwent a few more personnel changes before giving their last public performance in 1996 and breaking up in 1997 as a result of creative tension between the Davies brothers.\n\nThe Kinks are regarded as one of the most influential rock bands of the 1960s. They have had seventeen Top 20 singles and five Top 10 albums in the UK, and five of their singles reached the Top 10 on the US [[Billboard Hot 100|''Billboard'' Hot 100]] chart. Additionally, nine of their albums charted in the [[Top 40]] of the US [[Billboard 200|''Billboard'' 200]]. Four Kinks albums have been certified [[RIAA certification|Gold]] by the [[Recording Industry Association of America]] (RIAA), and the band has sold over 50 million records worldwide. Among numerous honours, they received the [[Ivor Novello Award]] for \"Outstanding Service to British Music\". In 1990, the original four members of the Kinks were inducted into the [[Rock and Roll Hall of Fame]], as well as the UK Music Hall of Fame in 2005. In addition, groups such as [[Van Halen]], [[the Jam]], [[the Knack]], [[the Pretenders]], [[Green Day]], [[Queens of the Stone Age]] and [[the Romantics]] covered their songs, helping to boost the Kinks' record sales. In the 1990s, [[Britpop]] acts such as [[Blur (band)|Blur]] and [[Oasis (band)|Oasis]] cited the band as a major influence.",
  "last_revision_date": "2026-01-29T08:57:52Z",
  "genres": [
    112,
    801,
    949,
    1061
  ]
}