{
  "name": "The Word",
  "description": "'''The Word''' is an American [[instrumental rock|instrumental]]/[[Sacred Steel (musical tradition)|sacred steel]]/[[gospel blues]] [[jam band]]. The [[Supergroup (music)|supergroup]] includes well-known musicians: [[Robert Randolph (guitarist)|Robert Randolph]] ([[pedal steel guitar]]), [[John Medeski]] ([[Keyboard instrument|keyboards]]), both members of [[North Mississippi Allstars]]- [[Luther Dickinson]] ([[electric guitar]]), Cody Dickinson ([[Drum kit|drums]], [[washboard (musical instrument)|washboard]]), and ex-North Mississippi Allstars bassist Chris Chew.\n\nThe Word developed from a mutual affection for [[gospel music]] and the Sacred Steel tradition shared by Medeski and members of the North Mississippi Allstars, both having discovered the phenomenon through a series of albums published by [[Arhoolie Records]] in the 1990s and early 2000s. Chris Chew and Luther Dickinson were particularly fond of a song called \"Without God\" on the Sacred Steel Live! album, the only track credited to a then-unknown Robert Randolph. They contacted Randolph and recruited him to form their own Sacred Steel band, likely the first initiated by musicians outside the House of God church organization.\n\nMusically, The Word is similar to other sacred steel bands, with the major difference being a total lack of vocals, both gospel singing and sing-song preaching that often accompanies such music in the original church setting. The organ and electric piano content, provided by Medeski, is more experimental and pronounced than in traditional sacred steel music, which originally developed from House of God churches filling the role of a pipe organ with the much less expensive steel guitar. Another unusual aspect of the music is that drummer Cody Dickinson plays electric washboard on certain songs, as he sometimes does with the North Mississippi Allstars. During live concerts, there is typically only one vocal microphone, used by Randolph to address the audience with encouragement and occasional exclamations of spiritual praise between songs. However, there is at least one example of bassist Chris Chew singing the lyrics to a traditional gospel song played by The Word, on January 1, 2010, in [[Fort Lauderdale, Florida]].\n\nTheir debut [[The Word (album)|self-titled album]], produced by Medeski and released on [[Ropeadope Records]] July 31, 2001, includes an updated version of \"Without God\", the song that brought The Word together in the first place. The album contains a mixture of traditional gospel songs (played with instrumental arrangements) and original instrumentals written by the group. The group toured in 2002 and then reunited to tour again in late 2007/early 2008. The group also played at the [[Bonnaroo]] festival in 2005 and 2012, and on the Jam Cruise in 2010. The group performed live on [[Conan (talk show)|Conan]] on May 11, 2015, and toured the United States that summer and fall. The band played at Australia's premier roots music festival, [[Bluesfest Byron Bay]] over Easter 2016.",
  "last_revision_date": "2025-04-13T10:54:26Z",
  "genres": [
    141,
    504,
    597,
    618,
    624,
    1132
  ]
}