{
  "name": "The Lords of the New Church",
  "description": "'''The Lords of the New Church''' were a British-American [[rock music|rock]] band. A [[Supergroup (music)|supergroup]], the line-up originally consisted of four musicians from 1970s [[punk rock|punk]] bands. This line-up comprised vocalist [[Stiv Bators]] (ex-[[the Dead Boys]]), guitarist [[Brian James (guitarist)|Brian James]] (ex-[[The Damned (band)|the Damned]]), bassist Dave Tregunna (ex-[[Sham 69]]) and drummer [[Nick Turner]] (ex-[[the Barracudas]]). Launched in 1981, the band released three studio albums prior to their dissolution in 1989. During this time, they underwent several line-up changes.\n\nMore melodic and slickly produced than most punk, their music both reached a broader audience than that of many bands in the genre and alienated hardcore punk fans. The band presented a stylized tribal identity around their appearance and their music that fans embraced: the writer [[Dave Thompson (author)|Dave Thompson]] asserts this represented \"the first time since the Sex Pistols' Bromley Contingent fanbase [that] a band had succeeded in grafting its own identity onto its audience without first paying obeisance to the gods of highstreet fashion.\" Their stage antics became notorious early in their career, with Bators stunts on one occasion reportedly resulting in his clinical death for several minutes.\n\nThe band experienced moderate chart success, with their [[The Lords of the New Church (album)|eponymous debut album]] peaking at No. 3 on the [[UK Indie Chart]], 1984's ''[[The Method to Our Madness]]'' hitting No. 158 in the US, and the 1985 ''[[Killer Lords]]'' compilation reaching No. 22 on the UK Indie Chart. Charting singles included \"New Church\" (No. 34 UK Indie), \"Open Your Eyes\" (No. 7 UK Indie; No. 27 [[Mainstream Rock (chart)|US Mainstream Rock]]), \"Dance with Me\" (No. 85 [[UK Singles Chart]]) and a cover of [[Madonna (entertainer)|Madonna]]'s \"[[Like a Virgin (song)|Like a Virgin]]\" (No. 22 UK Indie).\n\nThe band was re-established between 2001–2003, and again briefly in 2007, with original members James and Tregunna. The band reunited for a final time, prior to James’ death, with ex-[[Hanoi Rocks]] singer [[Michael Monroe]], at the behest of ''Vive Le Rock'' magazine, at their annual awards show at London's Shepherds Bush Empire on 6 April 2023. Former Clash, Hanoi Rocks and original Lords drummer Terry Chimes took Turner's place, except for 'New Rose', played by [[Rat Scabies]], who'd just presented James with the Pioneer Award.",
  "last_revision_date": "2025-08-21T18:23:36Z",
  "genres": [
    495,
    510,
    942,
    982
  ]
}