{
  "name": "The Cult",
  "description": "'''The Cult''' are  an English [[Rock music|rock]] band formed in [[Bradford]] in 1983. Before settling on their current name in January 1984, the band had performed under the name '''Death Cult''', which was an evolution of the name of lead vocalist [[Ian Astbury]]'s previous band [[Southern Death Cult]]. They gained a dedicated following in the United Kingdom in the mid-1980s as a [[post-punk]] and [[gothic rock]] band, with singles such as \"[[She Sells Sanctuary]]\", before breaking into the mainstream in the United States in the late 1980s establishing themselves as a [[hard rock]] band with singles such as \"[[Love Removal Machine]]\". Since its initial formation in 1983, the band have had various line-ups: the longest-serving members are Astbury and guitarist [[Billy Duffy]], who are also their two main songwriters.\n\nThe Cult's debut studio album ''[[Dreamtime (The Cult album)|Dreamtime]]'' was released in 1984 to moderate success, with its lead single \"[[Spiritwalker]]\" reaching No.&nbsp;1 on the [[UK Independent Singles and Albums Charts|UK Indie Chart]]. Their second studio album, ''[[Love (The Cult album)|Love]]'' (1985), was also successful, charting at No.&nbsp;4 in the UK and including singles such as \"She Sells Sanctuary\" and \"[[Rain (The Cult song)|Rain]]\". The band's third studio album, ''[[Electric (The Cult album)|Electric]]'' (1987), launched them to new heights of success, also peaking at No.&nbsp;4 in the UK and charting highly in other territories, and spawned the hit singles \"Love Removal Machine\", \"Lil' Devil\" and \"Wild Flower\". On that album, the Cult supplemented their post-punk sound with hard rock; the polish on this new sound was facilitated by producer [[Rick Rubin]]. After moving to [[Los Angeles]], where the band have been based for the remainder of their career, the Cult continued the musical experimentation of ''Electric'' with its follow-up studio album ''[[Sonic Temple]]'' (1989), which marked their first collaboration with [[Bob Rock]], who would produce several of the band's subsequent studio albums. ''Sonic Temple'' was their most successful studio album to that point, entering the Top 10 on the UK and US charts, and included one of the band's most popular songs \"[[Fire Woman]]\".\n\nBy the time of their fifth studio album ''[[Ceremony (The Cult album)|Ceremony]]'' (1991), tensions and creative differences began to surface between the band members. This resulted in the recording sessions for ''Ceremony'' being held without a stable line-up, leaving Astbury and Duffy as the only two official members, and featuring support from session musicians on bass guitar and drums. The ongoing tension had carried over within the next few years, during which one more studio album, ''[[The Cult (album)|The Cult]]'' (1994), was recorded. After their first break-up in 1995, the Cult reformed in 1999 and released their seventh studio album ''[[Beyond Good and Evil (album)|Beyond Good and Evil]]'' two years later. The commercial failure of the album and resurfaced tensions led to the band's second dissolution in 2002. The Cult reunited once again in 2006, and have since released four more studio albums: ''[[Born into This]]'' (2007), ''[[Choice of Weapon]]'' (2012), ''[[Hidden City (album)|Hidden City]]'' (2016) and ''[[Under the Midnight Sun]]'' (2022).",
  "last_revision_date": "2025-07-17T02:43:22Z",
  "genres": [
    40,
    542,
    528,
    505,
    935
  ]
}