{
  "name": "The Wiggles",
  "description": "'''The Wiggles''' are an Australian [[children's music]] group formed in [[Sydney]] in 1991. As of 2022, the group members are [[Anthony Field]], [[Lachlan Gillespie]], [[Simon Pryce]], [[Tsehay Hawkins]], [[Evie Ferris]], [[John Pearce (entertainer)|John Pearce]], [[Caterina Mete]] and Lucia Field. The Wiggles were founded in 1991 by Anthony Field, [[Murray Cook]], [[Jeff Fatt]], [[Greg Page (musician)|Greg Page]] and [[Phillip Wilcher]]. Wilcher left the group after [[The Wiggles (album)|their first album]]. Page retired in 2006 due to ill health and was replaced by understudy [[Sam Moran]], but returned in 2012, replacing Moran. At the end of 2012, Cook, Fatt and Page retired and were replaced by Gillespie, Pryce and [[Emma Watkins]]. Cook and Fatt retained their shareholding in the group and all three continued to have input into its creative and production aspects, while engaging in occasional reunion performances. Watkins departed the group in 2021, with the group subsequently adopting an expanded line-up of eight members.\n\nField and Fatt were members of the Australian pop band [[the Cockroaches]] in the 1980s, and Cook was a member of several bands before meeting Field and Page at [[Macquarie University]], where they were studying to become pre-school teachers. In 1991, Field was inspired to create an album of children's music based upon concepts of early childhood education, and he enlisted Cook, Page, and Fatt to assist him. They began touring to promote the album and became so successful, they quit their teaching jobs to perform full-time. The group augmented their act with [[The Wiggles characters|costumed characters]] Dorothy the Dinosaur, Henry the Octopus and Wags the Dog, as well as the human character Captain Feathersword, played by [[Paul Paddick]] since 1993. Shirley Shawn the Unicorn was later introduced. They originally travelled with a small group of dancers, which later grew into a larger troupe. The group's albums, DVDs and television programs have been produced independently since their inception. The height of their popularity came in the early 2000s, after they broke into the American market.\n\nThe group were formally [[Consolidation (business)|consolidated]] in 2005. They were listed at the top of ''[[Business Review Weekly]]''{{'}}s top-earning Australian entertainers four years in a row and earned [[Australian dollar|A$]]45&nbsp;million in 2009. The Wiggles have enjoyed almost universal approval throughout their history, and their music has been played in pre-schools all over the world. They have earned multiple Gold, Platinum and double Platinum records; have sold 23&nbsp;million DVDs and 7&nbsp;million CDs; and have performed, on average, to one million people per year. The band has earned multiple [[APRA Awards (Australia)|Australasian Performing Right Association (APRA)]] and [[ARIA Music Awards|Australian Recording Industry Association (ARIA) Music Awards]], and they have been inducted into the [[ARIA Hall of Fame]].",
  "last_revision_date": "2025-12-19T21:52:18Z",
  "genres": [
    232
  ]
}