{
  "name": "The Long Ryders",
  "description": "'''The Long Ryders''' are an American [[alternative country]] and [[Paisley Underground]] band, principally active between 1982 and 1987, who have periodically regrouped for brief reunions (2004, 2009, 2014, 2016). In 2019 they released a new studio album – their first in 32 years – and played a series of tour dates.\n\nThe Long Ryders were originally formed by several American musicians who were each multi-instrumentalists and influenced by [[Gram Parsons]], [[the Byrds]], [[country music]] and various [[punk rock]] groups. They were named after the [[Walter Hill (filmmaker)|Walter Hill]] film, ''[[the Long Riders]]''. The band featured [[Sid Griffin]] and Stephen McCarthy on vocals and guitar; Des Brewer on bass (later replaced by [[Tom Stevens (musician)|Tom Stevens]]); and [[Greg Sowders]] on drums.\n\nAlthough two members were transplants from the American South, they became a popular Los Angeles rock band, forming in the early 1980s and originally associated with a movement called the [[Paisley Underground]]. With a sound reminiscent of ''[[Rubber Soul]]''-era [[Beatles]], electric [[Bob Dylan]], [[Buffalo Springfield]] and [[the Flying Burrito Brothers]], but with a harder edge, they anticipated the [[alternative country]] music of the 1990s by a decade. Their early work contained influences of both punk (largely attributable to devoted record collector Griffin) and old-school country (championed by McCarthy). Former Byrd [[Gene Clark]] joined them on their first full-length album, 1984's ''[[Native Sons (The Long Ryders album)|Native Sons]]'', adding vocals to the song \"Ivory Tower\". Their initial studio release, the ''[[10-5-60]]'' [[Extended play|EP]], consisted of Griffin, Brewer, McCarthy, and Sowders. Brewer left after the release of ''10-5-60''. He was replaced by Tom Stevens, and that line-up remained in place as a recording unit until their eventual demise.",
  "last_revision_date": "2025-03-15T06:10:48Z",
  "genres": [
    36,
    52,
    292,
    296,
    440,
    622,
    891,
    1052
  ]
}