{
  "description": "'''The Hellacopters''' are a Swedish [[garage rock]] band that was formed in 1994 by [[Nicke Andersson]] (vocals and guitar), [[Dregen|Andreas Tyrone \"Dregen\" Svensson]] (guitar), [[Kenny Håkansson]] (bass) and [[Matz Robert Eriksson|Robert Eriksson]] (drums). Andersson (sometimes known as Nick Royale) had been the drummer for death metal band [[Entombed (band)|Entombed]] and Dregen was taking a break from his full-time band [[Backyard Babies]]. Dregen and Eriksson had been roadies for Entombed, while Håkansson was a childhood friend of Andersson's. The Hellacopters were initially conceived as a side project for Andersson and Dregen, but it eventually became the main songwriting and performance vehicle for Andersson. The band, together with [[The Hives]], is considered one of the most important Swedish bands in the [[garage rock revival]] and one of the most influential rock bands in Sweden.\n\nThe band released their Swedish Grammi-winning debut album ''[[Supershitty to the Max!]]'' in 1996. Just before a tour opening for [[Kiss (band)|Kiss]], the band recruited keyboardist and percussionist Anders Lindström (also known as Boba Fett or Boba) on a part-time basis; he would become a full-time member in 1999. After the album ''[[Payin' the Dues]]'' in 1998, Dregen left the band to return to Backyard Babies full-time, and [[Mattias Hellberg]] and Danne Andersson were recruited to complete the band touring responsibilities. After the release of ''[[Grande Rock]]'', which featured additional guitar playing from both Lindström and Hellberg, [[Robert Dahlqvist]] was hired as a full-time lead guitarist in 1999. With the lineup now solidified, the band released three more studio albums and a [[Head Off|cover album]], with many EPs and limited edition releases as well. The Hellacopters disbanded amicably in 2008 so the members could move on to [[List of The Hellacopters member projects|other projects]]. Eight years later, the band reassembled in 2016, initially for an exclusive performance at [[Sweden Rock Festival]] to celebrate the 20 year anniversary of their award-winning debut album ''[[Supershitty to the Max!]]''.\n\nIn October 2021 the band announced that they had signed with the record label [[Nuclear Blast]] to release a new album in the spring of 2022. The album, ''Eyes of Oblivion'', was released on 1 April 2022. The group's latest album, ''Overdriver'', was released on January 31, 2025.",
  "last_revision_date": "2025-05-25T03:40:13Z"
}