{
  "description": "'''The Stranglers''' are an English [[rock music|rock]] band formed in 1974. Scoring 23 [[UK top 40]] singles and 20 UK top 40 albums to date in a career spanning five decades, the Stranglers are one of the longest-surviving bands to have originated in the UK punk scene.\n\nFormed as the Guildford Stranglers in [[Guildford]], [[Surrey]], in early 1974,{{sfn|Buckley|1997|page=23}} they originally built a following within the mid-1970s [[Pub rock (United Kingdom)|pub rock]] scene. While their aggressive, no-compromise attitude had them identified by the media with the emerging UK [[punk rock]] scene that followed, their idiosyncratic approach rarely followed any single [[musical genre]], and the group went on to explore a variety of musical styles, from [[new wave music|new wave]], [[art rock]] and [[gothic rock]] through the [[sophisti-pop]] of some of their 1980s output. They had major mainstream success with their 1982 single \"[[Golden Brown]]\". Their other hits include \"[[No More Heroes (The Stranglers song)|No More Heroes]]\", \"[[Peaches (The Stranglers song)|Peaches]]\", \"[[Always the Sun]]\", \"[[Skin Deep (The Stranglers song)|Skin Deep]]\" and \"[[Big Thing Coming]]\".\n\nThe Stranglers' early sound was driven by [[Jean-Jacques Burnel]]'s melodic bass, but also gave prominence to [[Dave Greenfield]]'s keyboards.\nTheir early music was also characterised by the growling vocals and sometimes [[Misanthropy|misanthropic]] lyrics of both Burnel and [[Hugh Cornwell]]. Over time, their output gradually grew more refined and sophisticated. Summing up their contribution to popular music, critic Dave Thompson later wrote: \"From bad-mannered [[yobbo|yobs]] to purveyors of supreme pop delicacies, the group was responsible for music that may have been ugly and might have been crude – but it was never, ever boring.\" \n\nThey experienced several line-up changes. After Cornwell's departure in 1990, Burnel, drummer [[Jet Black]] and Greenfield had been the only constant members of the band - until Black's retirement in 2018 and Greenfield's death in 2020.",
  "last_revision_date": "2025-05-14T12:18:23Z"
}