{
  "name": "The Corrs",
  "description": "'''The Corrs''' are an Irish family band consisting of siblings [[Andrea Corr|Andrea]] (lead vocals, [[tin whistle]], [[mandolin]], [[ukulele]]), [[Sharon Corr|Sharon]] ([[violin]], [[Keyboard instrument|keyboards]], vocals), [[Caroline Corr|Caroline]] ([[drums]], [[percussion]], [[piano]], [[bodhrán]], vocals) and [[Jim Corr|Jim]] ([[guitar]], piano, keyboards, vocals). Their music combines [[pop rock]] with traditional Irish themes. They are from [[Dundalk]] in [[County Louth]], [[Ireland]]. \n\nThe Corrs have released seven [[Album#Studio|studio albums]] and numerous [[Single (music)|singles]] which have reached [[Music recording sales certification|Platinum]] in many countries. They have sold 40 million albums worldwide. ''[[Talk on Corners]]'', their most successful album to date, reached multi-Platinum status in Australia. In the UK it was the highest selling album of the year. The band is one of a small number of acts who have held the top two positions simultaneously in the UK album charts, with ''Talk on Corners'' at number one and ''[[Forgiven, Not Forgotten]]'' at number two. ''Talk on Corners''  was the year's third highest selling album in Australia. The band's third studio album, ''[[In Blue]]'', went to number one in seventeen countries.\n\nThe Corrs [[List of awards and nominations received by the Corrs|have received]] two [[Grammy Awards|Grammy Award]] nominations, one [[Brit Awards|BRIT Award]], and were awarded honorary [[Order of the British Empire|MBEs]] in 2005 for their contributions to music and charity. They have been actively involved in philanthropic activities and have performed in numerous charity concerts, such as [[The Prince's Trust]] event in 2004 and [[Live 8]] in 2005.\n\nThe band was inactive for almost ten years because Jim and Caroline were raising families and Andrea and Sharon were pursuing solo careers while raising families of their own. According to Sharon, it was uncertain if or when the Corrs would reunite. Rumours of a reunion appeared in early 2015, and in a radio interview with [[Chris Evans (presenter)|Chris Evans]] in June 2015, Andrea confirmed that the Corrs were working on a new album and would play that year's [[Radio 2 Live in Hyde Park|BBC Radio 2 Live in Hyde Park festival]]. Their sixth studio album, ''[[White Light (The Corrs album)|White Light]]'', was released on 27 November 2015, and was accompanied by a European tour. After two years, their seventh studio album, ''[[Jupiter Calling (album)|Jupiter Calling]]'', was released on 10 November 2017.",
  "last_revision_date": "2025-07-15T01:12:30Z",
  "genres": [
    211,
    919,
    435
  ]
}