{
  "name": "The Get Up Kids",
  "description": "'''The Get Up Kids''' are an American [[emo music|emo]] band from [[Kansas City]]. Formed in 1995, the band was a major act in the mid-1990s [[Midwest emo]] scene, otherwise known as the \"[[Emo#1994–1997: Underground popularity|second wave]]\" of emo music. Their second album ''[[Something to Write Home About]]'' remains their most widely acclaimed album, and is considered to be one of the quintessential albums of the second-wave emo movement. They are considered [[forefathers]] of the emo genre, and have been widely credited as being an influence, both by contemporaries [[Saves the Day]] and later bands such as [[Fall Out Boy]], [[Taking Back Sunday]] and [[The Wonder Years (band)|the Wonder Years]].\n\nAs they gained prominence, they began touring with bands such as [[Green Day]] and [[Weezer]] before becoming headliners themselves, eventually embarking on international tours of [[Japan]] and [[Europe]]. They founded Heroes & Villains Records, an imprint of the successful indie rock label [[Vagrant Records]]. While the imprint's original purpose was to release albums by the Get Up Kids, it served as a launching pad for several side-projects such as [[the New Amsterdams]] and [[Reggie and the Full Effect]].\n\nThe band departed heavily from their established style with the release of their 2002 album ''[[On a Wire]]'', which saw the band take on a much more layered, alternative rock sound. Like many early emo bands, the Get Up Kids sought to dissociate themselves from the term \"emo.\"\n\nDue to internal conflicts, the band broke up in 2005. Three years later, the band reunited to support the tenth anniversary re-release of ''Something to Write Home About'', and soon afterward entered the studio to write new material. In early 2010, the band released ''[[Simple Science]]'', their first release in six years, followed in 2011 by the full-length ''[[There Are Rules]]''. Their most recent studio album, ''[[Problems (album)|Problems]]'', which was seen by many as a return to their early style, was released in 2019.",
  "last_revision_date": "2025-05-13T03:04:11Z"
}