{
  "description": "'''The Doors''' were an American rock band formed in Los Angeles in 1965, comprising vocalist [[Jim Morrison]], keyboardist [[Ray Manzarek]], guitarist [[Robby Krieger]] and drummer [[John Densmore]]. They were among the most influential and controversial rock acts of the 1960s, primarily due to Morrison's lyrics and voice, along with his erratic stage persona and legal issues. The group is widely regarded as an important figure of the [[counterculture of the 1960s|era's counterculture]].\n\nThe band took its name from the title of the English writer [[Aldous Huxley]]'s book ''[[The Doors of Perception]]'', itself a reference to a quote by the English poet [[William Blake]]. After signing with [[Elektra Records]] in 1966, the Doors with Morrison recorded and released six studio albums in five years, some of which are generally considered among the greatest of all time, including their debut ''[[The Doors (album)|The Doors]]'' (1967), ''[[Strange Days (The Doors album)|Strange Days]]'' (1967), and ''[[L.A. Woman]]'' (1971). Dubbed the \"Kings of Acid Rock\" by ''[[Life (magazine)|Life]]'', they were one of the most successful bands of their time and by 1972, the Doors had sold over 4 million albums domestically and nearly 8&nbsp;million singles.\n\nMorrison died in uncertain circumstances in 1971. The band continued as a trio, releasing two more albums until disbanding in 1973. In 1978, they reformed for the album ''[[An American Prayer]]'', which combined new music with Morrison's recitings of his poetry recorded in 1969 and 1970. They reunited again briefly in 1993 when they were inducted into the [[Rock and Roll Hall of Fame]], and for several one-off projects in the 21st century. In 2002, Manzarek, Krieger, and [[Ian Astbury]] of [[the Cult]] on vocals started performing as \"The Doors of the 21st Century\". Densmore and the Morrison estate successfully sued them over the use of the band's name. After a short time as Riders on the Storm, they settled on the name [[Manzarek–Krieger]] and toured until Manzarek's death in 2013.\n\nThe Doors were the first American band to accumulate eight consecutive [[Recording Industry Association of America]] (RIAA)-certified [[RIAA certification|Gold]] LPs.{{refn|group=nb|In the official DVD ''[[Dance on Fire]]'' features in the credits of the song \"[[Riders on the Storm]]\": \"They would become the first American band to accumulate eight consecutive gold and platinum LPs.\"<ref>{{Cite AV media |url=https://m.ok.ru/video/1416366761 |title=Dance on Fire |time=49:46 |via=[[OK.ru]] |access-date=February 20, 2019}}</ref>}} According to the RIAA, they have sold 34 million albums in the United States and over 100 million records worldwide, making them one of the [[List of best-selling music artists|best-selling bands of all time]]. The Doors have been listed as one of the greatest artists of all time by magazines including ''[[Rolling Stone]]'', which ranked them 41st on its list of the \"[[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]\".",
  "last_revision_date": "2025-06-12T20:26:09Z"
}