{
  "name": "The Cure",
  "description": "'''The Cure''' are an English [[Rock music|rock]] band formed in [[Crawley]] in 1976 by [[Robert Smith (musician)|Robert Smith]] (vocals, guitar) and [[Lol Tolhurst]] (drums). The band's current line-up comprises Smith, [[Simon Gallup]] (bass), [[Roger O'Donnell]] (keyboards), [[Perry Bamonte]] (guitar and keyboards), [[Jason Cooper]] (drums) and [[Reeves Gabrels]] (guitar). Smith has remained the only constant member throughout numerous line-up changes since the band's formation, though Gallup has been present for all but two of the band's studio albums.\n\nThe Cure's debut album ''[[Three Imaginary Boys]]'' (1979), along with several early singles, placed the band at the forefront of the emerging [[post-punk]] and [[New wave music|new wave]] movements that were gaining prominence in the United Kingdom. The band adopted a new, increasingly dark and tormented style beginning with their second album ''[[Seventeen Seconds]]'' (1980), which, together with Smith's fashion sense, had a strong influence on the emerging genre of [[gothic rock]] and the [[gothic subculture|goth subculture]] that eventually formed around it. Smith introduced more [[Pop music|pop]] into the band's music following the release of their fourth album ''[[Pornography (album)|Pornography]]'' (1982), leading them to worldwide mainstream success. The band reached their commercial peak with the albums ''[[Kiss Me, Kiss Me, Kiss Me]]'' (1987), ''[[Disintegration (The Cure album)|Disintegration]]'' (1989) and ''[[Wish (The Cure album)|Wish]]'' (1992) recorded with guitarist [[Porl Thompson]] and drummer [[Boris Williams]].\n\nThe Cure have released 14 studio albums, two EPs, and over 40 singles, selling more than 30 million records worldwide. They were inducted into the [[Rock and Roll Hall of Fame]] in 2019. Their 14th album ''[[Songs of a Lost World]]'' (2024) was their first release of all-new material in 16 years and received widespread acclaim, topping the charts in multiple countries (including the UK, their first number one album in the country since 1992) and becoming one of the year's fastest selling albums.",
  "last_revision_date": "2025-07-18T03:50:40Z",
  "genres": [
    505,
    935,
    827,
    40
  ]
}