{
  "name": "The Temptations",
  "description": "'''The Temptations''' is an American vocal group formed in [[Detroit]], Michigan, in 1961 as '''The Elgins''', known for their string of successful singles and albums with [[Motown]] from the 1960s to  the mid-1970s. The group's work with producer [[Norman Whitfield]], beginning with the Top 10 hit [[45 rpm single|single]] \"[[Cloud Nine (The Temptations song)|Cloud Nine]]\" in October 1968, pioneered [[psychedelic soul]], and was significant in the evolution of [[Rhythm and blues|R&B]] and [[soul music]]. The group members were known for their choreography, distinct harmonies, and dress style. Having sold tens of millions of albums, the Temptations are among the most successful groups in [[popular music]].\n\nFeaturing five male vocalists and dancers (save for brief periods with fewer or more members), the group's founding members came from two rival Detroit vocal groups: [[Otis Williams]], Elbridge \"Al\" Bryant, and [[Melvin Franklin]] of '''(Otis Williams &) The Distants''', and [[Eddie Kendricks]] and [[Paul Williams (The Temptations)|Paul Williams]] of '''The Primes'''. In 1964, Bryant was replaced by [[David Ruffin]], who was the lead vocalist on a number of the group's biggest hits, including \"[[My Girl (The Temptations song)|My Girl]]\" (1964), \"[[Ain't Too Proud to Beg]]\" (1966), and \"[[I Wish It Would Rain]]\" (1967). Ruffin was replaced in 1968 by [[Dennis Edwards]], with whom the group continued to record hit records such as \"Cloud Nine\" (1968), \"[[I Can't Get Next to You]]\" (1969), and \"[[Ball of Confusion (That's What the World Is Today)]]\" (1970). Kendricks and Paul Williams both left the group in 1971, with subsequent members including [[Richard Street]], [[Damon Harris]], Glenn Leonard, Ron Tyson, and [[Ali-Ollie Woodson]], the last of whom was the lead singer on late-period hit \"[[Treat Her Like a Lady (The Temptations song)|Treat Her Like a Lady]]\" in 1984 and the theme song for the children's movement program ''Kids in Motion'' in 1987.\n\nOver the course of their career, the Temptations released four [[Billboard Hot 100|''Billboard'' Hot 100]] number-one singles and fourteen [[Hot R&B/Hip-Hop Songs|R&B number-one singles]]. The group was the first Motown act to win a [[Grammy Awards|Grammy Award]] –  for \"Cloud Nine\" in 1969 – and the [[Grammy Lifetime Achievement Award]], received in 2013. They won four [[Grammy Award]]s in total. The Temptations – specifically Edwards, Franklin, Kendricks, Ruffin, Otis Williams and Paul Williams – were [[List of Rock and Roll Hall of Fame inductees|inducted]] into the [[Rock and Roll Hall of Fame]] in 1989. Three Temptations songs, \"My Girl\", \"[[Just My Imagination (Running Away with Me)]]\" (1971), and \"[[Papa Was a Rollin' Stone]]\" (1972), are included among the Rock and Roll Hall of Fame's [[500 Songs that Shaped Rock and Roll]]. The Temptations were ranked No. 68 on ''[[Rolling Stone]]'' magazine's list of the \"100 Greatest Artists of All Time\" in 2010. In 2023, the group were ranked No. 1 by ''[[Billboard (magazine)|Billboard]]'' magazine on its list of the on the \"100 Greatest R&B/Hip-Hop Artists Of All Time\".\n\n{{As of|2025}}, The Temptations continue to perform with Otis Williams in the lineup, who is the group's last surviving original member. Williams owns the rights to \"The Temptations\" name.",
  "last_revision_date": "2025-06-12T11:20:50Z"
}