{
  "name": "The Mars Volta",
  "description": "'''The Mars Volta''' is an American [[Rock music|rock]] band formed in 2001. The band's only constant members are [[Omar Rodríguez-López]] (guitar, producer, direction) and [[Cedric Bixler-Zavala]] (vocals, lyrics), whose partnership forms the core of the band. The band's current line-up also includes founding member [[Eva Gardner]] (bass), Omar's brother [[Marcel Rodríguez-López]] (keyboards, synths, percussion), [[Leo Genovese]] (piano, keyboard, saxophone) and [[Linda-Philomène Tsoungui]] (drums). \n\nKnown for their energetic live shows and [[concept album]]s, The Mars Volta formed following the break-up of Rodríguez-López and Bixler-Zavala's previous band, [[At the Drive-In]]. Seeking to experiment and expand their sound, Rodríguez-López and Bixler-Zavala recruited Gardner, [[Isaiah \"Ikey\" Owens]] (keyboards), [[Jon Theodore]] (drums) and [[Jeremy Ward (musician)|Jeremy Ward]] (sound manipulation) to form The Mars Volta. The band released their debut EP, ''[[Tremulant (EP)|Tremulant]]'', in 2002, with Gardner leaving the band prior to recording their debut album, ''[[De-Loused in the Comatorium]]''. She was replaced by [[Red Hot Chili Peppers]]' bass guitarist [[Flea (musician)|Flea]] for the sessions. The [[Rick Rubin]]-produced album received widespread critical acclaim upon its release in 2003.\n\nThe band's second studio album, ''[[Frances the Mute]]'' (2005), was self-produced by Rodríguez-López and was the first to feature longterm members [[Juan Alderete]] (bass) and Marcel Rodríguez-López. The album debuted at #4 on the [[Billboard 200|US ''Billboard'' 200]] and became the band's biggest commercial success, selling over 500,000 copies in the US and achieving Gold certification from the [[Recording Industry Association of America|RIAA]]. The band's third studio album, ''[[Amputechture]]'', was released in 2006 and was the last album to feature Theodore. In 2008, the band released ''[[The Bedlam in Goliath]]'', a concept album inspired by the band's turbulent experiences with a [[ouija]]-type talking board. The album's first single, \"[[Wax Simulacra]]\" was awarded a [[Grammy Award]] in 2009 for [[Grammy Award for Best Hard Rock Performance|Best Hard Rock Performance]]. The band released its fifth album, ''[[Octahedron (album)|Octahedron]]'', in June 2009. \n\nFollowing the release of their sixth album, ''[[Noctourniquet]]'' (2012), and a run of reunion shows with At the Drive-In, The Mars Volta entered a hiatus in September 2012. Rodríguez-López subsequently formed a new project, [[Bosnian Rainbows]], and the band formally broke up after disagreements between Rodríguez-López and Bixler-Zavala. The duo repaired their friendship and reunited in 2014 for a new project, [[Antemasque (band)|Antemasque]], and further At the Drive-In tours and recording sessions.\n\nReuniting in secret in 2019, Rodríguez-López and Bixler-Zavala recorded a new studio album, ''[[The Mars Volta (album)|The Mars Volta]]'', with Gardner, Marcel Rodríguez-López and drummer Willy Rodriguez Quiñones. The band announced their reunion – after ten years of public inactivity – with an art installation called L'ytome Hodorxí Telesterion, in June 2022. For the band's live return, jazz pianist Leo Genovese, drummer Linda-Philomène Tsoungui and [[Josh Moreau]] were added to the line-up. The band's ninth album, ''[[Lucro Sucio; Los Ojos del Vacio]]'', was released in April 2025.",
  "last_revision_date": "2025-06-12T18:59:23Z",
  "genres": [
    946,
    956,
    926,
    617,
    65,
    418
  ]
}