{
  "name": "The White Stripes",
  "description": "'''The White Stripes''' were an American rock duo formed in Detroit, Michigan, in 1997. The group consisted of [[Jack White]] (guitar, keyboards, piano, vocals) and [[Meg White]] (drums, percussion, vocals). They were a leading group of 2000s [[indie rock]] and the decade's [[Post-punk revival|garage rock revival]].\n\nBeginning in the late 1990s, the White Stripes sought success within the [[Music of Detroit#1980s and 1990s|Detroit music scene]], releasing six singles and two albums. They found commercial success with their third album, ''[[White Blood Cells]]'' (2001), which received critical acclaim and propelled the band to the forefront of the garage rock revival. Their fourth album, ''[[Elephant (album)|Elephant]]'' (2003), drew further success, winning the band their first [[Grammy Awards]]. The band [[Experimental music|experimented]] extensively on their fifth album, ''[[Get Behind Me Satan]]'' (2005). They returned to their [[blues]] roots with their sixth and final album, ''[[Icky Thump]]'' (2007), which was praised like the band's earlier albums. By the end of the 2000s, the White Stripes had accumulated entries on the US [[Billboard Hot 100|''Billboard'' Hot 100]] including \"[[Seven Nation Army]]\", \"[[Blue Orchid]]\" and \"[[Icky Thump (song)|Icky Thump]]\"; the formermost became a sports anthem. Other [[Music recording certification|certified]] singles include \"[[Fell in Love with a Girl]]\", \"[[The Hardest Button to Button]]\", \"[[Blue Orchid]]\" and \"[[My Doorbell]]\".\n\nThe White Stripes used a [[Lo-fi music|low-fidelity]] approach to writing and recording. Their music featured a melding of [[garage rock]] and [[blues]] influences and a raw simplicity of composition, arrangement, and performance. The duo were noted for their mysterious public image, their fashion and design aesthetic which featured a simple color scheme of red, white, and black—which was used on every album and single cover they released—and their fascination with the number three. They made selective media appearances, including [[Jim Jarmusch]]'s anthology film ''[[Coffee and Cigarettes]]'' (2003) and the documentary ''[[Under Great White Northern Lights]]'' (2009). After a lengthy hiatus from performing and recording, the band dissolved in 2011.\n\nThe White Stripes have released six studio albums, two live albums, one compilation album, and one extended play. They have received [[List of awards and nominations received by the White Stripes|numerous accolades]], including six Grammy Awards from eleven nominations. The [[Rock and Roll Hall of Fame]] included ''White Blood Cells'' on their \"[[List of 200 Definitive Albums in the Rock and Roll Hall of Fame|200 Definitive Albums]]\" list. ''[[Rolling Stone]]'' ranked ''White Blood Cells'' and ''Elephant'' on their list of the \"[[Rolling Stone's 500 Greatest Albums of All Time|500 Greatest Albums of All Time]]\", and named the band the sixth greatest duo of all time in 2015. The White Stripes have been selected [[List of Rock and Roll Hall of Fame inductees|to be inducted]] into the Rock and Roll Hall of Fame in 2025, after being nominated in 2023 (the band's first year of eligibility).",
  "last_revision_date": "2025-09-16T18:02:27Z",
  "genres": [
    42,
    140,
    487,
    584,
    982
  ]
}