{
  "name": "The Velvet Underground",
  "description": "'''The Velvet Underground''' were an American [[Rock music|rock]] band formed in New York City in 1964. Its classic lineup consisted of singer and guitarist [[Lou Reed]], Welsh multi-instrumentalist [[John Cale]], guitarist [[Sterling Morrison]], and percussionist [[Moe Tucker]]. Though their integration of rock and the [[avant-garde]] earned them little commercial success during their initial nine-year run, they are now widely regarded as one of the most influential bands in rock music, as well as [[Underground music|underground]], [[Experimental music|experimental]], and [[Alternative music|alternative]] music. Their provocative subject matter and experimentation were instrumental in the development of [[punk rock]], [[new wave music|new wave]] and other genres.\n\nThe group performed under several names before settling on the Velvet Underground in 1965, taken from the title of [[The Velvet Underground (book)|a 1963 book on atypical sexual behavior]]. In 1966, the experimental pop artist [[Andy Warhol]] became their official manager. They served as the [[house band]] at Warhol's studio, [[The Factory]], and performed with his traveling multimedia show the ''[[Exploding Plastic Inevitable]]'' from 1966 to 1967. Their debut album, ''[[The Velvet Underground & Nico]],'' featuring the German singer and model [[Nico]], was released in 1967 to critical indifference and poor sales, although it has been later regarded as one of the greatest albums in music history.\n\nThe band released their second album, the abrasive ''[[White Light/White Heat]]'', in 1968, after which Cale was replaced with [[Doug Yule]]. They then released two more accessible albums, ''[[The Velvet Underground (album)|The Velvet Underground]]'' (1969) and ''[[Loaded (The Velvet Underground album)|Loaded]]'' (1970), but neither performed to the expectations of record labels or de facto group leader Reed. In the early 1970s, all but Yule left the band for various reasons. A final album was released under the Velvet Underground name in 1973, ''[[Squeeze (The Velvet Underground album)|Squeeze]]'', recorded mostly by Yule with session musicians in London. The Velvet Underground dissolved shortly after. The former band members collaborated on each other's solo work throughout the 1970s and 1980s, and an album of long lost recordings of original songs, ''[[VU (album)|VU]]'', was released in 1985. Reed, Cale, Tucker and Morrison reunited for a series of well-received shows in 1993, and released a live album from the tour, ''[[Live MCMXCIII]]'', later that year.\n\nAfter Morrison's death in 1995, the remaining members played their final performance at their [[Rock and Roll Hall of Fame]] induction in 1996. Reed died in 2013. In 2004, the Velvet Underground were ranked number 19 on ''[[Rolling Stone]]''{{'}}s list of the \"[[Rolling Stone's 100 Greatest Artists of All Time|100 Greatest Artists of All Time]]\". ''[[The New York Times]]'' wrote that the Velvet Underground was \"arguably the most influential American rock band of our time\".",
  "last_revision_date": "2025-08-22T00:22:32Z",
  "genres": [
    66,
    422,
    962
  ]
}