{
  "name": "The Move",
  "description": "'''The Move''' were an English [[Rock music|rock]] band formed in [[Birmingham]] in 1965. Their original line-up comprised lead guitarist [[Roy Wood]], singer [[Carl Wayne]], rhythm guitarist [[Trevor Burton]], bassist [[Ace Kefford|Chris \"Ace\" Kefford]] and drummer [[Bev Bevan]]. Wood was the band leader and main songwriter, with lead vocal duties falling to Wayne, while Wood, Burton and Kefford also contributed lead and backing vocals. By 1971, the band was reduced to a trio of Wood, Bevan and guitarist/singer/songwriter [[Jeff Lynne]] (formerly of [[the Idle Race]]), who joined in 1970. The Move scored nine [[Top 40|top 20]] UK singles in five years, but were among the most popular British bands of the 1960s and 1970s not to achieve major success in the United States.\n\nThe Move evolved from several mid-1960s [[Birmingham]]-based groups, including [[Carl Wayne & the Vikings]], the Nightriders and the Mayfair Set. Their name referred to the move various members of these bands made to form the group. During their time together, the band released four studio albums, two compilation albums, [[Something Else from the Move|one live extended play]] and 18 singles. After their first two singles, \"[[Night of Fear]]\" and \"[[I Can Hear the Grass Grow]]\" hit number 2 and number 5 on the [[UK singles chart]], the band released their [[Move (The Move album)|self-titled debut]] in 1968, which hit number 15 on the UK [[Official Albums Chart]] and garnered two more top 10 singles, \"[[Flowers in the Rain]]\" and \"[[Fire Brigade (song)|Fire Brigade]]\". After 1968, the band would have three more singles in the top 10, including the number 1 hit \"[[Blackberry Way]]\". The band released three more studio albums - ''[[Shazam (album)|Shazam]]'', ''[[Looking On]]'' and ''[[Message from the Country]]'' - before their breakup in 1972. The band's later years saw Wood, Lynne and Bevan develop a side project called [[Electric Light Orchestra]], which would go on to achieve major international success after The Move disbanded. Wood would later leave that group and form [[Wizzard]].\n\nIn 1981, the band briefly reunited for a one-off [[charity concert]], consisting of Bevan, Wood and Kefford. Twenty-three years later, in 2004, Bevan would form the \"Bev Bevan Band\" with former [[ELO Part II]] bandmates [[Phil Bates]] and Neil Lockwood. Bevan later rebranded this group as \"Bev Bevan's Move\" and - beginning in 2006 - featured Trevor Burton as an occasional guest in shows, before he became a permanent member of the group. Between 2007 and 2014, Burton and Bevan, alongside Lockwood and new members Phil Tree, Gordon Healer, Tony Kelsey and Abby Brant, performed intermittently as \"The Move featuring Bev Bevan and Trevor Burton\". The band's most recent reunion would happen in 2016, as \"Bev Bevan's Zing Band\", with Bevan and former members Tree, Brant and Kelsey, alongside new member Geoff Turton.",
  "last_revision_date": "2025-11-18T15:21:21Z",
  "genres": [
    447,
    935,
    970,
    1048
  ]
}