{
  "name": "The Three Degrees",
  "description": "'''The Three Degrees''' are an American female vocal group formed circa 1963 in [[Philadelphia|Philadelphia, Pennsylvania]]. Although several women have been members over the years, the group has always been a trio. The group were particularly successful in the UK, achieving 13 Top 50 hit singles between 1974 and 1985.\n\nThe current line-up consists of Valerie Holiday, Freddi Poole, and Hazel Payne, formerly of [[A Taste of Honey]]. \n\nA second grouping features Three Degree Helen Scott, with Skyler Jordan and Tamika Peoples.\n\nThe original members were [[Fayette Pinkney]], Shirley Porter and Linda Turner. By mid-1963, Porter and Turner were replaced by Janet Harmon and Helen Scott; Scott was replaced by [[Sheila Ferguson]] in 1966, while Harmon was replaced by Valerie Holiday in 1967. This line-up of Pinkney, Holiday and Ferguson became the most successful in the group's history; together from 1967 to 1976, they topped the [[Billboard Hot 100|''Billboard'' US Hot 100]] as featured vocalists on the [[MFSB]] single \"[[TSOP (The Sound of Philadelphia)]]\" in 1974, and had seven UK Top 40 hits, including the 1974 single \"[[When Will I See You Again]]\", which was a huge international hit, reaching the Top 5 in seven countries, including number two in the US and topping the [[UK Singles Chart]]. When Pinkney left the group in 1976, she was replaced by a returning Helen Scott. This line-up had four UK Top 20 hits, including \"[[Woman in Love (Three Degrees song)|Woman in Love]]\", which reached number three in 1979. Ferguson left for a solo career in 1986.\n\nThe group's most stable line-up was from 1989 to 2010, with Cynthia Garrison joining Holiday and Scott. They achieved a final UK chart entry, reaching number 54 in 1998 with a dance cover of \"[[Last Christmas]]\". Garrison left the band at the end of 2010 for health reasons, and was replaced by Freddi Poole in 2011. The group's 2016 album, ''Strategy: Our Tribute to Philadelphia'', was their first studio album release with Pool as a member.  Helen Scott is the only Degree living from their early beginnings on Swan Records in 1963.",
  "last_revision_date": "2025-10-16T20:22:43Z",
  "genres": [
    352,
    911,
    1035
  ]
}