{
  "name": "The Stone Roses",
  "description": "'''The Stone Roses''' were an English [[rock music|rock]] band formed in [[Manchester]] in 1983. They were one of the pioneering groups of the [[Madchester]] movement in the late 1980s and early 1990s. The band's classic and most prominent lineup consisted of the vocalist [[Ian Brown]], the guitarist [[John Squire]], the bassist [[Mani (musician)|Gary \"Mani\" Mounfield]] and the drummer [[Reni (musician)|Alan \"Reni\" Wren]].\n\nThe Stone Roses released [[The Stone Roses (album)|their eponymous debut album]] in 1989. It was a breakthrough success, being critically acclaimed and regarded by many as one of the greatest British albums.{{efn|Refer to [[The Stone Roses (album)#Accolades]]}} Following this success, the band sought to capitalise on their newfound fame by signing with a major label. However, their record label at the time, [[Silvertone Records (1980)|Silvertone]], would not let them out of their contract, leading to a lengthy legal battle that culminated with the band signing with [[Geffen Records]] in 1991.\n\nThe Stone Roses released their second album, ''[[Second Coming (The Stone Roses album)|Second Coming]]'', in 1994. It received mixed reviews. The group soon disbanded after several lineup changes throughout the supporting tour, which began with Reni departing in early 1995, followed by Squire in April 1996. Brown and Mani dissolved the remains of the group in October 1996 following their appearance at the [[Reading Festival]].\n\nFollowing much media speculation, the Stone Roses announced their reunion on 18 October 2011 and embarked on a [[Reunion Tour (The Stone Roses)|world tour]] in 2012, including three homecoming shows in [[Heaton Park]], Manchester. Plans to record a third album were also floated, but only two singles were released. In June 2012 Chris Coghill, the writer of the film ''[[Spike Island (film)|Spike Island]]'', revealed that the band \"have at least three or four new tracks recorded\". In June 2013 a documentary about the band's reformation, directed by [[Shane Meadows]] and titled ''[[The Stone Roses: Made of Stone]]'', was released.\n\nIn 2016 the Stone Roses released their first new material in two decades. The band continued to tour until June 2017, at which point cryptic remarks by Brown indicated that the band had split again. This was later confirmed in a 2019 interview with Squire.",
  "last_revision_date": "2025-12-15T00:46:04Z",
  "genres": [
    42,
    317,
    587,
    819
  ]
}