{
  "name": "The Miracles",
  "description": "'''The Miracles''' (later known as '''[[Smokey Robinson]] and the Miracles''' from 1965 to 1972) were an American vocal group formed in [[Detroit]], Michigan in 1955. They were the first successful recording act for [[Motown Records]] and are considered one of the most important and most influential groups in the history of [[Pop music|pop]], [[Soul music|soul]], [[rhythm and blues]] and [[rock and roll]] music. The group's international fame in the 1960s, alongside other Motown acts, led to a greater acceptance of R&B and pop music in the U.S., with the group being considered influential and important in the development of modern popular music.\n\nThe group was formed as The Five Chimes and changed their name to the Miracles in 1958, by which time their lineup consisted of [[Smokey Robinson]], [[Claudette Rogers Robinson|Claudette Rogers]] (later Robinson), [[Bobby Rogers]], [[Warren \"Pete\" Moore]],  [[Marv Tarplin]], and [[Ronnie White]]. Referred to as Motown's \"soul supergroup\", the Miracles recorded more than 50 chart hits, including 26 [[Billboard Hot 100|Top 40]] pop hits, 16 of which reached the [[Billboard Hot 100|''Billboard'' Hot 100]] Top 20, seven Top 10 singles, and a number-one single (1967's \"[[The Tears of a Clown]]\") while the Robinsons and Tarplin were members. Following the departure of Tarplin and the Robinsons, the rest of the group continued with singer [[Billy Griffin]] and manager Martin Pichinson, who helped rebuild the Miracles. They scored two final Top 20 singles, \"[[Do It Baby]]\" (1974) and \"[[Love Machine (The Miracles song)|Love Machine]]\" (1975), a second No. 1 hit, which topped the charts before the group departed for [[Columbia Records]] in 1977. Recording as a quintet at Columbia with Billy's brother Donald Griffin replacing Marv Tarplin, after a few releases, they disbanded in 1978. The group have won numerous music industry awards, including four songs inducted into the [[Grammy Hall of Fame]], several [[BMI Film & TV Awards|BMI]] and [[American Society of Composers, Authors and Publishers|ASCAP]] Songwriters' Awards, and induction into the [[Rock and Roll Hall of Fame]].\n\nOn the R&B charts, the Miracles scored 26 Top 10 ''Billboard'' R&B hits, with four R&B No. 1's, and 11 U.S. R&B Top 10 Albums, including two No. 1's. Bobby Rogers and Ronald White revived the group as a touring ensemble sporadically during the 1980s and again in the 1990s. Following White's death in 1995, Rogers continued to tour with different members until he was forced into retirement due to health issues in 2011, dying less than two years later. In 1987, Smokey Robinson was inducted into the Rock and Roll Hall of Fame as a solo artist,  and much controversy ensued over the Miracles' omission from the Hall. The Miracles were finally inducted into the Hall of Fame by lead singer Robinson in 2012.",
  "last_revision_date": "2025-05-17T19:15:18Z",
  "genres": [
    1015,
    354,
    1022,
    1113,
    347,
    455
  ]
}