{
  "name": "The Drifters",
  "description": "'''The Drifters''' are an American [[Pop music|pop]] and [[Rhythm and blues|R&B]]/[[Soul music|soul]] vocal group. They were originally formed as a backing group for [[Clyde McPhatter]], formerly the lead tenor of [[Billy Ward and his Dominoes]] in 1953. The second group of Drifters, formed in 1959 and led by [[Ben E. King]], were originally an up-and-coming group named '''the Five Crowns'''. After 1965, members swapped in and out of both groups and many of these formed other groups of Drifters as well. Over the succeeding decades, several different bands, all called the Drifters, can trace roots back to these original groups, but contain few—if any—original members.\n\nAccording to ''[[Rolling Stone]]'', the Drifters were the least stable of the great vocal groups, as they were low-paid musicians hired by [[George Treadwell]], who owned the Drifters' name from 1955, after McPhatter left. The Treadwell Drifters line has had 60 musicians, including several splinter groups by former Drifters members (not under Treadwell's management). These groups are usually identified with a possessive credit such as \"Bill Pinkney's Original Drifters\", \"Charlie Thomas' Drifters\".\n\nThe three golden eras of the Drifters were the early 1950s, the 1960s, and the early 1970s (post-Atlantic period). From these, the first Drifters, formed by Clyde McPhatter, were inducted into the [[Vocal Group Hall of Fame]] as \"The Drifters\". The second Drifters, featuring [[Ben E. King]], were separately inducted into the Vocal Group Hall of Fame as \"Ben E. King and the Drifters\". In their induction, the [[Rock and Roll Hall of Fame]] selected four members from the first Drifters, two from the second Drifters, and one from the post-Atlantic Drifters. There were other lead singers too, but the group was less successful during those times.\n\nAccording to the Vocal Group Hall of Fame: \"Through turmoil and changes, the (original) Drifters managed to set musical trends and give the public 13 chart hits, most of which are legendary recordings today.\" Matching that feat, subsequent formations of the Drifters recorded 13 [[Billboard Hot 100|''Billboard'' Hot 100]] top-30 chart hits.  The 1950s and '60s incarnations of the group were also a force on the US R&B charts, notching six number-one R&B hits:  \"[[Money Honey (Clyde McPhatter and the Drifters song)|Money Honey]]\" (1953), \"[[Honey Love (The Drifters song)|Honey Love]]\" (1954), \"[[Adorable (song)|Adorable]]\" (1955), \"[[There Goes My Baby (The Drifters song)|There Goes My Baby]]\" (1959), \"[[Save the Last Dance for Me]]\" (1960), and \"[[Under the Boardwalk]]\" (1964).  A 1970s revival in Britain, with both old and new material, was not matched in the United States, although they had their biggest successes on the UK singles chart, peaking with the number-two hit \"[[Kissin' in the Back Row of the Movies]]\".",
  "last_revision_date": "2025-08-17T13:31:11Z",
  "genres": [
    1128,
    1027,
    357,
    924
  ]
}