{
  "name": "The Monkees",
  "description": "'''The Monkees''' were an American [[pop rock]] band formed in Los Angeles in the mid-1960s. The band consisted of [[Micky Dolenz]], [[Davy Jones (musician)|Davy Jones]], [[Michael Nesmith]], and [[Peter Tork]]. Spurred by the success of ''[[The Monkees (TV series)|The Monkees]]'' television series, they were one of the most successful bands of the late 1960s. The band produced four chart-topping albums and three chart-topping songs (\"[[Last Train to Clarksville]]\", \"[[I'm a Believer]]\", and \"[[Daydream Believer]]\").\n\nThe Monkees were originally a fictional band created for the [[NBC]] television sitcom ''The Monkees''. Dolenz, Jones, Nesmith and Tork were cast to portray members of a band in the sitcom. Music credited to the Monkees appeared in the sitcom and was released on LPs and singles beginning in 1966, and the sitcom aired from 1966 to 1968. At first, the band members' musical contributions were primarily limited to lead vocals and the occasional composition, with the remaining music provided by professional songwriters and studio musicians. Though this arrangement yielded multiple hit albums and singles, the band members desired greater control over the creation of their music. Following a brief power struggle, the Monkees gained full control over the recording process in 1967. For two albums, the Monkees mostly performed as a group; however, within a year, each member was pursuing his own interests under the Monkees' name, rendering the Monkees once again a group in name only. With widespread allegations that the band members did not play their own instruments—followed by the cancellation of ''The Monkees'' TV series, diminishing success on the charts, and waning popularity overall—band members began to leave the group. The Monkees held a final recording session in 1970 before breaking up.\n\nRenewed interest in the Monkees emerged in 1986, leading to a 20th anniversary reunion. Over the subsequent 35 years, the Monkees intermittently reunited for reunion tours, a major-network television special, and the production of new studio albums. After the deaths of Jones in 2012 and Tork in 2019, Dolenz and Nesmith undertook a [[farewell tour]] in 2021. This tour concluded shortly before Nesmith's death later that year, leaving Dolenz as the sole surviving member of the Monkees.",
  "last_revision_date": "2025-06-11T20:51:52Z",
  "genres": [
    1024,
    182,
    914
  ]
}