{
  "name": "The Quarrymen",
  "description": "'''The Quarrymen''' (also written as \"'''the Quarry Men'''\") are a British [[skiffle]] and [[rock and roll]] group, formed by [[John Lennon]] in Liverpool in 1956, which evolved into [[the Beatles]] in 1960. Originally consisting of Lennon and several school friends, the Quarrymen took their name from a line in the school song of their school, the [[Calderstones School|Quarry Bank High School]]. Lennon's mother, [[Julia Lennon|Julia]], taught her son to play the [[banjo]], showed Lennon and [[Eric Griffiths]] how to tune their guitars in a similar way to the banjo, and taught them simple chords and songs.\n\nLennon founded a [[skiffle]] group with his close friend [[Pete Shotton]] and after a week of gaining new members, they named themselves the Quarrymen.{{sfn|Lewisohn|2013|p=104}} The Quarrymen played at parties, school dances, cinemas and amateur skiffle contests before [[Paul McCartney]] joined in early July 1957. [[George Harrison]] joined in early 1958 at McCartney's recommendation, though Lennon initially resisted because he felt Harrison (14 when he was introduced to Lennon) was too young. McCartney and Harrison attended the [[Liverpool Institute High School for Boys|Liverpool Institute]].\n\nThe group made an amateur recording in 1958, performing [[Buddy Holly]]'s \"[[That'll Be the Day]]\" and \"[[In Spite of All the Danger]]\", a song written by McCartney and Harrison. The group moved towards rock and roll, causing several of the original members to leave. This left Lennon, McCartney, and Harrison, who performed under several other names, including '''Johnny and the Moondogs''', '''Japage 3''', and '''Long John and the Silver Beatles''' before returning to the Quarrymen name in 1959. In 1960, the group changed their name to \"the Beatles\" (chosen for its double meaning and as a wink to [[Buddy Holly]]'s band, \"[[the Crickets]]\"). \n\nIn 1997, the four surviving original (non-Beatles) members of the Quarrymen reunited to perform at the 40th anniversary celebrations of the garden fête performance at which Lennon had first met McCartney. Since 1998, they have performed in countries outside the UK and released four albums. Two original members still perform as the Quarrymen.",
  "last_revision_date": "2025-09-06T03:11:36Z",
  "genres": [
    1040,
    1114
  ]
}