{
  "name": "The Bangles",
  "description": "'''The Bangles''' are an American [[all-female band|all-female]] [[pop rock]] band formed in Los Angeles, in 1981. They are known for hit singles during the 1980s that made them one of the most successful pop rock groups of the decade. The band’s biggest commercial successes include \"[[Walk Like an Egyptian]]\" (1986), which became a worldwide phenomenon, \"[[Manic Monday]]\" (1986), a song written by [[Prince (musician)|Prince]], and a cover of [[Simon & Garfunkel|Simon & Garfunkel’s]] \"[[A Hazy Shade of Winter#The Bangles version|Hazy Shade of Winter]]\" (1987), which was featured in the film ''Less Than Zero''. Their ballad \"[[Eternal Flame (song)|Eternal Flame]]\" (1989) became a big hit, topping the charts in several countries and is one of their signature songs. Other hits included \"[[In Your Room (The Bangles song)|In Your Room]]\" (1988) and \"[[If She Knew What She Wants]]\" (1986).\n\nFormed by [[Susanna Hoffs]] and sisters [[Vicki Peterson]] and [[Debbi Peterson]], the group began as part of the [[Paisley Underground]] scene, a Los Angeles music movement heavily influenced by 1960s rock and psychedelic music. Their early work blended jangly guitar melodies with power-pop sensibilities. The original lineup included Hoffs (guitar and vocals), Vicki Peterson (guitar and vocals), Debbi Peterson (drums and vocals), and [[Annette Zilinskas]] (bass). After Zilinskas left in 1983 to focus on other projects, [[Michael Steele (musician)|Michael Steele]], formerly of [[the Runaways]], joined as bassist and vocalist, cementing the classic lineup.\n\nTheir 1984 debut album, ''[[All Over the Place (The Bangles album)|All Over the Place]]'', received critical acclaim and earned the group a loyal following, setting the stage for their commercial breakthrough with the 1986 album ''[[Different Light]]''. The success of ''Different Light'' established the Bangles as one of the top female-fronted acts of the 1980s. \n\nAfter their third album, ''[[Everything (The Bangles album)|Everything]]'' (1988), and the success of \"Eternal Flame\", the band struggled with internal tensions, leading to their initial disbandment in 1989. However, they reunited in the late 1990s, recording new material and performing live. In 2018, founding bassist Annette Zilinskas rejoined the group.",
  "last_revision_date": "2025-11-15T13:31:37Z",
  "genres": [
    846,
    902,
    943,
    966
  ]
}