{
  "name": "The Crazy World of Arthur Brown",
  "description": "'''The Crazy World of Arthur Brown''' are an English [[rock music|rock]] band formed by singer [[Arthur Brown (musician)|Arthur Brown]] in 1967. The original band included [[Vincent Crane]] ([[Hammond organ]] and piano), Drachen Theaker  (drums), and Nick Greenwood (bass). This early incarnation were noted for Crane's organ and brass arrangements and Brown's powerful, wide-ranging operatic voice. Brown was also notable for his unique stage persona such as extreme [[facepaint]] and burning helmet.\n\nTheir song \"[[Fire (Arthur Brown song)|Fire]]\" (released in 1968 as a single) sold more than one million copies, and was awarded a [[music recording sales certification|gold disc]] reaching number one in the [[UK Singles Chart]] and Canada, and number two on the US [[Billboard Hot 100|''Billboard'' Hot 100]] as well as its parent album ''[[The Crazy World of Arthur Brown (album)|The Crazy World of Arthur Brown]]'' which reached number 2 on the UK album charts, number 6 in [[RPM (magazine)|Canada]], and number 7 in the US. Following the success of \"Fire\", the press would often refer to Brown as \"[[Honorific nicknames in popular music|The God of Hellfire]]\", in reference to the opening shouted line of the song, a moniker that exists to this day.\n\nIn the late 1960s, the Crazy World of Arthur Brown's popularity was such that the group shared bills with [[the Who]], [[Jimi Hendrix]], [[the Mothers of Invention]], [[the Doors]], [[the Small Faces]], and [[Joe Cocker]], among others. However, the band's second studio album, ''Strangelands'', although set to be released in 1969, was shelved by the band's record label due to lacking sales potential (although it would later be released in 1988). The band would soon break up a year later, in 1970, with Crane and fellow member [[Carl Palmer]] forming [[Atomic Rooster]], Theaker joining the band [[Love (band)|Love]], and Brown joining the group [[Kingdom Come (British band)|Kingdom Come]]. Palmer would later co-found [[Emerson, Lake & Palmer]] and [[Asia (band)|Asia]], while Brown would briefly join [[The Alan Parsons Project]] and [[Hawkwind]].\n\nIn 2000, the band would reform, this time with Jim Mortimore (bass), Samuel Walker (drums), [[Z-Star]] (guitar), Lucie Rejchrtova (keyboardist), and Malcolm Dick (projecter). Ever since their reunion, have released four studio albums (''Tantric Lover'' in 2000, ''Vampire Suite'' in 2003, ''Zim Zam Zim'' in 2013, and ''Gypsy Voodoo'' in 2019) and one live album (2011's ''The Crazy World of Arthur Brown Live at High Voltage''). In 2019, Z-Star, Rejchrtova, and Dick left the group, and guitarist Dan Smith joined that same year. The lineup currently consists of Brown, Mortimore, Walker, and Smith.\n\nAlthough the band only had one major hit, they would be incredibly influential in innovating the [[shock rock]] genre and the [[freak scene]] aesthetic, and numerous shock rock artists, such as [[Kiss (band)|Kiss]], [[Alice Cooper]] and [[Marilyn Manson]], alongside other musicians like [[David Bowie]] and [[Peter Gabriel]] (of [[Genesis (band)|Genesis]]) would be heavily influenced by the group, and Brown would take part in numerous notable projects, including playing a character in the [[Tommy (1975 film)|film adaptation]] of [[The Who]]'s ''[[Tommy (The Who album)|Tommy]]''.",
  "last_revision_date": "2025-10-11T13:53:25Z",
  "genres": [
    171,
    173,
    1044
  ]
}