{
  "name": "The Move",
  "description": "'''The Move''' were a British [[Rock music|rock]] band formed in [[Birmingham]] in 1965. They scored nine [[Top 40|top 20]] UK singles in five years, but were among the most popular British bands not to find any real success in the United States. For most of their career The Move were led by guitarist, singer and songwriter [[Roy Wood]]. He wrote all the group's UK singles and, from 1968, also sang lead vocals on many songs. Initially, the band had four main vocalists (Wood, [[Carl Wayne]], [[Trevor Burton]], and [[Ace Kefford|Chris \"Ace\" Kefford]]) who divided the lead-vocal duties among themselves.\n\nThe Move evolved from several mid-1960s [[Birmingham]]-based groups, including [[Carl Wayne & the Vikings]], the Nightriders, and the Mayfair Set. Their name referred to the move various members of these bands made to form the group. Besides Wood, The Move's original five-piece line-up in 1965 was drummer [[Bev Bevan]], bassist Ace Kefford, vocalist Carl Wayne, and guitarist Trevor Burton. By 1972, The Move had been reduced to a trio consisting of Wood, Bevan and [[Jeff Lynne]], formerly of [[the Idle Race]]. The band's later years saw this lineup develop a side project called [[Electric Light Orchestra]], which would go on to achieve major international success after The Move disbanded. Wood would later leave that group and form the decently successful band [[Wizzard]].\n\nDuring their time together, the band released four studio albums, two compilation albums, [[Something Else from the Move|one live extended play]], and 18 singles. After their first two singles, \"[[Night of Fear]]\" and \"[[I Can Hear the Grass Grow]]\" hit number 2 and number 5 on the [[UK singles chart]], the band released their [[Move (The Move album)|self-titled debut]] in 1968, which hit number 15 on the UK [[Official Albums Chart]] and garnered two more top-10 singles, \"[[Flowers in the Rain]]\" and \"[[Fire Brigade (song)|Fire Brigade]]\". After 1968, the band would have three more singles in the top 10, including \"[[Blackberry Way]]\", which went all the way to number 1. The band also released three more studio albums (''[[Shazam (album)|Shazam]]'', ''[[Looking On]]'', and ''[[Message from the Country]])'' before their breakup.\n\nIn 1981, the band briefly reunited for a one-off [[charity concert]], consisting of Bevan, Wood, and Kefford. 23 years later, in 2004, Bevan would form the \"Bev Bevan Band\" with [[Phil Bates]] and Neil Lockwood. The name later changed to \"Bev Bevan's Move\" and Bevan would invite Burton to the group in 2006 as an occasional guest in shows, before he became a permanent member of the group. Between 2007 and 2014, Burton and Bevan, alongside Lockwood and new members Phil Tree, Gordon Healer, Tony Kelsey, and Abby Brant, performed intermittently as \"The Move featuring Bev Bevan and Trevor Burton\". The band's most recent reunion would happen in 2016, as \"Bev Bevan's Zing Band\", with Bevan and former members Tree, Brant, and Kelsey, alongside new member Geoff Turton.",
  "last_revision_date": "2025-07-20T06:12:17Z",
  "genres": [
    1029,
    917,
    951,
    443
  ]
}