{
  "name": "The Mothers of Invention",
  "description": "'''The Mothers of Invention''' (also known as '''the Mothers''') was an American [[rock music|rock]] band from [[California]]. Formed in 1964, their work is marked by the use of sonic experimentation, innovative [[album art]], and elaborate live shows. Originally an [[R&B]] band called '''the Soul Giants''', the band's first lineup comprised [[Ray Collins (rock musician)|Ray Collins]], David Coronado, Ray Hunt, [[Roy Estrada]], and [[Jimmy Carl Black]]. [[Frank Zappa]] was asked to take over as the guitarist when a fight between Collins and Hunt led to the latter's being fired. Zappa insisted they perform his original material—a decision that resulted in Coronado's leaving because he did not agree to the change—and on [[Mother's Day (United States)|Mother's Day]] in 1965 the band changed its name to the Mothers. Record executives demanded the name be changed again, and so, \"out of necessity\", Zappa later said, \"We became the Mothers of Invention\", referring to the proverb \"[[Necessity is the mother of invention]]\".\n\nAfter early struggles, the Mothers enjoyed substantial popular commercial success. The band first became popular playing in California's underground music scene in the late 1960s. With Zappa at the helm, it was signed to jazz label [[Verve Records]] as part of the label's diversification plans. Verve released the Mothers of Invention's début double album ''[[Freak Out!]]'' in 1966, recorded by Zappa, Collins, Black, Estrada and [[Elliot Ingber]]. During its original run, the band's ever-changing lineup also included [[Don Preston]], [[Bunk Gardner]], [[Billy Mundi]], [[Jim Fielder]], [[Ian Underwood]], [[Jim Sherwood|Jim \"Motorhead\" Sherwood]], [[Art Tripp]], [[Buzz Gardner]], and [[Lowell George]]. The Mothers released a series of critically acclaimed albums, including ''[[Absolutely Free]]'', ''[[We're Only in It for the Money]]'', and ''[[Uncle Meat]]'', before being disbanded by Zappa in 1969. In 1970, he formed a new version of the Mothers that included Ian Underwood, [[Jeff Simmons (musician)|Jeff Simmons]], [[George Duke]], [[Aynsley Dunbar]] and singers [[Mark Volman]] and [[Howard Kaylan]] (formerly of [[the Turtles]], but who for contractual reasons were credited in this band as [[Flo & Eddie|the Phlorescent Leech & Eddie or Flo & Eddie]] for short). Later replacing Simmons with another ex-Turtle, bassist [[Jim Pons]], this second incarnation of the Mothers endured through December 1971, when Zappa was seriously injured and almost killed by an audience member during a concert appearance in London.\n\nZappa focused on big-band and orchestral music while recovering from his injuries, and in 1973 formed the Mothers' final lineup, which included Ian Underwood, George Duke, Ralph Humphrey, Sal Marquez, [[Bruce Fowler]], [[Tom Fowler (musician)|Tom Fowler]], and [[Ruth Underwood]]. [[Napoleon Murphy Brock]] and [[Chester Thompson]] also joined the band later that year. The final non-archival album using the Mothers (of Invention) name, ''[[Bongo Fury]]'' (1975), featured [[Captain Beefheart]], as well as guitarist Denny Walley and drummer [[Terry Bozzio]], both of whom continued to play for Zappa on subsequent non-Mothers releases.",
  "last_revision_date": "2025-09-16T16:25:25Z",
  "genres": [
    66,
    77,
    140,
    271,
    359,
    422,
    629,
    966
  ]
}