{
  "name": "The Impossibles",
  "description": "'''The Impossibles''' ({{langx|th|ดิ อิมพอสซิเบิ้ล}}) were a [[Thai rock]] and [[Thai pop music|Thai pop]] band that was active in the late 1960s and 1970s. As one of Thailand's earliest rock bands, they were known for their fusion of rock and traditional Thai music. They debuted with their first album around 1969, making them pioneers in the Thai music scene.\n\nThe group's hits included \"Rak Kan Nhor\" (\"Come to love\"), \"Nai Wa Ja Jam\" (\"Who says this would be remembered\"), \"Chuen Rak\" (\"Cherish love\"), \"Thalay Mai Khoey Lap\" (\"Seas never sleep\"), \"Rak Chua Niran\" (\"Love forever\"), \"Khoy Nhong\" (\"Waiting for you\"), \"Nueng Nai Duang Jai\" (\"Only one in my heart\") and \"Penpai Mai Dai\" (\"Impossible\").\n\nThe group was also known for its [[Cover version|covers]] of [[Western world|Western]] rock songs. The Impossibles were among the first Thai pop bands to cover English-language songs and were the first Thai rock band to record an English-language album overseas, during a tour of Europe.\n\nIn addition to rock and pop, the band's sound frequently crossed over into [[funk music|funk]], [[R&B]], [[country music|country]] and [[folk music|folk]] and psychedelic folk. They did two covers of [[Kool and the Gang]] tracks (\"Give it Up\" and \"Love the Life You Live\") as well as (\"[[Love Will Keep Us Together]]\") by [[Neil Sedaka]] and [[Howard Greenfield]] on their 1975 album \"Hot Pepper\", an all-English lyrics recording. The band also performed in [[Cinema of Thailand|Thai films]].\n\nThe band broke up in 1977, but it has frequently performed at reunions over the years, and its members remain active in music in Thailand.\n\nSetha Sirachaya and other members of the band appeared in ''[[The Possible]]'', a [[2006 in film|2006]] [[Cinema of Thailand|Thai film]] about a fictional musical group from 1969 called The Possible who supposedly were rivals of The Impossibles. Setha tells the band leader of The Possible that, The Impossibles were named after his \"favorite cartoon,\" ''[[The Impossibles (TV series)|The Impossibles]]'', a 1960s [[Hanna-Barbera]] TV series.",
  "last_revision_date": "2025-09-27T00:06:20Z",
  "genres": [
    294,
    467,
    725,
    950,
    991,
    1053,
    1062,
    1230,
    1231
  ]
}