{
  "name": "The Jesus and Mary Chain",
  "description": "'''The Jesus and Mary Chain''' are a Scottish [[alternative rock]] band formed in [[East Kilbride]] in 1983. The band revolves around the songwriting partnership of brothers [[Jim Reid|Jim]] and [[William Reid (musician)|William Reid]], who are the two founders and only consistent members of the band since its formation. They are recognized as key figures in the development of the [[shoegaze]] and [[noise pop]] subgenres. The band have had twelve top 40 entries and two top 10 hits in the [[UK Singles Chart]] in the course of their career.\n\nThe Reid brothers recruited [[Douglas Hart]] on bass and [[Murray Dalglish]] on drums as their initial lineup. After signing to the independent label [[Creation Records]], they released their first single \"[[Upside Down (The Jesus and Mary Chain song)|Upside Down]]\" in 1984. [[Bobby Gillespie]] replaced Dalglish on drums, and their debut album ''[[Psychocandy]]'' was released to critical acclaim in 1985 on the major label [[Warner Music Group|WEA]]. After its release, Gillespie left the band to work on his own band [[Primal Scream]]. The band's biggest commercial success domestically was their second album [[Darklands (album)|''Darklands'']], which reached No. 5 on the [[UK Albums Chart]] in 1987 and spawned the hit single \"[[April Skies]]\", peaking at No. 8 in the UK. The band released their third album ''[[Automatic (The Jesus and Mary Chain album)|Automatic]]'' in 1989, which spawned their first charting singles in the US, \"[[Blues from a Gun]]\" and \"[[Head On (song)|Head On]]\", which were heavily played on alternative rock radio stations. Hart departed from the band two years later.\n\nThe Jesus and Mary Chain then released the albums ''[[Honey's Dead]]'' in 1992 and ''[[Stoned & Dethroned]]'' in 1994, both of which continued their popularity in the US. \"[[Sometimes Always]]\", taken from ''Stoned & Dethroned'', became the band's most commercially successful single in the US as it peaked at No. 96 on the [[Billboard Hot 100|''Billboard'' Hot 100]]. The band departed from WEA after ten years, and then signed with [[Sub Pop Records]] in the US and re-signed with Creation Records in the UK for the release of the album ''[[Munki]]'' in 1998. The band broke up the following year as a result of an onstage altercation the year prior; William Reid prematurely left a tour after fighting with an intoxicated Jim Reid. They eventually reunited in 2007, and in 2017, they released ''[[Damage and Joy]]'', their first studio album in 19 years and seventh overall. Their next album, ''[[Glasgow Eyes]],'' was released in 2024 and became the band's first top 10 album in the UK since 1988.",
  "last_revision_date": "2025-05-21T10:34:32Z",
  "genres": [
    575,
    837,
    930,
    40,
    1087
  ]
}