{
  "name": "The Pogues",
  "description": "'''The Pogues''' are an English  [[Celtic punk]] band{{efn|name=nationality}} founded in [[King's Cross, London]], in 1982, by [[Shane MacGowan]], [[Spider Stacy]] and [[Jem Finer]]. Originally named '''Pogue Mahone'''—an [[anglicisation]] of the [[Irish language|Irish]] phrase [[:wikt:póg mo thóin|''póg mo thóin'']], meaning \"kiss my arse\"—the band fused [[Irish traditional music]] with [[punk rock]] influences. After adding more members, including [[James Fearnley]] and [[Cait O'Riordan]], the Pogues built a reputation with their live shows in London pubs and clubs. \n\nIn 1984, the Pogues released their debut studio album, ''[[Red Roses for Me]]'', featuring a mix of traditional Irish songs and original compositions by MacGowan. It was followed by ''[[Rum Sodomy & the Lash]]'' (1985), the four-track EP ''[[Poguetry in Motion]]'' (1986), and the critically acclaimed ''[[If I Should Fall from Grace with God]]'' (1988). \"[[Fairytale of New York]]\", recorded as a duet by MacGowan and [[Kirsty MacColl]], reached number two in the UK charts at Christmas 1987 and remains a perennial seasonal favourite in Ireland and the UK. The Pogues recorded two more albums with MacGowan, [[Peace and Love (The Pogues album)|''Peace and Love'']] (1989) and ''[[Hell's Ditch]]'' (1990), before sacking him during a 1991 tour as his drug and alcohol dependency increasingly affected their live performances.\n\nThe Pogues continued with [[Joe Strummer]] and then Stacy as frontmen, releasing new material on ''[[Waiting for Herb]]'' (1993), but broke up following the critical and commercial failure of their seventh and last studio album, ''[[Pogue Mahone]]'' (1996). The band re-formed in late 2001, again featuring MacGowan as frontman, and toured regularly in the UK, Ireland, mainland Europe, and the USA for over a decade. Following the death of longtime guitarist [[Philip Chevron]], the Pogues dissolved again in 2014. Longtime bassist [[Darryl Hunt (musician)|Darryl Hunt]] died in August 2022 and MacGowan died in November 2023. Stacy, Finer and Fearnley re-formed the Pogues in 2024 and toured the UK, Ireland, and North America in 2025.",
  "last_revision_date": "2026-01-24T20:28:17Z",
  "genres": [
    445
  ]
}