{
  "name": "Thrice",
  "description": "'''Thrice''' is an American [[Rock music|rock]] band from [[Irvine, California]], formed in 1998. The group was founded by guitarist/vocalist [[Dustin Kensrue]] and lead guitarist Teppei Teranishi while they were in high school.\n\nEarly in their career, the band was known for [[melodic hardcore]] [[punk music]] based in heavily distorted guitars, prominent lead guitar lines, and frequent changes in [[Unusual time signatures|complex time signatures.]] This style is exemplified on their second album, ''[[The Illusion of Safety (Thrice album)|The Illusion of Safety]]'' (2002) and their third album ''[[The Artist in the Ambulance]]'' (2003). Their fourth album ''[[Vheissu]]'' (2005) made significant changes by incorporating electronic beats, keyboards, and a more experimental sound. In 2007 and 2008, Thrice released ''[[The Alchemy Index (disambiguation)|The Alchemy Index]]'', consisting of two studio albums that together make a four-part, 24-song cycle. Each of the four six-song EPs of the Alchemy Index features significantly different styles, based on different aspects of the band's musical esthetic which reflect the [[Classical element|elemental themes]] of fire, water, air and earth, both lyrically and musically. The band's seventh album, ''[[Beggars (album)|Beggars]],'' was released on August 11, 2009, and their eighth, ''[[Major/Minor (album)|Major/Minor]]'' on September 20, 2011. The most recent albums feature a refined combination of the band's different experiments and explorations. In 2011, Thrice announced a final tour and an imminent hiatus.\n\nKensrue and Teranishi decided to reform the band in 2015 after attending a [[Brand New (band)|Brand New]] concert. In 2016, Thrice released their first post-reunion album, ''[[To Be Everywhere Is to Be Nowhere]].'' \nThe band's tenth album, ''[[Palms (Thrice album)|Palms]]'', was released in 2018. Their eleventh studio album ''Horizons/East'' was released in September 2021. Each album released by Thrice has had a portion of its sales proceeds donated to a new charitable organization.",
  "last_revision_date": "2025-08-12T10:21:34Z",
  "genres": [
    927,
    42,
    422,
    746,
    938,
    66,
    405
  ]
}