{
  "description": "'''Trần Thùy Chi''' (born May 4, 1990) is a Vietnamese singer better known by her stage name '''Thùy Chi'''. She won the People's Choice prize in the annual songwriting contest Bai Hat Viet (Vietnamese Song) at the end of 2008, then started a successful solo career.\n\nThuy Chi was born in 1990 in Hai Duong, Vietnam. Both of her parents worked as artists in Hai Duong. At the young age of six, Thuy Chi was exposed to music and was later introduced to the piano. She began traveling to Ha Noi at nine years old to study piano at the National Academy of Music of Ha Noi. \n\nThough her fame in the singing community arose from her online hits, Thuy Chi had always intended to become a piano instructor. She began gaining popularity in the Vietnamese community with the release of the song \"Giac Mo Trua\" (composed by Giang Son). In 2005, Minh Phuong, Thuy Chi, and their newly formed band, the TSD Band, won first prize in the [[VTV3]] \"Tuoi Doi Menh Mong\" contest for high school and college students across the country. After Thuy Chi's cover of \"Giac Mo Trua\" by Khanh Linh, Chi was often seen as the doppelganger of Khanh Linh.\n\nThuy Chi reached her height of fame when her songs were unofficially released on the internet. Since then, she had always been regarded as a singer with an angelic voice, hitting some very high notes with much clarity and a honeyed voice. This online success earned Thuy Chi a spot in the singing contest \"Bai Hat Viet\" in 2005 organized by [[VTV4]]. Though famous in showbiz and was persuaded by her fans to continue pursuing a singing career, she only saw it as her interest and wanted to pursue her love for teaching the piano.\n\nIn 2008, Thuy Chi won the Favorite Artists of the Month award from the show \"Bai Hat Viet\" with songs such as \"Thanh Thi,\" \"Pho Co,\" etc.\nAt the annual ceremony \"[[Green Wave (radio show)|Lan Song Xanh]]\" in 2009, Thuy Chi was awarded as one of the top ten artists of the year. \nIn 2010, Thuy Chi and her Vietnamese band won the silver medal of the world[source needed]. In 2001, she and the Vietnamese band won the gold medal for their performance[source needed]. \nIn 2013, in Germany, her orchestra received the gold medal, and the Vietnamese child orchestra also won the awards for two performances: the most excellent performance and the fans' favorite[source needed]. \nIn December 2013, at the \"Bai Hat Viet\" live show, the audience voted \"Song of the Month\" for the track \"Pho trong mua,\" written by a young artist \"[[Nguyễn Anh Vũ|Nguyen Anh Vu]]\" and performed by Thuy Chi.\nIn the \"Fans' Favorite\" live show in February 2015, the prize of the month of January was officially given to the song \"Giu Em Di\" given by the young singer Thuy Chi.",
  "last_revision_date": "2024-11-07T10:50:01Z"
}