{
  "name": "To Live and Shave in L.A. (TLASILA)",
  "description": "'''To Live and Shave in L.A.''' ('''TLASILA''') is an experimental [[noise rock]] collective founded in 1993 by avant-garde composer/producer Tom Smith (formerly of Washington, DC groups [[Peach of Immortality (band)|Peach of Immortality]] and [[Pussy Galore (band)|Pussy Galore]]) and Miami Beach musician/producer Frank \"Rat Bastard\" Falestra. They were soon joined by [[oscillator]] player Ben Wolcott. This lineup created the majority of the early releases in TLASILA's extensive discography. \n\nThe group's debut album, ''30-minuten männercreme'', was released in 1994. ''[[Bananafish Magazine]]'' described the recording as \"a wind tunnel of 30-weight vitriol.\" The \"wildly inaccessible\" ensemble has featured [[Don Fleming (musician)|Don Fleming]], [[Andrew W.K.]], [[Weasel Walter]], [[Thurston Moore]], and at least a dozen other musicians and sound artists.\n\nThe group's primary aesthetic assertion posits that \"[[genre]] is obsolete\". Although often categorized as purveyors of [[noise rock]], TLASILA have been noted to pursue an unorthodox approach, \"construct(ing) songs around an overwhelming plethora of [[sound|sonic]] detail, challenging the listener to engage with a surfeit of information,\" deliberately blurring \"the line between [[harsh metal]]-on-metal noise and abstract [[musique concrète]]\" Smith's lyrics \"distance\" the group \"from any potential peers,\" \"scanning like (they) came from some previously unearthed hermetic treatise.\" \n\nFollowing the release of ''The Cortège'' ([[Fan Death Records]], 2011), the collective went on hiatus, abjuring live performances but releasing albums all the while. Regrouping in January 2015 with the album ''Unwept to Meet Strange Clay'' (Karl Schmidt Verlag, 2015), TLASILA resumed its touring activities.\n\nFounding member Tom Smith died in January 2022. In 2025, Palilalia released a 25th anniversary deluxe four LP box set reissue of ''The Wigmaker in Eighteenth-Century Williamsburg''.",
  "last_revision_date": "2025-10-22T06:25:22Z",
  "genres": [
    76,
    430,
    457,
    552,
    870
  ]
}