{
  "name": "Tom DeLonge",
  "description": "'''Thomas Matthew DeLonge''' ({{IPAc-en|d|ə|ˈ|l|ɒ|ŋ}}; born December 13, 1975) is an American musician best known as the co-founder, co-lead vocalist, and guitarist of the rock band [[Blink-182]] across three stints (1992–2005, 2009–2015, and since 2022). He is also the lead vocalist and guitarist of the rock band [[Angels & Airwaves]], which he formed in 2005 after his first departure from Blink-182. DeLonge is noted for his distinctive nasal singing voice.\n\nDeLonge received his first guitar as a child and later began writing [[punk rock]] songs. While in high school, he formed Blink-182 with bassist [[Mark Hoppus]] and drummer [[Scott Raynor]]. They signed with [[Cargo Music]] and released their debut album, ''[[Cheshire Cat (Blink-182 album)|Cheshire Cat]]'' (1995), which made them popular in the local scene. Their second album, ''[[Dude Ranch (album)|Dude Ranch]]'' (1997), was released by [[MCA Records]] and featured the hit single \"[[Dammit]]\". [[Travis Barker]] replaced Raynor in 1998 and the group achieved widespread success with their third album, ''[[Enema of the State]]'' (1999), which featured three hit singles; it sold more than 15 million copies worldwide and went quadruple-platinum in the U.S. The band's fourth release, ''[[Take Off Your Pants and Jacket]]'' (2001), gave them their first No. 1 album.\n\nDeLonge and Barker experimented with [[post-hardcore]] music on the album ''[[Box Car Racer (album)|Box Car Racer]]'' (2002), which they released under the name [[Box Car Racer]], but the side project was dissolved the next year. Blink-182's untitled fifth album, also known eponymously as ''[[Blink-182 (album)|Blink-182]]'' (2003), reflected a change in tone. Following internal tension spearheaded by DeLonge, the band broke up in 2005 before reuniting in 2009. During their initial breakup, DeLonge formed Angels & Airwaves, which has released five albums and evolved into what he calls an \"art project\" encompassing various forms of media. In 2015, DeLonge once again departed from Blink-182 before returning a second time in 2022.\n\nOutside of music, DeLonge has founded companies such as [[Macbeth Footwear]], which sells vegan and organic clothing; [[Modlife]], which sells technology designed to help artists monetize their creations; and [[To the Stars (company)|To the Stars]], which is dedicated to the exploration of [[fringe science]]. He scored and produced the sci-fi film ''[[Love (2011 film)|Love]]'' (2011), has multiple film projects in development, and wrote the children's book ''The Lonely Astronaut on Christmas Eve'' (2013).",
  "last_revision_date": "2025-11-21T02:58:16Z",
  "genres": [
    42,
    818,
    944,
    1000,
    1126,
    1157
  ]
}