{
  "name": "Tom Petty and the Heartbreakers",
  "description": "'''Tom Petty and the Heartbreakers''' were an American rock band formed in [[Gainesville, Florida]],  in 1976. The band originally comprised lead singer and rhythm guitarist [[Tom Petty]], lead guitarist [[Mike Campbell (musician)|Mike Campbell]], keyboardist [[Benmont Tench]], drummer [[Stan Lynch]] and bassist [[Ron Blair]]. In 1982, Blair, weary of the touring lifestyle, departed the band. His replacement, [[Howie Epstein]], remained with the band for the next two decades. In 1991, [[Scott Thurston]] joined the band as a multi-instrumentalist, primarily on rhythm guitar and secondary keyboard. In 1994, [[Steve Ferrone]] replaced Lynch on drums. Blair returned to the Heartbreakers in 2002, the year before Epstein's death. The band had a long string of hit singles, including \"[[Breakdown (Tom Petty and the Heartbreakers song)|Breakdown]]\", \"[[American Girl (Tom Petty song)|American Girl]]\" (both 1976), \"[[Refugee (Tom Petty and the Heartbreakers song)|Refugee]]\" (1979), \"[[The Waiting (song)|The Waiting]]\" (1981), \"[[Learning to Fly (Tom Petty song)|Learning to Fly]]\" (1991), and \"[[Mary Jane's Last Dance]]\" (1993), among many others, that stretched over several decades of work.\n\nAlthough Petty was insistent that the band's musical style be referred to as simply [[rock and roll]], the Heartbreakers' music was characterized as both [[Southern rock]] and [[heartland rock]], cited alongside artists such as [[Bruce Springsteen]], [[Bob Seger]], and [[John Mellencamp]] as progenitors of the latter genre, which arose in the late 1970s and early 1980s.  While the heartland rock movement waned in the 1990s, the band remained active and popular, touring regularly until Petty's death in 2017, after which the Heartbreakers disbanded. Their final studio album, ''[[Hypnotic Eye]]'', was released in 2014.\n\nThe band was inducted into the [[Rock and Roll Hall of Fame]] in 2002, their first year of eligibility. Although most of their material was produced and performed under the name \"Tom Petty and the Heartbreakers\", Petty released [[Tom Petty discography#solo albums|three solo albums]], the most successful of which was ''[[Full Moon Fever]]'' (1989). In these releases, some members of the band contributed as collaborators, producing and performing as [[studio musician]]s.",
  "last_revision_date": "2025-06-11T03:20:19Z"
}