{
  "name": "Tony Iommi",
  "description": "'''Anthony Frank Iommi Jr.''' ({{IPAc-en|aɪ|ˈ|oʊ|m|i}}; born 19 February 1948) is an English musician. He co-founded the pioneering [[Heavy metal music|heavy metal]] band [[Black Sabbath]] in 1968, and was the guitarist, leader, main composer, and only continuous member during the band's existence for over fifty years, playing guitar on [[Black Sabbath discography|all of their releases]]. He is considered one of the creators of heavy metal music and has been referred to as the \"Godfather of Heavy Metal\".\n\nAs a teen, Iommi lost the tips of his right-hand ring and middle fingers in a [[work accident]] at a [[sheet metal]] factory, which influenced his distinct playing style. He [[Down-tuned guitar|down-tuned]] his guitar and used more [[power chord]]s (partly to make playing easier), and made much use of the [[tritone]] (or 'devil's interval'), resulting in a 'heavier' and 'darker' sound that became a hallmark of heavy metal. He plays left-handed. As well as Black Sabbath, he was briefly live guitarist for [[Jethro Tull (band)|Jethro Tull]] in 1968. Iommi intended ''[[Seventh Star]]'' (1986) to be his first solo album, but the record label decided to release it under the Black Sabbath name. In 2000, he released his first official solo album ''[[Iommi (album)|Iommi]]'', followed in 2005 by ''[[Fused (album)|Fused]]'', which featured former bandmate [[Glenn Hughes (musician)|Glenn Hughes]]. In 2006 Iommi formed [[Heaven & Hell (band)|Heaven & Hell]] with former Black Sabbath bandmates. They released ''[[The Devil You Know (Heaven & Hell album)|The Devil You Know]]'' (2009), before disbanding after the death of singer [[Ronnie James Dio]] in 2010.\n\nIommi is widely regarded as one of the greatest and most influential rock guitarists of all time. He has won many awards, including three [[Grammy Awards]] and a Lifetime Achievement Award from the [[National Guitar Museum]], and is honoured on the [[Birmingham Walk of Stars]]. In 2011, Iommi published his autobiography, entitled ''Iron Man: My Journey Through Heaven and Hell with Black Sabbath''.",
  "last_revision_date": "2025-08-21T03:30:30Z",
  "genres": [
    141,
    358,
    533,
    547
  ]
}