{
  "name": "Toto",
  "description": "'''Toto''' is an American rock band formed in [[Los Angeles]], [[California]], in 1977. Toto combines elements of [[Pop music|pop]], [[Rock music|rock]], [[Soul music|soul]], [[funk]], [[hard rock]], [[Rhythm and blues|R&B]], [[blues]], and [[jazz]]. Having released 14 studio albums and sold over 50 million records worldwide, the group has received several [[Grammy Award]]s and was inducted into the [[Musicians Hall of Fame and Museum]] in 2009.\n\n[[David Paich]] (keyboards, vocals) and [[Jeff Porcaro]] (drums) had played together as [[session musician]]s on several albums and formed the band; [[David Hungate]] (bass), [[Steve Lukather]] (guitar, vocals), [[Steve Porcaro]] (keyboards, vocals), and [[Bobby Kimball]] (vocals) were recruited before the release of the band's [[Toto (album)|eponymous debut album]] in 1978. Led by the Top 5 single \"[[Hold the Line]]\", the album brought the band to mainstream attention, though it was their fourth album ''[[Toto IV]]'' (1982) which brought them global attention. \"[[Africa (Toto song)|Africa]]\" topped the [[Billboard Hot 100]], while \"[[Rosanna (song)|Rosanna]]\" reached number 2, helping Toto become one of the best-selling music groups of their era.\n\nFollowing ''Toto IV'', two of the original members, Hungate and Kimball, departed the band. Hungate was replaced on bass by [[Mike Porcaro]], while Kimball was replaced by a number of different short-term vocalists, the longest serving of which was [[Joseph Williams (musician)|Joseph Williams]]. After Jeff Porcaro's death in 1992, he was replaced by [[Simon Phillips (drummer)|Simon Phillips]]. While the band has not repeated the U.S. radio successes of their heyday in the late 1970s and early 1980s, they have continued to produce albums and tour more-or-less continuously to the current day, minus a few hiatuses, and have had many more top-ten albums and singles in places like Japan and [[Scandinavia]]. Steve Lukather remains the only original member who still records and tours with the band. Paich remains an official member of the band, though he has mostly retired from touring. Since the 2010s, the band has increasingly relied on contracted touring musicians to continue to perform. As of 2023, they have released fourteen studio albums, eight live albums, one movie soundtrack, 1984's ''[[Dune (1984 soundtrack)|Dune]]'', and a number of compilation albums. Their final release was 2018's ''[[Old Is New]]'' before the band decided against recording any further studio albums. In 2024, Toto launched its \"Dogz of Oz\" Tour with its first date in [[Red Bank, New Jersey]].",
  "last_revision_date": "2025-09-07T04:04:01Z",
  "genres": [
    62,
    534,
    627,
    932,
    964
  ]
}