{
  "name": "Traffic",
  "description": "'''Traffic''' were an English [[rock music|rock]] band formed in [[Birmingham]] in April 1967 by [[Jim Capaldi]], [[Steve Winwood]], [[Chris Wood (rock musician)|Chris Wood]] and [[Dave Mason]]. They began as a [[psychedelic rock]] group and diversified their sound through the use of instruments such as [[musical keyboard|keyboards]] (such as the [[Mellotron]] and [[harpsichord]]), [[sitar]], and various [[reed instrument]]s, and by incorporating [[jazz]] and [[musical improvisation|improvisational]] techniques in their music.\n\nThe band had early success in the UK with their debut album ''[[Mr. Fantasy]]'' and non-album singles \"[[Paper Sun]]\", \"[[Hole in My Shoe]]\", and \"[[Here We Go Round the Mulberry Bush (Traffic song)|Here We Go Round the Mulberry Bush]]\". Their follow-up  [[Traffic (Traffic album)|self-titled 1968 album]] was their most successful in Britain and featured one of their most popular songs, the widely covered \"[[Feelin' Alright?]]\". Dave Mason left the band shortly after the album's release, moving on to a solo career that produced a few minor hit songs in the 1970s. Traffic disbanded at the beginning of 1969, when Steve Winwood co-formed the [[supergroup (music)|supergroup]] [[Blind Faith]]. An album compiled from studio and live recordings, ''[[Last Exit (Traffic album)|Last Exit]]'', was released in 1969.\n\nBy 1970, Blind Faith had also broken up and Winwood, Jim Capaldi and Chris Wood reformed Traffic, with ''[[John Barleycorn Must Die]]'' being the band's comeback album. It became the band's biggest success in the United States to that point, reaching number 5. Their next LP, ''[[The Low Spark of High Heeled Boys]]'' (1971), went [[RIAA certification|platinum]] in the US and became popular on [[FM radio]], establishing Traffic as a leading [[progressive rock]] band. 1973's ''[[Shoot Out at the Fantasy Factory]]'' and 1974's ''[[When the Eagle Flies]]'' were further top 10 successes for the band in the US, and were both certified gold, though neither sold well in the UK. In 1974, the band broke up again. Steve Winwood went on to a successful solo career, with several hit singles and albums during the 1980s. Jim Capaldi also had some minor solo hits in the 1970s in his native UK but was less successful abroad. Chris Wood did sporadic session work until his death in 1983.\n\nWinwood and Capaldi reformed as Traffic for a final album and tour in 1994. Traffic were inducted into the [[Rock and Roll Hall of Fame]] in 2004. Jim Capaldi died the following year.",
  "last_revision_date": "2025-10-29T23:54:31Z",
  "genres": [
    441,
    634,
    976,
    984,
    986
  ]
}