{
  "description": "'''TVXQ''' (stylized as '''TVXQ!'''; {{Korean|hangul=동방신기|hanja=東方神起|rr=Dongbangsin'gi|lit=Rising Gods of the East}}, {{Lang-zh|s=東方神起|p=Dōngfāngshénqǐ}}), known as '''Tohoshinki''' in Japan, is a South Korean pop duo formed by [[SM Entertainment]], composed of [[U-Know Yunho]] and [[Max Changmin]].\n\nOriginally a five-member boy band which also consisted of members [[Kim Jae-joong|Hero Jaejoong]], [[Park Yoo-chun|Micky Yoochun]], and [[Kim Jun-su|Xiah Junsu]], TVXQ were immediately launched to mainstream recognition following the release of their first [[CD single|single]] \"[[Hug (song)|Hug]]\" (2004). Their first four albums as a quintet, ''[[Tri-Angle]]'' (2004), ''[[Rising Sun (TVXQ album)|Rising Sun]]'' (2005), ''[[\"O\"-Jung.Ban.Hap.]]'' (2006), and ''[[Mirotic]]'' (2008), received chart-topping commercial success in South Korea, with the latter winning the [[Golden Disk Awards|Golden Disk Award for Album of the Year]]. ''Mirotic'' contained the hit single \"[[Mirotic (song)|Mirotic]]\" (2008), touted by international [[music critics]] as a staple song of [[K-pop]]. TVXQ were one of the first Korean artists to lead the [[Korean Wave]] in Japan, where they were propelled to mainstream stardom following the release of their fourth Japanese album ''[[The Secret Code (album)|The Secret Code]]'' (2009).\n\nHowever, despite their commercial success, the band were plunged into legal turmoil and internal conflict when members Jaejoong, Yoochun, and Junsu attempted to split from their Korean agency SM Entertainment. Prior to the trio's departure in 2010, TVXQ released their last Japanese album as a quintet, ''[[Best Selection 2010]]'', which became the band's first album to top the [[Oricon Albums Chart]]. The album spawned two platinum-selling singles, including the ''[[One Piece]]'' theme song, \"[[Share the World / We Are!|Share the World]]\" (2009).\n\nAfter a year-long hiatus, TVXQ returned as a duo with their fifth Korean album ''[[Keep Your Head Down]]'' (2011), topping album charts in most major Asian markets upon release. Their first two Japanese albums as a duo, ''[[Tone (TVXQ album)|Tone]]'' (2011) and ''[[Time (TVXQ album)|Time]]'' (2013), solidified their success in Japan as it forged TVXQ's reputation as one of the top-touring artists in the country. Their tenth Japanese album ''[[XV (TVXQ album)|XV]]'' (2019) made TVXQ the first foreign music act in Japan to have six number-one albums in a row.\n\n\nSelling over 10 million physical records in the first 10 years of their career, TVXQ are one of Asia's most successful music acts of their generation. They are sometimes referred to as \"Asia's Stars\" and the \"Kings of K-pop\" for their immense success and contributions to the Korean Wave. According to the [[Oricon]], TVXQ have the most number-one singles and albums for a foreign artist in Japan, and are Japan's best-selling foreign artist of all time. Their [[Live Tour 2013: Time|Time Tour]], one of the highest-grossing concert tours of 2013, broke attendance records for foreign singers in Japan until 2017, when TVXQ broke their own record with their [[Begin Again: Live Tour 2017|Begin Again Tour]]. TVXQ are the first non-Japanese Asian artists to headline a nationwide five-Dome tour and the first foreign artists to headline the [[International Stadium Yokohama|Nissan Stadium]]. ''[[Billboard (magazine)|Billboard]]'' has described the band as \"K-pop royalty.\"",
  "last_revision_date": "2025-06-13T21:28:15Z"
}