{
  "name": "Twisted Sister",
  "description": "'''Twisted Sister''' is an American [[Heavy metal music|heavy metal]] band formed in 1972 in [[Ho-Ho-Kus, New Jersey]], and later based on [[Long Island]], [[New York (state)|New York]]. Their best-known songs include \"[[We're Not Gonna Take It (Twisted Sister song)|We're Not Gonna Take It]]\" and \"[[I Wanna Rock]]\", both of which were associated with [[Music video|music videos]] noted for their sense of [[slapstick]] humor. Besides their music, the band is equally remembered for their hairstyles and wearing androgynous clothing and make-up, leading to a categorization in the [[hair metal]] scene of the 1980s.\n\nTwisted Sister evolved from a band named Silver Star, and experienced several membership changes before settling on the classic lineup of [[Jay Jay French]] (guitars), [[Eddie Ojeda|Eddie \"Fingers\" Ojeda]] (guitars), [[Dee Snider]] (lead vocals), [[Mark Mendoza|Mark \"The Animal\" Mendoza]] (bass), and [[A. J. Pero]] (drums) in 1982.  It was this lineup which recorded the band's first four albums. Twisted Sister's first two albums, ''[[Under the Blade]]'' (1982) and ''[[You Can't Stop Rock 'n' Roll]]'' (1983), were critically well-received and earned the band underground popularity. The band achieved mainstream success with their third album, ''[[Stay Hungry (album)|Stay Hungry]]'' (1984), and its single \"We're Not Gonna Take It\", which was their only Top 40 hit on the [[Billboard Hot 100]]. Their next two albums, ''[[Come Out and Play (Twisted Sister album)|Come Out and Play]]'' (1985) and ''[[Love Is for Suckers]]'' (1987), did not match the success of ''Stay Hungry'', and Twisted Sister disbanded in 1988.\n\nDuring the late 1990s and early 2000s, the band played a series of one-off shows before reuniting more permanently in 2003. They released two more albums, ''[[Still Hungry (Twisted Sister album)|Still Hungry]]'' (2004), a re-recording of their third album, and a Christmas album, ''[[A Twisted Christmas]]'' (2006). Following Pero's death in 2015, the band embarked on a farewell tour and subsequently separated again after completing the tour in 2016. They announced another reunion in September 2025.\n\nIn 2013, Corey Deiterman of ''[[Houston Press|The Houston Press]]'' placed Twisted Sister eighth on his list of \"The 10 Worst Metal Bands of the '80s\". Conversely, two years later Twisted Sister was ranked at No. 73 on [[VH1]]'s list of \"100 greatest artists of hard rock\" in 2015. One year later, the staff of ''[[Loudwire]]'' named them the 43rd-best metal band of all time. In 2020, Jeff Mezydlo of ''[[Yardbarker]]'' included them in his list of \"the 20 greatest hair metal bands of all time\", placing them third.",
  "last_revision_date": "2026-01-18T17:30:58Z",
  "genres": [
    502,
    541,
    557,
    1124
  ]
}