{
  "name": "UB40",
  "description": "'''UB40''' are an English [[reggae]] band, formed in December 1978 in [[Birmingham]], England. The band has had more than 50 singles in the [[UK Singles Chart]] and has also achieved considerable international success. They have been nominated for the [[Grammy Award for Best Reggae Album]] four times and were nominated for the [[Brit Award]] for Best British Group in 1984. UB40 have sold more than 70 million records worldwide. The ethnic make-up of the band's original line-up was diverse, with musicians of [[English people|English]], [[Welsh people|Welsh]], [[Irish people|Irish]], [[Jamaican people|Jamaican]], [[Scottish people|Scottish]], and [[Yemeni people|Yemeni]] parentage.\n\nTheir [[hit single]]s include their debut track \"[[Food for Thought (song)|Food for Thought]]\" and two [[Billboard Hot 100|''Billboard'' Hot 100]] number-one hits, \"[[Red Red Wine#UB40 version|Red Red Wine]]\" and \"[[Can't Help Falling in Love#UB40 version|Can't Help Falling in Love]]\". Both songs also topped the [[UK Singles Chart]], as did the band's version of \"[[I Got You Babe#UB40 and Chrissie Hynde version|I Got You Babe]]\", recorded with [[Chrissie Hynde]]. The band's two most successful albums, ''[[Labour of Love]]'' (1983) and ''[[Promises and Lies]]'' (1993), both reached number one on the [[UK Albums Chart]]. UB40 and the English [[ska]] band [[Madness (band)|Madness]] share the record for the most weeks spent by a group in the UK singles chart during the 1980s, with 214 weeks each.  \n\nThe band's line-up remained stable for nearly 29 years, from March 1979 until January 2008, when frontman [[Ali Campbell]] left the band, followed shortly thereafter by keyboardist Mickey Virtue. Another member, Astro, continued with the band until November 2013, when he departed to team up with Campbell and Virtue in a new version of UB40. In 2014, legal advice was sought by the original band (now consisting of remaining co-founding members drummer Jimmy Brown, guitarist Robin Campbell, bassist Earl Falconer, percussionist Norman Hassan, and saxophonist Brian Travers, along with new vocalist Duncan Campbell), who took action against the group formed by Campbell, Virtue, and Astro over the use of the band name, as both parties were using it. On 5 July 2021, it was announced that Matt Doyle, formerly of the reggae band Kioko, would become the band's new vocalist following Duncan Campbell's retirement due to ill health.",
  "last_revision_date": "2025-05-24T21:50:05Z"
}