{
  "name": "Underoath",
  "description": "'''Underoath''' (styled as '''Underøath''' or '''UnderOath''') is an American   [[Rock music|rock]] band from [[Tampa, Florida]]. It was founded by lead vocalist [[Dallas Taylor (vocalist)|Dallas Taylor]] and guitarist Luke Morton in 1997 in [[Ocala, Florida]]; subsequently, its additional members were from Tampa, including drummer, singer and last remaining original member [[Aaron Gillespie]]. The band's current lineup consists of Gillespie, keyboardist Christopher Dudley, lead guitarist Timothy McTague, bassist Grant Brandell, and lead vocalist [[Spencer Chamberlain]]. Originally, the band identified as a [[Christian music|Christian]] group; they have since distanced themselves from Christianity.\n\nThe band's lineup shifted frequently during its early years. Taylor recorded ''[[Act of Depression]]'', ''[[Cries of the Past]]'', and ''[[The Changing of Times]]'' with the band and remained with the group until his departure in 2003; Chamberlain replaced him as lead vocalist, and the lineup has remained mostly stable since. The band then released ''[[They're Only Chasing Safety]]'' and ''[[Define the Great Line]]'', and both earned gold certifications by the [[RIAA]]. These two albums remain their most commercially successful releases, and provided them with mainstream status; the latter of the two holds their highest [[Billboard 200|''Billboard'' 200]] entry, peaking at no. 2. Following their sixth studio album, ''[[Lost in the Sound of Separation]]'', which also reached a top-ten peak on the [[Billboard 200|''Billboard'' 200]], Gillespie left the group and was replaced by former [[Norma Jean (band)|Norma Jean]] drummer [[Daniel Davison]]. Their seventh album, ''[[Ø (Disambiguation)]]'', was released in 2010; Chamberlain and McTague provided more prominent sung vocals in Gillespie's absence. On October 2, 2012, Underoath announced that they would be disbanding in 2013; they played their final show that January.\n\nOn August 17, 2015, the band announced they had reunited; in doing so, Gillespie returned to the lineup. After performing at [[A Day to Remember]]'s [[Self Help Fest]] in 2016, Underoath announced their eighth studio album, ''[[Erase Me (album)|Erase Me]]'', would be released 2018. It was their first album in 8 years and their first in 10 years with Gillespie; the band also publicly abandoned their Christian musical approach starting with this record. The follow-up, ''[[Voyeurist]]'', was released in January 2022, and their tenth studio album, ''The Place After This One'', came out in March 2025.",
  "last_revision_date": "2026-01-23T18:32:56Z",
  "genres": [
    255,
    413,
    773,
    964,
    1106
  ]
}