{
  "name": "Violent Femmes",
  "description": "'''Violent Femmes''' are an American [[folk punk]] band from [[Milwaukee|Milwaukee, Wisconsin]]. The band consists of founding members [[Gordon Gano]] (guitar, lead vocals) and [[Brian Ritchie]] (bass, backing vocals), joined by multi-instrumentalist [[Blaise Garza]] (joined 2004), and drummer John Sparrow (joined 2005). Former members of the band include drummers [[Victor DeLorenzo]] (1980–1993, 2002–2013), [[Guy Hoffman]] (1993–2002), and [[Brian Viglione]] (2013–2016). Violent Femmes are considered to be an integral part of the then-underground folk punk and [[alternative rock]] scenes of the 1980s, and remain influential or inspirational to the subsequent movements, particularly on [[folk rock]], [[indie rock]], [[grunge]], [[pop punk]], [[emo]], and the late 1980s and 1990s alternative rock scene.\n\nViolent Femmes have released 10 studio albums and 19 singles during the course of their career. The band found critical acclaim with the release of their [[Violent Femmes (album)|self-titled debut album]] in early 1983. Featuring many of their best-known songs, including \"[[Blister in the Sun]]\", \"Kiss Off\", \"[[Add It Up]]\" and \"[[Gone Daddy Gone]]\", ''Violent Femmes'' became the band's biggest-selling album and was eventually certified [[RIAA certification|platinum]] by the [[Recording Industry Association of America|RIAA]]. After releasing two more albums, ''[[Hallowed Ground (Violent Femmes album)|Hallowed Ground]]'' (1984) and ''[[The Blind Leading the Naked]]'' (1986), the band's future was uncertain and they split up in 1987 when Gano and Ritchie went solo. However, they regrouped a year later, releasing their fourth album ''[[3 (Violent Femmes album)|3]]'' (1989). The follow-up album, ''[[Why Do Birds Sing?]]'' (1991), contains the fan favorite and concert staple \"American Music\".\n\nIn 1993, founding member Victor DeLorenzo (percussion, snare drum) left Violent Femmes and was replaced by Guy Hoffman, who debuted on the band's sixth album ''[[New Times (album)|New Times]]'' (1994). Two more albums – ''[[Rock!!!!!]]'' (1995) and ''[[Freak Magnet]]'' (2000) – were released with this lineup before DeLorenzo rejoined the band in 2002 for what was to be a farewell tour. Following the commercial failure of ''Freak Magnet'', Violent Femmes did not release any more studio albums for almost two decades, although a number of compilation albums were released in the early 2000s, along with a few one-off songs. Some controversy over the licensing of the band's songs for commercial use led to an official break-up in 2009, though they re-formed in 2013 (shortly before DeLorenzo left Violent Femmes again), and have since released two more studio albums of new material: ''[[We Can Do Anything]]'' (2016) and ''[[Hotel Last Resort]]'' (2019).",
  "last_revision_date": "2025-05-13T19:50:25Z",
  "genres": [
    434,
    40
  ]
}