{
  "name": "Vision Eternel",
  "description": "'''Vision Eternel''' (originally spelled and stylized as '''Vision Éternel''') was a Canadian-American [[ambient rock]] band. Formed by guitarist Alexander Julien in [[Edison, New Jersey]], United States in January 2007, the band eventually relocated to [[Montreal]], Quebec, Canada in July 2007. The musical group's mainly [[instrumental]] sound has been described variously by critics as a blend of [[ambient music|ambient]], [[shoegaze]], [[post-rock]], [[ethereal wave|ethereal]], [[drone music|drone]], [[space rock]], [[emo]], [[post-black metal]], [[post-metal]], [[dark ambient]], [[dark wave]], [[experimental rock]], [[minimal music|minimal]], [[dream pop]], [[progressive rock]], [[modern classical]], and [[new-age music|new-age]].\n\nThe band released its debut extended play, {{lang|fr|Seul dans l'obsession}}, in 2007, followed by another extended play, {{lang|fr|Un automne en solitude}}, in 2008, both via American record label Mortification Records. While still based in New Jersey, the musical group included second guitarist Philip Altobelli, who joined after the release of the band's debut but departed before the recording of the second extended play. Once established in Quebec, the band was expanded with two more guitarists, Nidal Mourad and Adam Kennedy, but they departed before the recording of the band's third output. In 2009, a compilation album of the first two extended plays, ''An Anthology of Past Misfortunes'', was released by Japanese record label Frozen Veins Records.\n\nAfter signing with Canadian record label Abridged Pause Recordings, Vision Eternel followed up with three more extended plays: {{lang|fr|Abondance de périls}} in 2010, ''The Last Great Torch Song'' in 2012, and ''[[Echoes from Forgotten Hearts]]'' (originally composed as the score to a short film) in 2015. In 2018, Abridged Pause Recordings released the box set ''An Anthology of Past Misfortunes'', comprising remastered versions of the band's entire 2007–2015 output, along with a bonus compilation of previously unreleased demos and b-sides. The band's sixth extended play, ''[[For Farewell of Nostalgia]]'', was co-released by American record label [[Somewherecold Records]], Dutch record label Geertruida, and Abridged Pause Recordings in 2020. A deluxe edition of ''Echoes from Forgotten Hearts'' was issued by Geertruida in 2024, containing the previously unreleased soundtrack version of the recording, a bonus compilation of demos and alternate takes and mixes, and a non-fiction novel detailing the making of the release.",
  "last_revision_date": "2025-09-09T22:11:20Z",
  "genres": [
    48,
    412,
    956,
    1112
  ]
}