{
  "name": "Warren Zevon",
  "description": "'''Warren William Zevon''' ({{IPAc-en|'|z|iː|v|ɒ|n}}; January 24, 1947&nbsp;– September 7, 2003) was an American rock singer and songwriter. His most famous compositions include \"[[Werewolves of London]]\", \"[[Lawyers, Guns and Money]]\" and \"[[Roland the Headless Thompson Gunner]]\". All three songs are featured on his third album, ''[[Excitable Boy]]'' (1978), the title track of which is also well-known. He also wrote major hits that were recorded by other artists, including \"[[Poor Poor Pitiful Me]]\", \"[[Mohammed's Radio]]\", \"[[Carmelita (song)|Carmelita]]\" and \"[[Hasten Down the Wind (song)|Hasten Down the Wind]]\". Per ''[[The New York Times]]'', \"Mr. Zevon had a pulp-fiction imagination\" which yielded  \"terse, action-packed, gallows-humored tales that could sketch an entire screenplay in four minutes and often had death as a punchline. But there was also vulnerability and longing in Mr. Zevon's ballads, like 'Mutineer,' 'Accidentally Like a Martyr' and 'Hasten Down the Wind'.\"\n\nZevon had early music industry successes as a session musician, jingle composer, songwriter, touring musician, musical coordinator and bandleader. However, he struggled to break through with a solo career until [[Linda Ronstadt]] performed his music on her 1976 album ''[[Hasten Down the Wind]]''. It launched a cult following that lasted 25 years, with Zevon making occasional returns to album and single charts until his death from [[mesothelioma]] in 2003. He briefly found a new audience by teaming up with members of [[R.E.M.]] in the [[blues rock]] outfit [[Hindu Love Gods (band)|Hindu Love Gods]] for a 1990 album release, although no tour followed. In 2025, Zevon was inducted into the [[Rock and Roll Hall of Fame]] in the Musical Influence Award category.\n\nKnown for his dry wit and acerbic lyrics, he was a frequent guest on ''[[Late Night with David Letterman]]'' and the ''[[Late Show with David Letterman]]''. On [[Warren Zevon on the Late Show with David Letterman in 2002| Zevon's last appearance]], Letterman asked him if he had learned anything about matters of life and death. Zevon said he'd learned \"How much you're supposed to enjoy every sandwich.\"",
  "last_revision_date": "2025-11-15T21:21:09Z",
  "genres": [
    42,
    140,
    271,
    292,
    439,
    533,
    937,
    980,
    1048
  ]
}