{
  "page_title": "Waylon Jennings",
  "description": "'''Waylon Arnold Jennings''' (June 15, 1937&nbsp;– February 13, 2002) was an American singer, songwriter, musician, and actor. He is considered one of the pioneers of the [[Outlaw country|outlaw movement]] in [[country music]].\n\nJennings started playing guitar at age eight and performed at fourteen on [[KVOW]] radio, after which he formed his first band, the Texas Longhorns. Jennings left high school at age sixteen, determined to become a musician, and worked as a performer and DJ on KVOW, [[KDAV]], [[KYTI]], [[KBZO (AM)|KLLL]], in [[Coolidge, Arizona]], and [[Phoenix, Arizona|Phoenix]]. In 1958, [[Buddy Holly]] arranged Jennings's first recording session, a cover of [[Jole Blon]], and hired him to play bass. Jennings gave up his seat on the [[The Day the Music Died|ill-fated flight]] in 1959 that crashed and killed Holly, [[The Big Bopper|J. P. \"the Big Bopper\" Richardson]] and [[Ritchie Valens]].\n\nJennings then returned to Texas, taking several years off from music before eventually moving to Arizona and forming a [[rockabilly]] club band, [[the Waylors]], which became the house band at \"JD's\", a club in Tempe, Arizona. He recorded for independent label Trend Records and [[A&M Records]], but did not achieve success until moving to [[RCA Victor]] in 1965. In 1972 he acquired Neil Reshen as his manager, who negotiated significantly better touring and recording contracts. After he gained creative control from [[RCA Records]], he released the critically acclaimed albums ''[[Lonesome, On'ry and Mean]]'' and ''[[Honky Tonk Heroes]]'', followed by the hit albums ''[[Dreaming My Dreams (Waylon Jennings album)|Dreaming My Dreams]]'' and ''[[Are You Ready for the Country]]''.\n\nDuring the 1970s, Jennings drove [[outlaw country]]. With [[Willie Nelson]], [[Tompall Glaser]], and [[Jessi Colter]] he recorded country music's first platinum album, ''[[Wanted! The Outlaws]]''. It was followed by another platinum album, a first for any solo artist in country music, ''[[Ol' Waylon]]'', and the hit song \"[[Luckenbach, Texas (Back to the Basics of Love)|Luckenbach, Texas]]\". He was featured on the 1978 album ''[[White Mansions]]'', performed by various artists documenting the lives of Confederates during the Civil War. He appeared in films and television series, including ''[[Sesame Street]]'' and a stint as the balladeer on ''[[The Dukes of Hazzard]]'', composing and singing [[Theme from The Dukes of Hazzard (Good Ol' Boys)|its theme song]] and narrating the show.\n\nJennings struggled with [[cocaine]] addiction, which he overcame in 1984. Later, he joined the country [[supergroup (music)|supergroup]] [[The Highwaymen (country supergroup)|the Highwaymen]] with [[Willie Nelson]], [[Kris Kristofferson]], and [[Johnny Cash]], which released three albums between 1985 and 1995. During that period, Jennings released the successful album ''[[Will the Wolf Survive]]''. He has been named as one of the innovators of [[progressive country]].\n\nJennings toured less after 1997 to spend more time with his family. Between 1999 and 2001, health problems limited his appearances. In 2001, he was inducted into the [[Country Music Hall of Fame]]. In 2007, he was posthumously awarded the Cliffie Stone Pioneer Award by the [[Academy of Country Music]].",
  "last_revision_date": "2025-06-15T21:51:14Z"
}