{
  "name": "Wayne Shorter",
  "description": "'''Wayne Shorter''' (August 25, 1933 – March 2, 2023) was an American [[jazz]] saxophonist, composer, and bandleader, widely regarded as one of the most important and influential figures in the history of modern jazz. Over a career spanning more than six decades, he received 12 [[Grammy Awards]] and the [[Polar Music Prize]], and was acclaimed worldwide for his originality, compositional depth, and transformative approach to [[musical improvisation]].\n\nShorter first rose to mainstream prominence in 1959 after joining [[Art Blakey]]’s [[Jazz Messengers]], where he quickly became the ensemble’s primary composer and one of its defining creative voices. In 1964, he joined [[Miles Davis]]’s [[Miles Davis Quintet#Second Great Quintet|Second Great Quintet]], contributing compositions and performances that helped shape one of the most innovative and influential periods in jazz history. In 1970, he co-founded the [[jazz fusion]] band [[Weather Report]], which achieved international success and redefined the possibilities of electric jazz.\n\nAs a bandleader, Shorter recorded more than 20 albums, and many of his compositions—including works written for Davis, Weather Report, and his own groups—became enduring [[jazz standard]]s. His music is noted for its harmonic sophistication, narrative structure, and philosophical depth, earning sustained critical praise and influence across generations of musicians.\n\nShorter was especially acclaimed for his mastery of the [[soprano saxophone]], having shifted his primary focus from the [[Tenor saxophone|tenor]] in the late 1960s. Beginning in 1970, he dominated ''[[DownBeat]]'' magazine’s annual critics’ and readers’ polls on soprano saxophone, winning the critics’ poll for 10 consecutive years and the readers’ poll for 18.\n\nIn 2008, ''[[The New York Times]]'' music critic [[Ben Ratliff]] described Shorter as “probably jazz’s greatest living small-group composer and a contender for greatest living improviser,” a characterization that reflected his towering status within the genre.",
  "last_revision_date": "2026-01-19T07:21:46Z",
  "genres": [
    540,
    638,
    790,
    1231
  ]
}