{
  "page_title": "Weather Report",
  "description": "'''Weather Report''' was an American [[jazz fusion]] band active from 1970 to 1986. The band was founded in 1970 by Austrian keyboardist [[Joe Zawinul]], American saxophonist [[Wayne Shorter]], Czech bassist [[Miroslav Vitouš]], American drummer [[Alphonse Mouzon]] as well as American percussionists [[Don Alias]] and Barbara Burton. The band was initially co-led by Zawinul and Shorter but as the 1970s progressed, Zawinul became the primary composer and creative director of the group. Other prominent members throughout the band’s history included bassists [[Jaco Pastorius]], [[Alphonso Johnson]] and [[Victor Bailey (musician)|Victor Bailey]], drummers [[Chester Thompson]] and [[Peter Erskine]], and percussionists [[Airto Moreira]] and [[Alex Acuña]]. A quintet of Zawinul and Shorter plus a bassist, a drummer and a percussionist was the standard formation for Weather Report.\n\nThe band started as a free improvising group with avant-garde and experimental electronic leanings (pioneered by Zawinul); when Vitouš left Weather Report (due mostly to creative disagreements), Zawinul increasingly steered the band towards a funky, edgy sound incorporating elements of [[Rhythm and blues|R&B]] and native musics from around the world. Zawinul used the latest developments in synthesizer technology, and he took advantage of a large variety of sounds and tone colors to make the band stand out. During the first half of their career, Weather Report were seen as one of the defining acts in modern jazz, winning the [[DownBeat]] \"best album award\" five times in a row.\n\nAlongside bands such as [[Mahavishnu Orchestra]], [[Return to Forever]], and [[Herbie Hancock]]'s [[The Headhunters|Headhunters]] (all with members inspired by and partially responsible for the fusion-era work of [[Miles Davis]]), Weather Report is widely considered one of the defining bands of the [[jazz fusion]] genre.",
  "last_revision_date": "2025-06-15T17:19:48Z"
}