{
  "name": "Werrason",
  "description": "'''Noël Ngiama Makanda''' ({{abbr|born|born}}&nbsp;25 December 1965), known professionally as '''Werrason''', is a Congolese singer-songwriter, composer, producer, philanthropist, and the bandleader of [[Wenge Musica Maison Mère]]. He was a co-founding member of [[Wenge Musica]], a musical group that played a pivotal role in the development of the [[ndombolo]] dance music genre during the 1990s.\n\nNgiama is widely recognized as one of the emblematic figures of Wenge Musica. His compositions, such as \"Mulolo\", \"Kin É Bougé\" (featuring JB Mpiana), and notably \"Kala-Yi-Boeing\", are acclaimed as some of Wenge Musica's most distinguished works. Following Wenge Musica's disbandment in 1997 due to internal disputes between Ngiama and JB Mpiana, the band split into Wenge Musica Maison Mère, led by Ngiama, and Wenge BCBG, headed by JB Mpiana.\n\nIn December 1999, Wenge Musica Maison Mère released the ndombolo-infused album ''Solola Bien!'', which achieved gold certification and experienced immediate success across Africa and its diaspora in France. In September 2000, Wenge Musica Maison Mère became the second African act to perform and sell out the [[Accor Arena|Palais Omnisports de Paris-Bercy]] following [[Koffi Olomide|Koffi Olomidé]] earlier that year. With a career spanning nearly four decades, Werrason has produced numerous successful [[Album|studio albums]], including seven with Wenge Musica, nine with Wenge Musica Maison Mère, and four solo studio albums. Notable solo releases include ''Kibuisa Mpimpa'' (2001), ''Témoignage'' (2005), ''Sans Poteau'' (2015), and ''7 jours de la semaine'' (2017).\n\nAside from music, Ngiama is known for his humanitarian work. He founded the Werrason Foundation in 2000, a non-profit organization that aids orphans in the Democratic Republic of the Congo. Recognized as an \"[[International Association of World Peace Advocates|Ambassador For Peace]]\" and \"people's singer\" by the [[United Nations Global Compact]], Ngiama is an advocate for [[UNESCO]]'s initiatives against [[HIV/AIDS|AIDS]] and [[discrimination]].",
  "last_revision_date": "2025-09-01T22:11:14Z",
  "genres": [
    274,
    805,
    1131
  ]
}