{
  "name": "Whitesnake",
  "description": "'''Whitesnake''' are an English [[Rock music|rock]] band formed in [[London]] in 1978. The group were originally put together as the backing band for singer [[David Coverdale]], who had recently left [[Deep Purple]]. Though the band quickly developed into their own entity, Coverdale is the only constant member throughout their history.\n\nFollowing the ''[[Snakebite (album)|Snakebite]]'' EP in 1978, Whitesnake released the albums ''[[Trouble (Whitesnake album)|Trouble]]'' (1978) and ''[[Lovehunter]]'' (1979), which included the live staples \"[[Ain't No Love in the Heart of the City]]\" and \"Walking in the Shadow of the Blues\". Whitesnake soon began to make a name for themselves across the UK, Europe and Japan, with their subsequent albums ''[[Ready an' Willing]]'' (1980), ''[[Live... in the Heart of the City]]'' (1980), ''[[Come an' Get It]]'' (1981) and ''[[Saints & Sinners (Whitesnake album)|Saints & Sinners]]'' (1982) all reaching the top ten on the [[UK Albums Chart]]. By the mid-1980s, Coverdale had set his sights on North America, where Whitesnake remained largely unknown. With the backing of American label [[Geffen Records]], Whitesnake released ''[[Slide It In]]'' in 1984, featuring the singles \"[[Love Ain't No Stranger]]\" and \"[[Slow an' Easy]]\", which furthered the band's exposure through heavy airplay on [[MTV]]. In 1987, Whitesnake released their [[eponymous]] album, titled ''[[Whitesnake (album)|1987]]'' in the UK, their biggest success to date, selling over eight million copies in the [[United States]] and spawning the hit singles \"[[Here I Go Again]]\", \"[[Is This Love (Whitesnake song)|Is This Love]]\" and \"[[Still of the Night (song)|Still of the Night]]\". Whitesnake also adopted a more contemporary look, akin to the Los Angeles [[glam metal]] scene.\n\nAfter releasing ''[[Slip of the Tongue]]'' in 1989, Coverdale decided to take a break from the music industry. Aside from a few short-lived reunions related to the release of ''[[Greatest Hits (Whitesnake album)|Greatest Hits]]'' (1994) and ''[[Restless Heart (Whitesnake album)|Restless Heart]]'' (1997), Whitesnake remained mostly inactive until 2003, when Coverdale put together a new line-up to celebrate the band's 25th anniversary. Since then Whitesnake have released four more studio albums ''[[Good to Be Bad]]'' (2008), ''[[Forevermore (Whitesnake album)|Forevermore]]'' (2011), ''[[The Purple Album (Whitesnake album)|The Purple Album]]'' (2015), ''[[Flesh & Blood (Whitesnake album)|Flesh & Blood]]'' (2019) and toured extensively around the world.\n\nWhitesnake's early sound has been characterised by critics as [[blues rock]], but by the mid-1980s the band slowly began moving toward a more commercially accessible hard rock style. Topics such as love and sex are common in Whitesnake's lyrics, which make frequent use of sexual innuendos and double entendres. Whitesnake have been nominated for several awards during their career, including Best British Group at the [[1988 Brit Awards]]. They have also been featured on lists of the greatest hard rock bands of all time by several media outlets, while their songs and albums have appeared on many \"best of\" lists by outlets, such as [[VH1]] and ''[[Rolling Stone]]''.",
  "last_revision_date": "2025-08-15T12:53:12Z",
  "genres": [
    141,
    494,
    533
  ]
}