{
  "name": "William Control",
  "description": "'''William Control''' is an American music project founded in 2008 in [[Seattle]], [[Washington (state)|Washington]].  It was the side project of [[Aiden]]'s [[Wil Francis|William Francis]] before Aiden's hiatus, and he later operated as William Control full-time.  'William Control' therefore refers to both the band as a whole and to Francis as his stage name.  Francis was signed to [[Victory Records]] before starting his own independent label, Control Records, and, as William Control, has released five full-length albums (''[[Hate Culture]]'', ''[[Noir (William Control album)|Noir]]'', ''[[Silentium Amoris]]'', ''[[The Neuromancer (album)|The Neuromancer]]'' and ''Revelations'' (split into four separate EPs)), an EP (''Novus Ordo Seclorum''), two acoustic albums (''Skeleton Strings'' and ''[[Skeleton Strings 2]]''), two live DVDs (''[[Live In London Town DVD|Live in London Town]]'' and ''[[Babylon (William Control DVD)|Babylon]]'') and a remix album (''[[Remix (William Control)|Remix]])''.  The first part of ''Revelations'', ''[[The Pale (EP)|The Pale]]'', was released on October 14, 2016.  The second EP ''[[The Black (EP)|The Black]]'' followed on February 17, 2017, and the third, entitled ''[[The Red (EP)|The Red]]'', followed that with a release date of July 14 of the same year.  The album was completed by ''[[The White (William Control EP)|The White]]'' on November 24.\n\nAs of ''The Neuromancer'' Francis referred to his band as 'The Neuromantic Boys', and the 'Boys' most recently consisted of Kenneth Fletcher (who has been a part of the William Control project since ''Hate Culture'') and Ian MacWilliams, with Crilly Ashes standing in for Fletcher for some of 2017's live shows.  Control announced his retirement from music/touring in October 2017, stating that he was going to concentrate on his clothing businesses and Control Records. In June 2018, Control temporarily ceased work due to accusations of sexual assault and the formation of a \"sex cult\" with women, some of whom were fans of his.",
  "last_revision_date": "2025-03-09T14:48:23Z",
  "genres": [
    1157,
    505,
    325
  ]
}