{
  "name": "Wolfmother",
  "description": "'''Wolfmother''' is an Australian [[hard rock]] band from Sydney. Formed in 2004, the group is centred around vocalist and guitarist [[Andrew Stockdale]], who is the only constant member of the line-up. The band has been through many personnel changes since their formation. The original – and most commercially successful – line-up included bassist and keyboardist [[Chris Ross (musician)|Chris Ross]] and drummer Myles Heskett. Ross and Heskett left Wolfmother after four years in 2008.\n\nStockdale, Ross and Heskett formed Wolfmother in 2004 after several years of informal jamming. Signing with independent label [[Modular Recordings]], the band released their [[Wolfmother (album)|self-titled debut album]] in Australia in 2005, which reached number 3 on the domestic albums chart. It was released internationally by [[Interscope Records|Interscope]] and [[Island Records]] the following year, and to date has sold in excess of 1.5 million copies worldwide. After Ross and Heskett departed, Stockdale rebuilt the band with the addition of bassist and keyboardist [[Ian Peres]], rhythm guitarist Aidan Nemeth and drummer Dave Atkins, who released ''[[Cosmic Egg]]'' in 2009.\n\nIn recent years, the line-up of Wolfmother has continued to change frequently, with their commercial popularity fluctuating. The band's planned third album ''[[Keep Moving (Andrew Stockdale album)|Keep Moving]]'' was released as Stockdale's solo debut in 2013, with a new line-up including drummer Vin Steele issuing ''[[New Crown]]'' independently the following year. In 2016, the group released ''[[Victorious (Wolfmother album)|Victorious]]'' as their first album on a major label since ''Cosmic Egg'', and subsequently toured with [[Alex Carapetis]] on drums. Wolfmother's personnel have continued to change, with Stockdale subsequently releasing and touring in promotion of his second solo album ''Slipstream'' in 2018.",
  "last_revision_date": "2025-06-04T19:51:59Z",
  "genres": [
    141,
    533,
    808,
    1150
  ]
}