{
  "name": "X Japan",
  "description": "{{nihongo|'''X Japan'''|エックス・ジャパン|Ekkusu Japan|lead=yes}} is a Japanese [[Rock music|rock]] band from [[Chiba Prefecture|Chiba]], formed in 1982 by drummer and pianist [[Yoshiki (musician)|Yoshiki]] and lead vocalist [[Toshi (musician)|Toshi]]. Starting as a predominantly [[power metal|power]]/[[speed metal]] band with heavy [[Symphonic metal|symphonic]] elements, they later gravitated towards a [[progressive metal|progressive]] sound with an emphasis on ballads. Besides being one of the first Japanese acts to achieve mainstream success while on an independent label, the group is widely credited as one of the pioneers of [[visual kei]], a movement among Japanese musicians comparable to Western [[glam rock|glam]].\n\nOriginally named {{nihongo|'''X'''|エックス|Ekkusu}}, they released their debut album, ''[[Vanishing Vision]]'' (1988), on Yoshiki's own [[Extasy Records]] one year after finalizing their lineup including bassist [[Taiji (musician)|Taiji]], lead guitarist [[Hide (musician)|Hide]] and rhythm guitarist [[Pata (musician)|Pata]]. They achieved breakthrough success in 1989 with the release of their second and major-label debut album, ''[[Blue Blood (X Japan album)|Blue Blood]]''. Following 1991's ''[[Jealousy (X Japan album)|Jealousy]]'', Taiji left the band in early 1992. He was replaced by [[Heath (musician)|Heath]] and the group changed their name to X Japan before producing the mini-album ''[[Art of Life]]'' (1993), which is composed solely of the 29-minute title track. In 1995 the group dropped most of its original visual kei aesthetics in favor of a more casual look and released ''[[Dahlia (album)|Dahlia]]'' (1996), which like their two previous albums debuted at number one. X Japan performed their last concert at the [[Tokyo Dome]] on December 31, 1997, making it the last of five consecutive sold-out New Year's Eve concerts the group held at the stadium.\n\nAfter ten years, X Japan reunited in 2007 and recorded the new song \"[[I.V. (X Japan song)|I.V.]]\". Over the next two years they performed several concerts, including their first overseas show in Hong Kong, and formally added [[Sugizo]] as lead guitarist in place of Hide, who died in 1998, before holding a North American tour in 2010. In 2011, the band went on their first world tour throughout Europe, South America and Asia. Shortly after reuniting, work began on their [[Untitled X Japan album|sixth studio album]]. During its ten years of production, several release dates were announced, but it remains unreleased despite Yoshiki's claim of its completion in September 2018. The band has been inactive since that same year.\n\nX Japan has released five studio albums, six live albums, and 21 singles. In 2003, [[HMV]] Japan ranked the band at number 40 on their list of the 100 most important Japanese pop acts. In 2007, ''[[Rolling Stone|Rolling Stone Japan]]'' ranked ''Blue Blood'' number 15 on its list of the 100 Greatest Japanese Rock Albums of All Time. In 2017, ''[[Loudwire]]'' named X Japan the Best Metal Band from Japan. It has been reported that X Japan has sold over 30 million records.",
  "last_revision_date": "2025-09-30T07:05:59Z",
  "genres": [
    493,
    547,
    954,
    962,
    1044,
    1148,
    1175
  ]
}