{
  "name": "XPDC",
  "description": "'''XPDC''' is a Malaysian [[rock kapak]] band that originated in 1983 as Tragedy, formed in [[Kuala Lumpur]] by vocalist Syed \"Mael\" Ismail bin Syed Ibrahim, guitarist Mohd \"Izo\" Zulkifly bin Nik Hussin, bassist Man Tobey, and drummer Yazid. In 1988, they changed their name to XPDC at the behest of their longtime producer, [[JS Kevin]], and Man Tobey and Yazid left shortly after. They were replaced by Azuar bin Tasi (Zuar) and Lee Space, respectively.\n\nThe group signed a contract with [[Life Records]] and released their debut album, ''Darjah Satu'', in 1990. Lee Space departed shortly after and was replaced by Amy ([[Handy Black]]). The band's second album, ''Timur Barat'', came out in 1992 and was followed by ''Kita Peng-Yu'' (1994) and ''Brutal'' (1997). That year, Mael left the group, and Mohd Ali bin Ismail (Ali), formerly of [[Terra Rossa (band)|Terra Rossa]], took his place. Saiful \"Lola\" Rizla bin Kamaruddin replaced Amy on drums in 1997, and a year later, the band released their first live album, titled ''Konsert Raksasa XPDC Brutal, Stadium Negara''. Their next studio recording, ''Samurai'', came out the same year. In 2000, longtime bassist Zuar left the band and was replaced by Yan Toi. XPDC released the album ''V6'' in 2002. It was their last collaboration with producer JS Kevin, before his death in August. Lola left in 2003, swapping places with [[Search (band)|Search]] drummer Pae Sembah Bumi (Pae).\n\nIn 2005, XPDC issued the compilation ''Medley Rugged'' and subsequently held a reunion concert with some of its original members, including Izo, Mael, Zuar, and Amy, after which they went on hiatus. Ali and Pae formed the group [[Mpire]], and Yan Toi joined [[Lefthanded (band)|Lefthanded]]. In 2007, XPDC released the compilation album ''Rock Union'', and in 2009, they returned, still in the lineup of Izo, Mael, Zuar, and Amy, and issued a new record, titled ''Rasopariso''.\n\nIn 2014, XPDC released the compilation ''XPDC Hits 25 Tahun'', and a year later, Mael left the band once more. In 2018, with a lineup consisting of the returning Ali and Lola, Izo (the band's only remaining original member), and new bassist Eddie, XPDC issued their eighth, and to date latest album, ''Doa''.\n\nIn the 2020s, Ali began experiencing heart problems, and the band hired Mamu to replace him onstage until his recovery.",
  "last_revision_date": "2025-11-18T13:36:48Z",
  "genres": [
    535,
    551,
    1053,
    1223
  ]
}