{
  "name": "Yeng Constantino",
  "description": "'''Josephine''' \"'''Yeng'''\" '''Eusebio Constantino-Asuncion''' (born December 4, 1988) is a Filipino singer, songwriter, composer and guitarist. She is referred to as the ''Philippines Pop Rock Royalty'' and is regarded as one of the biggest hitmakers in Philippine music industry. In 2006, she won the title \"Grand Star Dreamer\" in the [[Pinoy Dream Academy (season 1)|inaugural season]] of ''[[Pinoy Dream Academy]]'', the Philippine edition of [[Endemol]]'s reality TV show ''[[Star Academy]]''. \n\nConstantino is among the most critically acclaimed and best-selling Filipino artists of all time. Throughout her career, she was honored with around 70 accolades and recognitions including a [[FAMAS Award]], 7 [[Awit Awards]], 9 [[Myx Music Award|Myx Music Awards]] and 5 [[PMPC Star Awards for Movies|PMPC Star Awards for Music]] among many others. In 2020, Ikaw reached the 100 million mark on [[YouTube]], becoming the second most viewed OPM music video by a female artist in the Philippines. In 2023, Constantino signed with [[Republic Records]]. The same year, she was named as the global ambassadress of Academy of Rock, the only music school in [[Singapore]] devoted to teaching rock and popular music.\n\n''[[Salamat (album)|Salamat]],'' her debut album, was released in January 2007 under [[Star Music|Star Records]]. It was a commercial success, being triple Platinum in the Philippines and produced five #1 hits and six top 10 hits, the most by any female artist. It peaked at number-one and spent nine months inside the Top 10 on the Odyssey album charts. The following year, her sophomore album ''[[Journey (Yeng Constantino album)|Journey]]'' was released. It was certified Gold by [[Philippine Association of the Record Industry|PARI]] and peaked at number-eight on the Odyssey album charts and spent 3 months inside the Top 20. In the next five years, Constantino released the self-written album ''[[Lapit]]'' (2009) and ''[[Metamorphosis (Yeng Constantino album)|Metamorphosis]]'' (2013) where the latter reached Gold status and produced the hit song \"Chinito\". In November 2014, ''[[All About Love (Yeng Constantino album)|All About Love]]'' was released. It peaked at No. 5 on Astrovisions Albums Chart and became the first-full Filipino album to be released on [[Spotify]]. It was certified Gold and produced the hit song \"[[Ikaw (song)|Ikaw]]\". In 2018, she released her latest album ''Synesthesia''.  \n\n[[CNN Philippines]] listed \"[[Hawak Kamay]]\" at number 12 in their list of the Best Filipino Love Songs of the last 25 years. As an occasional actress, Constantino has starred in a film [[Write About Love (film)|Write About Love]] and took home the Best Supporting Actress Award in [[Metro Manila Film Festival|MMFF]] 2019, an affirmation of her acting prowess. As of May 2023, Constantino has more than 350 million career streams on Spotify, becoming one of the most streamed Filipino artists of all time.",
  "last_revision_date": "2025-07-22T05:13:34Z",
  "genres": [
    40,
    909,
    911,
    926
  ]
}