{
  "name": "Yes",
  "description": "'''Yes''' are an English [[progressive rock]] band formed in London in 1968. Comprising [[List of Yes band members|20 full-time musicians]] over their career, their most notable members include lead singer [[Jon Anderson]], bassist [[Chris Squire]], guitarists [[Steve Howe]] and [[Trevor Rabin]], drummers [[Bill Bruford]] and [[Alan White (Yes drummer)|Alan White]], and keyboardists [[Tony Kaye (musician)|Tony Kaye]] and [[Rick Wakeman]]. The band have explored several musical styles and are often regarded as progressive rock pioneers. Since February 2023, the band's line-up consists of Howe, keyboardist [[Geoff Downes]], bassist [[Billy Sherwood]], singer [[Jon Davison]], and drummer [[Jay Schellen]].\n\nFounded by Anderson, Squire, Bruford, Kaye, and guitarist [[Peter Banks]], Yes began performing a mix of original songs and covers of [[Rock music|rock]], [[Pop music|pop]], [[blues]], and [[jazz]] songs, as showcased on their first two albums, ''[[Yes (Yes album)|Yes]]'' (1969) and ''[[Time and a Word]]'' (1970). A change of direction in 1970 after the replacement of Banks with Howe led to a series of successful progressive rock albums, with four consecutive US platinum or multi-platinum sellers: ''[[The Yes Album]]'' (1971); ''[[Fragile (Yes album)|Fragile]]'' (1971), which included the successful single \"[[Roundabout (Yes song)|Roundabout]]\"; ''[[Close to the Edge]]'' (1972); and the live album ''[[Yessongs]]'' (1973). Further albums ''[[Tales from Topographic Oceans]]'' (1973), ''[[Relayer]]'' (1974), ''[[Going for the One]]'' (1977), and ''[[Tormato]]'' (1978) were also commercially successful. Yes earned a reputation for their elaborate stage sets, light displays, and album covers designed by [[Roger Dean (artist)|Roger Dean]]. During this time, Kaye and Bruford were replaced by Wakeman and White respectively, while keyboardist [[Patrick Moraz]] joined for ''Relayer'' and its subsequent tour. In 1980, growing musical differences led to Anderson and Wakeman's departures; Yes recruited Downes and singer [[Trevor Horn]] for the album ''[[Drama (Yes album)|Drama]]'' (1980) before disbanding in 1981.\n\nIn 1983, Squire, White, Anderson, and Kaye reformed Yes with Rabin joining. Rabin's songwriting moved the band toward a more pop-oriented sound, which resulted in their highest-selling album ''[[90125]]'' (1983) featuring the band's only US number-one single, \"[[Owner of a Lonely Heart]]\", and the successful follow-up album ''[[Big Generator]]'' (1987). In 1989, the offshoot group [[Anderson Bruford Wakeman Howe]] formed and released a [[Anderson Bruford Wakeman Howe (album)|self-titled album]]. At the suggestion of the record company, the groups merged into a short-lived eight-piece line-up for ''[[Union (Yes album)|Union]]'' (1991) and its tour. Yes regularly released studio albums from 1994 to 2001 with varying levels of success, beginning a second hiatus in 2004. After a 2008 world tour was cancelled, Yes enlisted [[Benoît David]] as the new lead singer, then Davison in 2012. Squire died in 2015, leaving the band with no original members. White, the longest-tenured member at that point, died in 2022. Former members [[Yes Featuring Jon Anderson, Trevor Rabin, Rick Wakeman|Anderson, Rabin, and Wakeman toured]] from 2016 to 2018. Yes's latest album, ''[[Mirror to the Sky]]'', was released in 2023.\n\nYes are one of the most successful, influential, and longest-lasting progressive rock bands. Their [[Yes discography|discography]] spans 23 studio albums, with 13.5 million [[Recording Industry Association of America]] (RIAA)-certified albums sold in the US and more than 30 million worldwide. In 1985, they won a [[Grammy Award]] for [[Grammy Award for Best Rock Instrumental Performance|Best Rock Instrumental Performance]] with \"[[Cinema (Yes song)|Cinema]]\". They were ranked No. 94 on [[VH1]]'s ''100 Greatest Artists of Hard Rock''. In April 2017, Yes—represented by Anderson, Squire, Bruford, Kaye, Howe, Wakeman, White, and Rabin—were inducted into the [[Rock and Roll Hall of Fame]].",
  "last_revision_date": "2025-09-13T06:22:56Z",
  "genres": [
    66,
    932,
    964
  ]
}