{
  "name": "Yo Yo Honey Singh",
  "description": "'''Hirdesh Singh'''{{Efn|Singh confirmed that his name on passport is '''Hirdesh Singh''' while clarifying that '''Honey''' is his childhood nickname in [[The Lallantop]] interview.<ref>{{Cite AV media |url=https://www.youtube.com/watch?v=LP1gfUFP4go |title=Yo Yo Honey Singh ने Badshah, Raftar से असल लड़ाई, Mafia Mundeer, Shahrukh, नशे पर खुलकर बतायाGITN |date=2024-08-31 |last=The Lallantop |access-date=2024-09-01 |via=YouTube}}</ref> While Yo Yo is a slang which Singh picked up from his African-American friends which means \"your very own\".<ref>{{Cite web |date=15 March 2015 |title=15 facts to know about Rapper Yo Yo Honey Singh |work=Hindustan Times |url=https://www.hindustantimes.com/punjab/15-facts-to-know-about-rapper-yo-yo-honey-singh/story-uCB9qxZH7lh9gNfUwQsZBK.html}}</ref> Wikipedia's introduction uses only the legal name.|name=n1}} (born 15 March 1983), known professionally as '''Yo Yo Honey Singh''', is an Indian [[singer]], [[rapper]], [[record producer]] and actor. He is credited with popularizing [[hip-hop]] and [[rap]] with the mainstream Indian audience. Much of his [[Transgressive art|transgressive]] work during the late 2000s and early 2010s made him a [[controversy|controversial figure]].\n\nSingh commenced his career as a hip-hop [[record producer|music producer]] with his underground album ''Desi By Nature'' (2003), subsequently working as a session and recording artist within the underground music scene for other artists until the release of his debut studio album, ''[[International Villager]]'' (2011). In 2012, after the album's success and his mainstream breakout, he set a record as the highest paid Indian artist by charging 75 lakh INR for a track in [[Bollywood]]. As of 2025, he is the richest Indian rapper. He released further singles that charted and released his second studio album ''[[Desi Kalakaar]]'' (2014). After its success, Singh took a musical hiatus due in part to struggle with [[bipolar disorder]] with [[psychosis]] caused by alcoholism and drug abuse.\n\nAfter a brief recovery in 2016 followed by a relapse, he returned to the music industry with the release of his single \"Makhna\" (2018), which was well received. He released his albums ''[[Honey 3.0]]'' (2023) followed by ''Glory'' (2024), the latter accompanied by the lead single \"Millionaire\", which exceeded 300 million views on YouTube in less than 7 months and more than 150 million Spotify streams.\n\nSingh's nickname growing up was \"Honey\". \"Yo Yo\" came from Singh picking up the slang from his African-American hip-hop friends, which means \"your very own\" in [[African American Vernacular English]]. Singh added \"Yo Yo\" to his name professionally, after winning an award in Punjab during his early career. He interpret's the name to mean \"your very own Honey Singh\". Singh stated that the name indicates that he is \"one amongst the people and is the people's artist\".",
  "last_revision_date": "2025-08-20T14:44:53Z",
  "genres": [
    38,
    119,
    277,
    396,
    483,
    552,
    924,
    925,
    1218
  ]
}