{
  "name": "Yu-Peng Chen",
  "description": "'''Chen Yupeng''' ({{lang-zh|s=陈宇鹏|p=Chén Yǔpéng}}; born January 15, 1984), also known by his stage name '''Chen Zhiyi''' ({{lang-zh|s=陈致逸|p=Chén Zhìyì}}), is a Chinese composer and music producer best known for writing the soundtrack of ''[[Genshin Impact]]'', an [[open-world]] [[action role-playing]] video game by [[HoYoverse]]. His work is known for its style of integrating traditional [[Chinese musical instrument]]s with Western orchestral arrangements. From 2019 to 2023, he was a music producer at [[HOYO-MiX]], the in-house music studio of miHoYo, and led the music production of the game.\n\nChen was educated at Shenzhen Arts School and the [[Shanghai Conservatory of Music]], and studied under the tutelage of experienced musicians who influenced his work later in his career. While he studied in college, he was already involved in composing and producing film and television music. Even before his career, his musical works won awards at various events. Chen established the Yupeng Music Studio in 2014, which had cooperative relations with many recording studios and music groups in Beijing and Shanghai, and produced works for companies, including Click Music Ltd., [[Tencent]], and [[NetEase]].\n\nIn the early 2010s, Chen collaborated with the accoladed composer [[Chan Kwong-wing]] to produce scores for veteran film directors. Their score for [[Wong Jing]]'s ''[[The Last Tycoon (2012 film)|The Last Tycoon]]'' (2012) earned them a nomination for the \"Best Original Film Score\" at the [[32nd Hong Kong Film Awards]]. The duo would not win an award until their work for ''[[The Founding of an Army]]'' (2017), which earned the Golden Deer Award for the \"Best Original Music Score\" at the [[Changchun Film Festival|14th Changchun Film Festival]]. They also produced the score for [[Andrew Lau]]'s ''[[The Captain (2019 film)|The Captain]]'' (2019), one of the [[List of highest-grossing films in China#Top 50 all-time highest-grossing films|all-time highest-grossing films in China]]. Chen had scored several films by [[Raymond Yip]], most being horror or thrillers.",
  "last_revision_date": "2025-05-01T11:51:08Z"
}