{
  "name": "Zohra Al Fassiya",
  "description": "'''Zohra Al Fassiya''' ({{langx|ar|زهرة الفاسية}}, {{langx|he|זוהרה אלפסיה}}) was a [[Moroccan people|Moroccan]] singer and poet. Considered as the queen of the [[Malhun|melhoun]] and [[Gharnati music|gharnati]] genres, and one of the pioneers of modern Arabic music, she was the first female recording artist in Morocco, and her songs were widely celebrated throughout Morocco and Algeria, where she collaborated with lyricists and musicians from Oran and Tlemcen. Although her songs were mostly secular in nature (being the popular music of the time in Morocco), many of the melodies have later been modified to be fit religious Jewish liturgical songs (called piyyutim) as well.\n\nBorn in [[Sefrou]], near [[Fez, Morocco|Fez]], at the feet of the mountains of Atlas in a modest [[Moroccan Jewish]] family, she started to sing at a very early age when she performed religious songs at her synagogue. During her youth, she started to sing in coffee houses and cabarets near towns and in [[Casablanca]]. Her songs were mostly secular gharnati songs ([[Andalusian Arabic]] songs originally from [[Granada]], Spain, and very popular among the Muslims of Andalusian background and [[Moroccan Jews|Moroccan]] and [[Algerian Jews]] in the 19th century), as well as Malhun, which are long Moroccan poems.\n\nDuring the 1940s, she had her own orchestra and started to write her own songs. She was heavily aired on radio stations, both in Morocco and Algeria, and was extremely well known and loved by the public. Al Fassiya's Jewish identity was not considered to be problematic in Morocco during the height of her fame. In fact, the King of [[Morocco]], [[Mohammed V of Morocco|Mohammed V]], was so impressed by her voice that he invited her to sing at his court. Al Fassiya also worked with other artists such as [[Samy Elmaghribi]], who wrote some of her songs. She released more than 17 albums between the years 1947-1957 .\n\nIn 1962, following many fellow [[Mizrahi Jews]] who fled Arab countries due to mounting persecution following the establishment of the [[State of Israel]], Al Fassiya [[aliyah|immigrated to Israel]]. However, despite her superstar status in Morocco and North Africa, Al Fassiya's talent went unrecognized in Israel outside of the Moroccan immigrant community, as the state-run media and cultural institutions preferred to promote Western sounding music. As with many [[Mizrahi Jews|Mizrahi]] / [[Sephardi Jew]]ish immigrants (Jews from Arab and Islamic countries), Al Fassiya faced discrimination in Israel, and she came to live in miserable and lonely conditions in [[Ashkelon]]. Despite this humiliating fate, Al Fassiya was often invited to sing at private celebrations (such as weddings) in the Moroccan community in Israel. [[Israeli people|Israeli]]-[[Moroccan Jews|Moroccan]] poet [[Erez Biton]], who visited her when he was employed as a social worker, was so moved by her fate that he dedicated a poem to her story; this poem has now been added to the national school curriculum in Israel, and serves as a centrepiece in discussion of the state's harsh Westernization policies in the 20th century.\n\nIn her last years, Zohra Al Fassiya lived in a nursing home in Ashkelon. She died at age 89 in 1994 and was buried there.",
  "last_revision_date": "2025-11-14T02:23:47Z",
  "genres": [
    724
  ]
}