{
  "name": "Étoile de Dakar",
  "description": "'''Étoile de Dakar''' (“Star of Dakar”) were a leading music group of [[Senegal]] in the late 1970s and early 1980s. [[Youssou N'Dour]] was one of the singers in the band and the band was a major part of N'Dour's rise to stardom in Senegal.\n\nThe group was formed in 1978 by Badou Ndiaye and several other members of the [[Star Band]] after a dispute with Ibra Kasse, the band leader of the Star Band and the owner of the Miami nightclub in [[Dakar]] where the Star Band performed. The Star Band was one of Dakar's best known nightclub house bands of the 1960s and 1970s. After Kasse fired one of the members of the Star Band, several other members quit in support of the musician, joining forces to create Étoile de Dakar. Singer El Hadji Faye who previously sang for the Star Band but left because he did not get along with Ibra Kasse, was recruited at the outset. Later singer Mar Seck, from No. 1 de Dakar, was brought into the band.\n\nÉtoile de Dakar played an important part in the evolution of Senegalese popular music, helping incorporate elements of traditional Senegalese music into the popular Latin-influenced dance styles that dominated, creating a style that became known as [[Mbalax]]. They quickly became one of the city's most popular bands benefiting from the introduction of cassettes in Senegal. Previous bands had released their work on LPs which made their music less accessible to the general population of Senegal than cassette tapes. Their song \"Jalo\" was included on the [[Island Records]] compilation [[Sound d’Afrique]], which was important in bringing African music to western ears in 1981.\n\nDespite their success, the group was short-lived due to internal problems. In 1981, Étoile de Dakar split into two groups, Étoile 2000 and Super Étoile de Dakar. Étoile 2000 featured singers El Hadji Faye and Eric M'Backe and other members of Étoile de Dakar. Étoile 2000 debuted with a hit song, \"Boubacar N'gary\", that was reportedly played all day long by one Senegalese radio station. After three similar sounding cassette albums, the band called it quits. Youssou N'Dour and other members formed Super Étoile de Dakar which produced four albums on cassette in just a few months and eventually evolved into N'Dour's backing band. Mar Seck returned to No. 1 de Dakar.",
  "last_revision_date": "2025-03-21T17:27:57Z"
}