{
  "name": "Weird Al Yankovic",
  "description": "'''Alfred Matthew''' \"'''Weird Al'''\" '''Yankovic''' ({{IPAc-en|'|j|æ|ŋ|k|ə|v|ᵻ|k|audio=en-us-Yankovic.oga}};{{r|Pronounciation_Yankovic}} born October 23, 1959) is an American comedy musician, writer, and actor. He is best known for writing and performing [[Comedy music|comedy songs]] that often [[Parody music|parody]] specific songs by contemporary musicians. He also performs original songs that are style [[pastiche]]s of the work of other acts, as well as [[polka]] medleys of popular songs, most of which feature his trademark [[accordion]].\n\nSince having one of his comedy songs aired on ''[[Dr. Demento|The Dr. Demento Radio Show]]'' in 1976 at age 16, Yankovic has sold more than 12 million albums ({{as of|2025|lc=y}}),{{r|Harrington_20070810}}{{r|Greenburg_20150226}} recorded more than 150 parodies and original songs, and performed more than 2,000 live shows.\n\nHis work has earned him five [[Grammy Award]]s and a further 11 nominations, four [[RIAA certification|gold records]] and six [[RIAA certification|platinum records]] in the U.S. His first top ten ''[[Billboard charts|Billboard]]'' album (''[[Straight Outta Lynwood]]'') and single (\"[[White & Nerdy]]\") were both released in 2006, nearly three decades into his career. His fourteenth studio album, ''[[Mandatory Fun]]'' (2014), became his first number-one album during its debut week.\n\nYankovic's success has been attributed to his effective use of music videos to further parody pop culture, the songs' original artists, and the original music videos themselves. He has directed some of his own music videos and has also directed music videos for other artists including [[Ben Folds]], [[Hanson (band)|Hanson]], [[the Black Crowes]], and [[The Presidents of the United States of America (band)|the Presidents of the United States of America]]. With the decline of music television and the onset of social media, he used YouTube and other video sites to publish his videos; this strategy helped boost sales of his later albums. He has not released a full album since ''Mandatory Fun'', opting instead for timely releases of singles.\n\nIn addition to his music career, Yankovic wrote and starred in the film ''[[UHF (film)|UHF]]'' (1989) and the television series ''[[The Weird Al Show]]'' (1997). He has produced two satirical films about his own life, ''[[The Compleat Al]]'' (1985) and ''[[Weird: The Al Yankovic Story]]'' (2022). He has acted in several television shows and web series, in addition to starring in ''[[Al TV]]'' specials on [[MTV]]. He has also written two children's books, ''When I Grow Up'' (2011) and ''My New Teacher and Me!'' (2013).",
  "last_revision_date": "2025-10-20T18:50:01Z",
  "genres": [
    270,
    927
  ]
}